Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1399 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8caf4): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x7367): ../Core/Src/MSTScheduler.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x5e550): /Users/enricoalberti/Desktop/FILES/Embedded/FreeRTOS/MST4FreeRTOS/MST-FreeRTOS-Example/Debug
    <1a>   DW_AT_ranges      : 0x1b
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 38 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5eba): size_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 11 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

    <63>   DW_AT_name        : (indirect string, offset: 0x69ed9): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x74782): __uint16_t
    <6c>   DW_AT_decl_file   : 4
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 11 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x88f75): short unsigned int
 <1><7a>: Abbrev Number: 5 (DW_TAG_typedef)
    <7b>   DW_AT_name        : (indirect string, offset: 0x5692d): __int32_t
    <7f>   DW_AT_decl_file   : 4
    <80>   DW_AT_decl_line   : 77
    <81>   DW_AT_decl_column : 24
    <82>   DW_AT_type        : <0x86>
 <1><86>: Abbrev Number: 11 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0xb90c): long int
 <1><8d>: Abbrev Number: 5 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x59b6a): __uint32_t
    <92>   DW_AT_decl_file   : 4
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 11 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x2ac0a): long unsigned int
 <1><a0>: Abbrev Number: 11 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1ce24): long long unsigned int
 <1><a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x675ae): uint16_t
    <ac>   DW_AT_decl_file   : 5
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 8 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 5 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x5692f): int32_t
    <bd>   DW_AT_decl_file   : 5
    <be>   DW_AT_decl_line   : 44
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x7a>
 <1><c4>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x66e24): uint32_t
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 48
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x8d>
 <1><d0>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <d1>   DW_AT_type        : <0xc4>
 <1><d5>: Abbrev Number: 8 (DW_TAG_const_type)
    <d6>   DW_AT_type        : <0xd0>
 <1><da>: Abbrev Number: 5 (DW_TAG_typedef)
    <db>   DW_AT_name        : (indirect string, offset: 0x42637): TaskFunction_t
    <df>   DW_AT_decl_file   : 6
    <e0>   DW_AT_decl_line   : 35
    <e1>   DW_AT_decl_column : 16
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <ec>   DW_AT_prototyped  : 1
    <ec>   DW_AT_sibling     : <0xf6>
 <2><f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f1>   DW_AT_type        : <0xf6>
 <2><f5>: Abbrev Number: 0
 <1><f6>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 8 (DW_TAG_const_type)
    <f9>   DW_AT_type        : <0xf6>
 <1><fd>: Abbrev Number: 5 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x67924): StackType_t
    <102>   DW_AT_decl_file   : 2
    <103>   DW_AT_decl_line   : 55
    <104>   DW_AT_decl_column : 24
    <105>   DW_AT_type        : <0xc4>
 <1><109>: Abbrev Number: 5 (DW_TAG_typedef)
    <10a>   DW_AT_name        : (indirect string, offset: 0x83bb9): BaseType_t
    <10e>   DW_AT_decl_file   : 2
    <10f>   DW_AT_decl_line   : 56
    <110>   DW_AT_decl_column : 14
    <111>   DW_AT_type        : <0x86>
 <1><115>: Abbrev Number: 8 (DW_TAG_const_type)
    <116>   DW_AT_type        : <0x109>
 <1><11a>: Abbrev Number: 5 (DW_TAG_typedef)
    <11b>   DW_AT_name        : (indirect string, offset: 0x83bb8): UBaseType_t
    <11f>   DW_AT_decl_file   : 2
    <120>   DW_AT_decl_line   : 57
    <121>   DW_AT_decl_column : 23
    <122>   DW_AT_type        : <0x99>
 <1><126>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <127>   DW_AT_type        : <0x11a>
 <1><12b>: Abbrev Number: 8 (DW_TAG_const_type)
    <12c>   DW_AT_type        : <0x11a>
 <1><130>: Abbrev Number: 5 (DW_TAG_typedef)
    <131>   DW_AT_name        : (indirect string, offset: 0x4da3c): TickType_t
    <135>   DW_AT_decl_file   : 2
    <136>   DW_AT_decl_line   : 63
    <137>   DW_AT_decl_column : 19
    <138>   DW_AT_type        : <0xc4>
 <1><13c>: Abbrev Number: 8 (DW_TAG_const_type)
    <13d>   DW_AT_type        : <0x130>
 <1><141>: Abbrev Number: 11 (DW_TAG_base_type)
    <142>   DW_AT_byte_size   : 1
    <143>   DW_AT_encoding    : 8	(unsigned char)
    <144>   DW_AT_name        : (indirect string, offset: 0x2ce41): char
 <1><148>: Abbrev Number: 8 (DW_TAG_const_type)
    <149>   DW_AT_type        : <0x141>
 <1><14d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <14e>   DW_AT_byte_size   : 4
    <14e>   DW_AT_type        : <0x148>
 <1><152>: Abbrev Number: 8 (DW_TAG_const_type)
    <153>   DW_AT_type        : <0x14d>
 <1><157>: Abbrev Number: 20 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0x3e822): xLIST_ITEM
    <15c>   DW_AT_byte_size   : 20
    <15d>   DW_AT_decl_file   : 7
    <15e>   DW_AT_decl_line   : 140
    <15f>   DW_AT_decl_column : 8
    <160>   DW_AT_sibling     : <0x1a6>
 <2><164>: Abbrev Number: 2 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x6bb2e): xItemValue
    <169>   DW_AT_decl_file   : 7
    <16a>   DW_AT_decl_line   : 143
    <16b>   DW_AT_decl_column : 33
    <16c>   DW_AT_type        : <0x130>
    <170>   DW_AT_data_member_location: 0
 <2><171>: Abbrev Number: 2 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x6d325): pxNext
    <176>   DW_AT_decl_file   : 7
    <177>   DW_AT_decl_line   : 144
    <178>   DW_AT_decl_column : 42
    <179>   DW_AT_type        : <0x1a6>
    <17d>   DW_AT_data_member_location: 4
 <2><17e>: Abbrev Number: 2 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0xc20c): pxPrevious
    <183>   DW_AT_decl_file   : 7
    <184>   DW_AT_decl_line   : 145
    <185>   DW_AT_decl_column : 42
    <186>   DW_AT_type        : <0x1a6>
    <18a>   DW_AT_data_member_location: 8
 <2><18b>: Abbrev Number: 2 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x5236d): pvOwner
    <190>   DW_AT_decl_file   : 7
    <191>   DW_AT_decl_line   : 146
    <192>   DW_AT_decl_column : 9
    <193>   DW_AT_type        : <0xf6>
    <197>   DW_AT_data_member_location: 12
 <2><198>: Abbrev Number: 2 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x662eb): pvContainer
    <19d>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 147
    <19f>   DW_AT_decl_column : 37
    <1a0>   DW_AT_type        : <0x1e0>
    <1a4>   DW_AT_data_member_location: 16
 <2><1a5>: Abbrev Number: 0
 <1><1a6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1a7>   DW_AT_byte_size   : 4
    <1a7>   DW_AT_type        : <0x157>
 <1><1ab>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x80278): xLIST
    <1b0>   DW_AT_byte_size   : 20
    <1b1>   DW_AT_decl_file   : 7
    <1b2>   DW_AT_decl_line   : 164
    <1b3>   DW_AT_decl_column : 16
    <1b4>   DW_AT_sibling     : <0x1e0>
 <2><1b8>: Abbrev Number: 2 (DW_TAG_member)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x6a669): uxNumberOfItems
    <1bd>   DW_AT_decl_file   : 7
    <1be>   DW_AT_decl_line   : 167
    <1bf>   DW_AT_decl_column : 23
    <1c0>   DW_AT_type        : <0x126>
    <1c4>   DW_AT_data_member_location: 0
 <2><1c5>: Abbrev Number: 2 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x4c167): pxIndex
    <1ca>   DW_AT_decl_file   : 7
    <1cb>   DW_AT_decl_line   : 168
    <1cc>   DW_AT_decl_column : 35
    <1cd>   DW_AT_type        : <0x232>
    <1d1>   DW_AT_data_member_location: 4
 <2><1d2>: Abbrev Number: 2 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x8bb2): xListEnd
    <1d7>   DW_AT_decl_file   : 7
    <1d8>   DW_AT_decl_line   : 169
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0x226>
    <1de>   DW_AT_data_member_location: 8
 <2><1df>: Abbrev Number: 0
 <1><1e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e1>   DW_AT_byte_size   : 4
    <1e1>   DW_AT_type        : <0x1ab>
 <1><1e5>: Abbrev Number: 5 (DW_TAG_typedef)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x734d5): ListItem_t
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 150
    <1ec>   DW_AT_decl_column : 27
    <1ed>   DW_AT_type        : <0x157>
 <1><1f1>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x59f9d): xMINI_LIST_ITEM
    <1f6>   DW_AT_byte_size   : 12
    <1f7>   DW_AT_decl_file   : 7
    <1f8>   DW_AT_decl_line   : 152
    <1f9>   DW_AT_decl_column : 8
    <1fa>   DW_AT_sibling     : <0x226>
 <2><1fe>: Abbrev Number: 2 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x6bb2e): xItemValue
    <203>   DW_AT_decl_file   : 7
    <204>   DW_AT_decl_line   : 155
    <205>   DW_AT_decl_column : 33
    <206>   DW_AT_type        : <0x130>
    <20a>   DW_AT_data_member_location: 0
 <2><20b>: Abbrev Number: 2 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x6d325): pxNext
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 156
    <212>   DW_AT_decl_column : 42
    <213>   DW_AT_type        : <0x1a6>
    <217>   DW_AT_data_member_location: 4
 <2><218>: Abbrev Number: 2 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0xc20c): pxPrevious
    <21d>   DW_AT_decl_file   : 7
    <21e>   DW_AT_decl_line   : 157
    <21f>   DW_AT_decl_column : 42
    <220>   DW_AT_type        : <0x1a6>
    <224>   DW_AT_data_member_location: 8
 <2><225>: Abbrev Number: 0
 <1><226>: Abbrev Number: 5 (DW_TAG_typedef)
    <227>   DW_AT_name        : (indirect string, offset: 0x96615): MiniListItem_t
    <22b>   DW_AT_decl_file   : 7
    <22c>   DW_AT_decl_line   : 159
    <22d>   DW_AT_decl_column : 32
    <22e>   DW_AT_type        : <0x1f1>
 <1><232>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <233>   DW_AT_byte_size   : 4
    <233>   DW_AT_type        : <0x1e5>
 <1><237>: Abbrev Number: 8 (DW_TAG_const_type)
    <238>   DW_AT_type        : <0x232>
 <1><23c>: Abbrev Number: 5 (DW_TAG_typedef)
    <23d>   DW_AT_name        : (indirect string, offset: 0x3bd28): List_t
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 171
    <243>   DW_AT_decl_column : 3
    <244>   DW_AT_type        : <0x1ab>
 <1><248>: Abbrev Number: 5 (DW_TAG_typedef)
    <249>   DW_AT_name        : (indirect string, offset: 0x7c28d): TaskHandle_t
    <24d>   DW_AT_decl_file   : 8
    <24e>   DW_AT_decl_line   : 70
    <24f>   DW_AT_decl_column : 37
    <250>   DW_AT_type        : <0x254>
 <1><254>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <255>   DW_AT_byte_size   : 4
    <255>   DW_AT_type        : <0x259>
 <1><259>: Abbrev Number: 27 (DW_TAG_structure_type)
    <25a>   DW_AT_name        : (indirect string, offset: 0x79489): tskTaskControlBlock
    <25e>   DW_AT_declaration : 1
 <1><25e>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <25f>   DW_AT_encoding    : 7	(unsigned)
    <25f>   DW_AT_byte_size   : 1
    <25f>   DW_AT_type        : <0x59>
    <263>   DW_AT_decl_file   : 8
    <263>   DW_AT_decl_line   : 80
    <264>   DW_AT_decl_column : 1
    <264>   DW_AT_sibling     : <0x28d>
 <2><268>: Abbrev Number: 12 (DW_TAG_enumerator)
    <269>   DW_AT_name        : (indirect string, offset: 0x3f260): eRunning
    <26d>   DW_AT_const_value : 0
 <2><26e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <26f>   DW_AT_name        : (indirect string, offset: 0x35cda): eReady
    <273>   DW_AT_const_value : 1
 <2><274>: Abbrev Number: 12 (DW_TAG_enumerator)
    <275>   DW_AT_name        : (indirect string, offset: 0x2f006): eBlocked
    <279>   DW_AT_const_value : 2
 <2><27a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <27b>   DW_AT_name        : (indirect string, offset: 0x52081): eSuspended
    <27f>   DW_AT_const_value : 3
 <2><280>: Abbrev Number: 12 (DW_TAG_enumerator)
    <281>   DW_AT_name        : (indirect string, offset: 0x68d7e): eDeleted
    <285>   DW_AT_const_value : 4
 <2><286>: Abbrev Number: 12 (DW_TAG_enumerator)
    <287>   DW_AT_name        : (indirect string, offset: 0x167d6): eInvalid
    <28b>   DW_AT_const_value : 5
 <2><28c>: Abbrev Number: 0
 <1><28d>: Abbrev Number: 5 (DW_TAG_typedef)
    <28e>   DW_AT_name        : (indirect string, offset: 0x30cb): eTaskState
    <292>   DW_AT_decl_file   : 8
    <293>   DW_AT_decl_line   : 87
    <294>   DW_AT_decl_column : 3
    <295>   DW_AT_type        : <0x25e>
 <1><299>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <29a>   DW_AT_encoding    : 7	(unsigned)
    <29a>   DW_AT_byte_size   : 1
    <29a>   DW_AT_type        : <0x59>
    <29e>   DW_AT_decl_file   : 8
    <29e>   DW_AT_decl_line   : 91
    <29f>   DW_AT_decl_column : 1
    <29f>   DW_AT_sibling     : <0x2c2>
 <2><2a3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <2a4>   DW_AT_name        : (indirect string, offset: 0x39886): eNoAction
    <2a8>   DW_AT_const_value : 0
 <2><2a9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x61a33): eSetBits
    <2ae>   DW_AT_const_value : 1
 <2><2af>: Abbrev Number: 12 (DW_TAG_enumerator)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x9831f): eIncrement
    <2b4>   DW_AT_const_value : 2
 <2><2b5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x64557): eSetValueWithOverwrite
    <2ba>   DW_AT_const_value : 3
 <2><2bb>: Abbrev Number: 12 (DW_TAG_enumerator)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x27511): eSetValueWithoutOverwrite
    <2c0>   DW_AT_const_value : 4
 <2><2c1>: Abbrev Number: 0
 <1><2c2>: Abbrev Number: 5 (DW_TAG_typedef)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x4d53b): eNotifyAction
    <2c7>   DW_AT_decl_file   : 8
    <2c8>   DW_AT_decl_line   : 97
    <2c9>   DW_AT_decl_column : 3
    <2ca>   DW_AT_type        : <0x299>
 <1><2ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2cf>   DW_AT_byte_size   : 4
    <2cf>   DW_AT_type        : <0xfd>
 <1><2d3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x880db): xTASK_STATUS
    <2d8>   DW_AT_byte_size   : 36
    <2d9>   DW_AT_decl_file   : 8
    <2da>   DW_AT_decl_line   : 137
    <2db>   DW_AT_decl_column : 16
    <2dc>   DW_AT_sibling     : <0x356>
 <2><2e0>: Abbrev Number: 2 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x982de): xHandle
    <2e5>   DW_AT_decl_file   : 8
    <2e6>   DW_AT_decl_line   : 139
    <2e7>   DW_AT_decl_column : 15
    <2e8>   DW_AT_type        : <0x248>
    <2ec>   DW_AT_data_member_location: 0
 <2><2ed>: Abbrev Number: 2 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x2f5fa): pcTaskName
    <2f2>   DW_AT_decl_file   : 8
    <2f3>   DW_AT_decl_line   : 140
    <2f4>   DW_AT_decl_column : 14
    <2f5>   DW_AT_type        : <0x14d>
    <2f9>   DW_AT_data_member_location: 4
 <2><2fa>: Abbrev Number: 2 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x97d10): xTaskNumber
    <2ff>   DW_AT_decl_file   : 8
    <300>   DW_AT_decl_line   : 141
    <301>   DW_AT_decl_column : 14
    <302>   DW_AT_type        : <0x11a>
    <306>   DW_AT_data_member_location: 8
 <2><307>: Abbrev Number: 2 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x540b4): eCurrentState
    <30c>   DW_AT_decl_file   : 8
    <30d>   DW_AT_decl_line   : 142
    <30e>   DW_AT_decl_column : 13
    <30f>   DW_AT_type        : <0x28d>
    <313>   DW_AT_data_member_location: 12
 <2><314>: Abbrev Number: 2 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x3ac28): uxCurrentPriority
    <319>   DW_AT_decl_file   : 8
    <31a>   DW_AT_decl_line   : 143
    <31b>   DW_AT_decl_column : 14
    <31c>   DW_AT_type        : <0x11a>
    <320>   DW_AT_data_member_location: 16
 <2><321>: Abbrev Number: 2 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x57355): uxBasePriority
    <326>   DW_AT_decl_file   : 8
    <327>   DW_AT_decl_line   : 144
    <328>   DW_AT_decl_column : 14
    <329>   DW_AT_type        : <0x11a>
    <32d>   DW_AT_data_member_location: 20
 <2><32e>: Abbrev Number: 2 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x61086): ulRunTimeCounter
    <333>   DW_AT_decl_file   : 8
    <334>   DW_AT_decl_line   : 145
    <335>   DW_AT_decl_column : 11
    <336>   DW_AT_type        : <0xc4>
    <33a>   DW_AT_data_member_location: 24
 <2><33b>: Abbrev Number: 2 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x43c08): pxStackBase
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 146
    <342>   DW_AT_decl_column : 15
    <343>   DW_AT_type        : <0x2ce>
    <347>   DW_AT_data_member_location: 28
 <2><348>: Abbrev Number: 2 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x3feca): usStackHighWaterMark
    <34d>   DW_AT_decl_file   : 8
    <34e>   DW_AT_decl_line   : 147
    <34f>   DW_AT_decl_column : 25
    <350>   DW_AT_type        : <0xa7>
    <354>   DW_AT_data_member_location: 32
 <2><355>: Abbrev Number: 0
 <1><356>: Abbrev Number: 5 (DW_TAG_typedef)
    <357>   DW_AT_name        : (indirect string, offset: 0x1c295): TaskStatus_t
    <35b>   DW_AT_decl_file   : 8
    <35c>   DW_AT_decl_line   : 148
    <35d>   DW_AT_decl_column : 3
    <35e>   DW_AT_type        : <0x2d3>
 <1><362>: Abbrev Number: 5 (DW_TAG_typedef)
    <363>   DW_AT_name        : (indirect string, offset: 0x3541): TimerHandle_t
    <367>   DW_AT_decl_file   : 9
    <368>   DW_AT_decl_line   : 77
    <369>   DW_AT_decl_column : 34
    <36a>   DW_AT_type        : <0x373>
 <1><36e>: Abbrev Number: 8 (DW_TAG_const_type)
    <36f>   DW_AT_type        : <0x362>
 <1><373>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <374>   DW_AT_byte_size   : 4
    <374>   DW_AT_type        : <0x378>
 <1><378>: Abbrev Number: 27 (DW_TAG_structure_type)
    <379>   DW_AT_name        : (indirect string, offset: 0x16e51): tmrTimerControl
    <37d>   DW_AT_declaration : 1
 <1><37d>: Abbrev Number: 5 (DW_TAG_typedef)
    <37e>   DW_AT_name        : (indirect string, offset: 0x49f62): TimerCallbackFunction_t
    <382>   DW_AT_decl_file   : 9
    <383>   DW_AT_decl_line   : 82
    <384>   DW_AT_decl_column : 16
    <385>   DW_AT_type        : <0x389>
 <1><389>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <38a>   DW_AT_byte_size   : 4
    <38a>   DW_AT_type        : <0x38e>
 <1><38e>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <38f>   DW_AT_prototyped  : 1
    <38f>   DW_AT_sibling     : <0x399>
 <2><393>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <394>   DW_AT_type        : <0x362>
 <2><398>: Abbrev Number: 0
 <1><399>: Abbrev Number: 11 (DW_TAG_base_type)
    <39a>   DW_AT_byte_size   : 4
    <39b>   DW_AT_encoding    : 4	(float)
    <39c>   DW_AT_name        : (indirect string, offset: 0x7a75c): float
 <1><3a0>: Abbrev Number: 11 (DW_TAG_base_type)
    <3a1>   DW_AT_byte_size   : 8
    <3a2>   DW_AT_encoding    : 4	(float)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x10b3a): double
 <1><3a7>: Abbrev Number: 19 (DW_TAG_array_type)
    <3a8>   DW_AT_type        : <0xc4>
    <3ac>   DW_AT_sibling     : <0x3b7>
 <2><3b0>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <3b1>   DW_AT_type        : <0x3d>
    <3b5>   DW_AT_upper_bound : 0
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 29 (DW_TAG_structure_type)
    <3b8>   DW_AT_byte_size   : 92
    <3b9>   DW_AT_decl_file   : 10
    <3b9>   DW_AT_decl_line   : 904
    <3bb>   DW_AT_decl_column : 9
    <3bb>   DW_AT_sibling     : <0x4d4>
 <2><3bf>: Abbrev Number: 4 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x4d329): CTRL
    <3c4>   DW_AT_decl_file   : 10
    <3c4>   DW_AT_decl_line   : 906
    <3c6>   DW_AT_decl_column : 18
    <3c6>   DW_AT_type        : <0xd0>
    <3ca>   DW_AT_data_member_location: 0
 <2><3cb>: Abbrev Number: 4 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x2a4e1): CYCCNT
    <3d0>   DW_AT_decl_file   : 10
    <3d0>   DW_AT_decl_line   : 907
    <3d2>   DW_AT_decl_column : 18
    <3d2>   DW_AT_type        : <0xd0>
    <3d6>   DW_AT_data_member_location: 4
 <2><3d7>: Abbrev Number: 4 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x4a1a6): CPICNT
    <3dc>   DW_AT_decl_file   : 10
    <3dc>   DW_AT_decl_line   : 908
    <3de>   DW_AT_decl_column : 18
    <3de>   DW_AT_type        : <0xd0>
    <3e2>   DW_AT_data_member_location: 8
 <2><3e3>: Abbrev Number: 4 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x790ed): EXCCNT
    <3e8>   DW_AT_decl_file   : 10
    <3e8>   DW_AT_decl_line   : 909
    <3ea>   DW_AT_decl_column : 18
    <3ea>   DW_AT_type        : <0xd0>
    <3ee>   DW_AT_data_member_location: 12
 <2><3ef>: Abbrev Number: 4 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x2f289): SLEEPCNT
    <3f4>   DW_AT_decl_file   : 10
    <3f4>   DW_AT_decl_line   : 910
    <3f6>   DW_AT_decl_column : 18
    <3f6>   DW_AT_type        : <0xd0>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 4 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0xc3ea): LSUCNT
    <400>   DW_AT_decl_file   : 10
    <400>   DW_AT_decl_line   : 911
    <402>   DW_AT_decl_column : 18
    <402>   DW_AT_type        : <0xd0>
    <406>   DW_AT_data_member_location: 20
 <2><407>: Abbrev Number: 4 (DW_TAG_member)
    <408>   DW_AT_name        : (indirect string, offset: 0x5ac8a): FOLDCNT
    <40c>   DW_AT_decl_file   : 10
    <40c>   DW_AT_decl_line   : 912
    <40e>   DW_AT_decl_column : 18
    <40e>   DW_AT_type        : <0xd0>
    <412>   DW_AT_data_member_location: 24
 <2><413>: Abbrev Number: 4 (DW_TAG_member)
    <414>   DW_AT_name        : (indirect string, offset: 0x55d9e): PCSR
    <418>   DW_AT_decl_file   : 10
    <418>   DW_AT_decl_line   : 913
    <41a>   DW_AT_decl_column : 18
    <41a>   DW_AT_type        : <0xd5>
    <41e>   DW_AT_data_member_location: 28
 <2><41f>: Abbrev Number: 4 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x81cf): COMP0
    <424>   DW_AT_decl_file   : 10
    <424>   DW_AT_decl_line   : 914
    <426>   DW_AT_decl_column : 18
    <426>   DW_AT_type        : <0xd0>
    <42a>   DW_AT_data_member_location: 32
 <2><42b>: Abbrev Number: 4 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x46296): MASK0
    <430>   DW_AT_decl_file   : 10
    <430>   DW_AT_decl_line   : 915
    <432>   DW_AT_decl_column : 18
    <432>   DW_AT_type        : <0xd0>
    <436>   DW_AT_data_member_location: 36
 <2><437>: Abbrev Number: 4 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x1d3d): FUNCTION0
    <43c>   DW_AT_decl_file   : 10
    <43c>   DW_AT_decl_line   : 916
    <43e>   DW_AT_decl_column : 18
    <43e>   DW_AT_type        : <0xd0>
    <442>   DW_AT_data_member_location: 40
 <2><443>: Abbrev Number: 4 (DW_TAG_member)
    <444>   DW_AT_name        : (indirect string, offset: 0x86d75): RESERVED0
    <448>   DW_AT_decl_file   : 10
    <448>   DW_AT_decl_line   : 917
    <44a>   DW_AT_decl_column : 18
    <44a>   DW_AT_type        : <0x3a7>
    <44e>   DW_AT_data_member_location: 44
 <2><44f>: Abbrev Number: 4 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0x490ac): COMP1
    <454>   DW_AT_decl_file   : 10
    <454>   DW_AT_decl_line   : 918
    <456>   DW_AT_decl_column : 18
    <456>   DW_AT_type        : <0xd0>
    <45a>   DW_AT_data_member_location: 48
 <2><45b>: Abbrev Number: 4 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0x4629c): MASK1
    <460>   DW_AT_decl_file   : 10
    <460>   DW_AT_decl_line   : 919
    <462>   DW_AT_decl_column : 18
    <462>   DW_AT_type        : <0xd0>
    <466>   DW_AT_data_member_location: 52
 <2><467>: Abbrev Number: 4 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0x1d47): FUNCTION1
    <46c>   DW_AT_decl_file   : 10
    <46c>   DW_AT_decl_line   : 920
    <46e>   DW_AT_decl_column : 18
    <46e>   DW_AT_type        : <0xd0>
    <472>   DW_AT_data_member_location: 56
 <2><473>: Abbrev Number: 4 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0x86d7f): RESERVED1
    <478>   DW_AT_decl_file   : 10
    <478>   DW_AT_decl_line   : 921
    <47a>   DW_AT_decl_column : 18
    <47a>   DW_AT_type        : <0x3a7>
    <47e>   DW_AT_data_member_location: 60
 <2><47f>: Abbrev Number: 4 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x1115a): COMP2
    <484>   DW_AT_decl_file   : 10
    <484>   DW_AT_decl_line   : 922
    <486>   DW_AT_decl_column : 18
    <486>   DW_AT_type        : <0xd0>
    <48a>   DW_AT_data_member_location: 64
 <2><48b>: Abbrev Number: 4 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0x58999): MASK2
    <490>   DW_AT_decl_file   : 10
    <490>   DW_AT_decl_line   : 923
    <492>   DW_AT_decl_column : 18
    <492>   DW_AT_type        : <0xd0>
    <496>   DW_AT_data_member_location: 68
 <2><497>: Abbrev Number: 4 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x1d51): FUNCTION2
    <49c>   DW_AT_decl_file   : 10
    <49c>   DW_AT_decl_line   : 924
    <49e>   DW_AT_decl_column : 18
    <49e>   DW_AT_type        : <0xd0>
    <4a2>   DW_AT_data_member_location: 72
 <2><4a3>: Abbrev Number: 4 (DW_TAG_member)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x86d89): RESERVED2
    <4a8>   DW_AT_decl_file   : 10
    <4a8>   DW_AT_decl_line   : 925
    <4aa>   DW_AT_decl_column : 18
    <4aa>   DW_AT_type        : <0x3a7>
    <4ae>   DW_AT_data_member_location: 76
 <2><4af>: Abbrev Number: 4 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x61116): COMP3
    <4b4>   DW_AT_decl_file   : 10
    <4b4>   DW_AT_decl_line   : 926
    <4b6>   DW_AT_decl_column : 18
    <4b6>   DW_AT_type        : <0xd0>
    <4ba>   DW_AT_data_member_location: 80
 <2><4bb>: Abbrev Number: 4 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x462f5): MASK3
    <4c0>   DW_AT_decl_file   : 10
    <4c0>   DW_AT_decl_line   : 927
    <4c2>   DW_AT_decl_column : 18
    <4c2>   DW_AT_type        : <0xd0>
    <4c6>   DW_AT_data_member_location: 84
 <2><4c7>: Abbrev Number: 4 (DW_TAG_member)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x1d5b): FUNCTION3
    <4cc>   DW_AT_decl_file   : 10
    <4cc>   DW_AT_decl_line   : 928
    <4ce>   DW_AT_decl_column : 18
    <4ce>   DW_AT_type        : <0xd0>
    <4d2>   DW_AT_data_member_location: 88
 <2><4d3>: Abbrev Number: 0
 <1><4d4>: Abbrev Number: 30 (DW_TAG_typedef)
    <4d5>   DW_AT_name        : (indirect string, offset: 0x254e6): DWT_Type
    <4d9>   DW_AT_decl_file   : 10
    <4d9>   DW_AT_decl_line   : 929
    <4db>   DW_AT_decl_column : 3
    <4db>   DW_AT_type        : <0x3b7>
 <1><4df>: Abbrev Number: 29 (DW_TAG_structure_type)
    <4e0>   DW_AT_byte_size   : 16
    <4e1>   DW_AT_decl_file   : 10
    <4e1>   DW_AT_decl_line   : 1421
    <4e3>   DW_AT_decl_column : 9
    <4e3>   DW_AT_sibling     : <0x518>
 <2><4e7>: Abbrev Number: 4 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x677ef): DHCSR
    <4ec>   DW_AT_decl_file   : 10
    <4ec>   DW_AT_decl_line   : 1423
    <4ee>   DW_AT_decl_column : 18
    <4ee>   DW_AT_type        : <0xd0>
    <4f2>   DW_AT_data_member_location: 0
 <2><4f3>: Abbrev Number: 4 (DW_TAG_member)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x7bd16): DCRSR
    <4f8>   DW_AT_decl_file   : 10
    <4f8>   DW_AT_decl_line   : 1424
    <4fa>   DW_AT_decl_column : 18
    <4fa>   DW_AT_type        : <0xd0>
    <4fe>   DW_AT_data_member_location: 4
 <2><4ff>: Abbrev Number: 4 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x774c1): DCRDR
    <504>   DW_AT_decl_file   : 10
    <504>   DW_AT_decl_line   : 1425
    <506>   DW_AT_decl_column : 18
    <506>   DW_AT_type        : <0xd0>
    <50a>   DW_AT_data_member_location: 8
 <2><50b>: Abbrev Number: 4 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x4872e): DEMCR
    <510>   DW_AT_decl_file   : 10
    <510>   DW_AT_decl_line   : 1426
    <512>   DW_AT_decl_column : 18
    <512>   DW_AT_type        : <0xd0>
    <516>   DW_AT_data_member_location: 12
 <2><517>: Abbrev Number: 0
 <1><518>: Abbrev Number: 30 (DW_TAG_typedef)
    <519>   DW_AT_name        : (indirect string, offset: 0x3b434): CoreDebug_Type
    <51d>   DW_AT_decl_file   : 10
    <51d>   DW_AT_decl_line   : 1427
    <51f>   DW_AT_decl_column : 3
    <51f>   DW_AT_type        : <0x4df>
 <1><523>: Abbrev Number: 5 (DW_TAG_typedef)
    <524>   DW_AT_name        : (indirect string, offset: 0x5db66): __compar_fn_t
    <528>   DW_AT_decl_file   : 11
    <529>   DW_AT_decl_line   : 57
    <52a>   DW_AT_decl_column : 15
    <52b>   DW_AT_type        : <0x52f>
 <1><52f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <530>   DW_AT_byte_size   : 4
    <530>   DW_AT_type        : <0x534>
 <1><534>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <535>   DW_AT_prototyped  : 1
    <535>   DW_AT_type        : <0x2a>
    <539>   DW_AT_sibling     : <0x548>
 <2><53d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <53e>   DW_AT_type        : <0x548>
 <2><542>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <543>   DW_AT_type        : <0x548>
 <2><547>: Abbrev Number: 0
 <1><548>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <549>   DW_AT_byte_size   : 4
    <549>   DW_AT_type        : <0x54d>
 <1><54d>: Abbrev Number: 42 (DW_TAG_const_type)
 <1><54e>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <54f>   DW_AT_name        : (indirect string, offset: 0x34cf2): taskType_e
    <553>   DW_AT_encoding    : 7	(unsigned)
    <554>   DW_AT_byte_size   : 1
    <555>   DW_AT_type        : <0x59>
    <559>   DW_AT_decl_file   : 1
    <55a>   DW_AT_decl_line   : 29
    <55b>   DW_AT_decl_column : 14
    <55c>   DW_AT_sibling     : <0x56d>
 <2><560>: Abbrev Number: 12 (DW_TAG_enumerator)
    <561>   DW_AT_name        : (indirect string, offset: 0x47de6): taskTypePeriodic
    <565>   DW_AT_const_value : 0
 <2><566>: Abbrev Number: 12 (DW_TAG_enumerator)
    <567>   DW_AT_name        : (indirect string, offset: 0x624f): taskTypeSporadic
    <56b>   DW_AT_const_value : 1
 <2><56c>: Abbrev Number: 0
 <1><56d>: Abbrev Number: 5 (DW_TAG_typedef)
    <56e>   DW_AT_name        : (indirect string, offset: 0x34cf2): taskType_e
    <572>   DW_AT_decl_file   : 1
    <573>   DW_AT_decl_line   : 31
    <574>   DW_AT_decl_column : 3
    <575>   DW_AT_type        : <0x54e>
 <1><579>: Abbrev Number: 18 (DW_TAG_variable)
    <57a>   DW_AT_name        : (indirect string, offset: 0x5b241): vTasksListInit
    <57e>   DW_AT_decl_file   : 1
    <57e>   DW_AT_decl_line   : 44
    <57f>   DW_AT_decl_column : 19
    <580>   DW_AT_type        : <0x109>
    <584>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><58a>: Abbrev Number: 18 (DW_TAG_variable)
    <58b>   DW_AT_name        : (indirect string, offset: 0x705e2): xTasksList
    <58f>   DW_AT_decl_file   : 1
    <58f>   DW_AT_decl_line   : 45
    <590>   DW_AT_decl_column : 15
    <591>   DW_AT_type        : <0x23c>
    <595>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><59b>: Abbrev Number: 18 (DW_TAG_variable)
    <59c>   DW_AT_name        : (indirect string, offset: 0x65758): xListTasksNumber
    <5a0>   DW_AT_decl_file   : 1
    <5a0>   DW_AT_decl_line   : 46
    <5a1>   DW_AT_decl_column : 19
    <5a2>   DW_AT_type        : <0x109>
    <5a6>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><5ac>: Abbrev Number: 18 (DW_TAG_variable)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x192b5): SporadicServerHandle
    <5b1>   DW_AT_decl_file   : 1
    <5b1>   DW_AT_decl_line   : 74
    <5b2>   DW_AT_decl_column : 21
    <5b3>   DW_AT_type        : <0x248>
    <5b7>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><5bd>: Abbrev Number: 20 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x14ea3): MSTextendedTCB
    <5c2>   DW_AT_byte_size   : 124
    <5c3>   DW_AT_decl_file   : 1
    <5c4>   DW_AT_decl_line   : 88
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_sibling     : <0x72a>
 <2><5ca>: Abbrev Number: 2 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x3d907): pxTaskTCBListItem
    <5cf>   DW_AT_decl_file   : 1
    <5d0>   DW_AT_decl_line   : 91
    <5d1>   DW_AT_decl_column : 13
    <5d2>   DW_AT_type        : <0x1e5>
    <5d6>   DW_AT_data_member_location: 0
 <2><5d7>: Abbrev Number: 2 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x3b6cf): pvJobCode
    <5dc>   DW_AT_decl_file   : 1
    <5dd>   DW_AT_decl_line   : 93
    <5de>   DW_AT_decl_column : 17
    <5df>   DW_AT_type        : <0xda>
    <5e3>   DW_AT_data_member_location: 20
 <2><5e4>: Abbrev Number: 2 (DW_TAG_member)
    <5e5>   DW_AT_name        : (indirect string, offset: 0x4230d): pcName
    <5e9>   DW_AT_decl_file   : 1
    <5ea>   DW_AT_decl_line   : 94
    <5eb>   DW_AT_decl_column : 14
    <5ec>   DW_AT_type        : <0x14d>
    <5f0>   DW_AT_data_member_location: 24
 <2><5f1>: Abbrev Number: 2 (DW_TAG_member)
    <5f2>   DW_AT_name        : (indirect string, offset: 0x6b877): usStackDepth
    <5f6>   DW_AT_decl_file   : 1
    <5f7>   DW_AT_decl_line   : 95
    <5f8>   DW_AT_decl_column : 25
    <5f9>   DW_AT_type        : <0xa7>
    <5fd>   DW_AT_data_member_location: 28
 <2><5fe>: Abbrev Number: 2 (DW_TAG_member)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x6bbe): pvParameters
    <603>   DW_AT_decl_file   : 1
    <604>   DW_AT_decl_line   : 96
    <605>   DW_AT_decl_column : 8
    <606>   DW_AT_type        : <0xf6>
    <60a>   DW_AT_data_member_location: 32
 <2><60b>: Abbrev Number: 2 (DW_TAG_member)
    <60c>   DW_AT_name        : (indirect string, offset: 0x2b1f8): uxPriority
    <610>   DW_AT_decl_file   : 1
    <611>   DW_AT_decl_line   : 97
    <612>   DW_AT_decl_column : 14
    <613>   DW_AT_type        : <0x11a>
    <617>   DW_AT_data_member_location: 36
 <2><618>: Abbrev Number: 2 (DW_TAG_member)
    <619>   DW_AT_name        : (indirect string, offset: 0x4603a): pxCreatedTask
    <61d>   DW_AT_decl_file   : 1
    <61e>   DW_AT_decl_line   : 98
    <61f>   DW_AT_decl_column : 16
    <620>   DW_AT_type        : <0x72a>
    <624>   DW_AT_data_member_location: 40
 <2><625>: Abbrev Number: 2 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0x78c73): taskType
    <62a>   DW_AT_decl_file   : 1
    <62b>   DW_AT_decl_line   : 99
    <62c>   DW_AT_decl_column : 18
    <62d>   DW_AT_type        : <0x54e>
    <631>   DW_AT_data_member_location: 44
 <2><632>: Abbrev Number: 2 (DW_TAG_member)
    <633>   DW_AT_name        : (indirect string, offset: 0x5898d): xTaskPeriod
    <637>   DW_AT_decl_file   : 1
    <638>   DW_AT_decl_line   : 101
    <639>   DW_AT_decl_column : 13
    <63a>   DW_AT_type        : <0x130>
    <63e>   DW_AT_data_member_location: 48
 <2><63f>: Abbrev Number: 2 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x6daeb): xTaskDeadline
    <644>   DW_AT_decl_file   : 1
    <645>   DW_AT_decl_line   : 102
    <646>   DW_AT_decl_column : 13
    <647>   DW_AT_type        : <0x130>
    <64b>   DW_AT_data_member_location: 52
 <2><64c>: Abbrev Number: 2 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x3fa4d): xTaskPhase
    <651>   DW_AT_decl_file   : 1
    <652>   DW_AT_decl_line   : 103
    <653>   DW_AT_decl_column : 13
    <654>   DW_AT_type        : <0x130>
    <658>   DW_AT_data_member_location: 56
 <2><659>: Abbrev Number: 2 (DW_TAG_member)
    <65a>   DW_AT_name        : (indirect string, offset: 0x2749a): xTaskWCET
    <65e>   DW_AT_decl_file   : 1
    <65f>   DW_AT_decl_line   : 104
    <660>   DW_AT_decl_column : 13
    <661>   DW_AT_type        : <0x130>
    <665>   DW_AT_data_member_location: 60
 <2><666>: Abbrev Number: 2 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0x3ac88): xPrevReleaseTime
    <66b>   DW_AT_decl_file   : 1
    <66c>   DW_AT_decl_line   : 106
    <66d>   DW_AT_decl_column : 13
    <66e>   DW_AT_type        : <0x130>
    <672>   DW_AT_data_member_location: 64
 <2><673>: Abbrev Number: 2 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x4923d): xPrevExecTime
    <678>   DW_AT_decl_file   : 1
    <679>   DW_AT_decl_line   : 107
    <67a>   DW_AT_decl_column : 13
    <67b>   DW_AT_type        : <0x130>
    <67f>   DW_AT_data_member_location: 68
 <2><680>: Abbrev Number: 2 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x6563d): xPrevAbsDeadline
    <685>   DW_AT_decl_file   : 1
    <686>   DW_AT_decl_line   : 108
    <687>   DW_AT_decl_column : 13
    <688>   DW_AT_type        : <0x130>
    <68c>   DW_AT_data_member_location: 72
 <2><68d>: Abbrev Number: 2 (DW_TAG_member)
    <68e>   DW_AT_name        : (indirect string, offset: 0xfb): xPrevStartTime
    <692>   DW_AT_decl_file   : 1
    <693>   DW_AT_decl_line   : 109
    <694>   DW_AT_decl_column : 13
    <695>   DW_AT_type        : <0x130>
    <699>   DW_AT_data_member_location: 76
 <2><69a>: Abbrev Number: 2 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0x5e725): xPrevFinishTime
    <69f>   DW_AT_decl_file   : 1
    <6a0>   DW_AT_decl_line   : 110
    <6a1>   DW_AT_decl_column : 13
    <6a2>   DW_AT_type        : <0x130>
    <6a6>   DW_AT_data_member_location: 80
 <2><6a7>: Abbrev Number: 2 (DW_TAG_member)
    <6a8>   DW_AT_name        : (indirect string, offset: 0x15910): uNumOfMissedDeadlines
    <6ac>   DW_AT_decl_file   : 1
    <6ad>   DW_AT_decl_line   : 111
    <6ae>   DW_AT_decl_column : 14
    <6af>   DW_AT_type        : <0x11a>
    <6b3>   DW_AT_data_member_location: 84
 <2><6b4>: Abbrev Number: 2 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x776a9): xNextIdealReleaseTime
    <6b9>   DW_AT_decl_file   : 1
    <6ba>   DW_AT_decl_line   : 112
    <6bb>   DW_AT_decl_column : 13
    <6bc>   DW_AT_type        : <0x130>
    <6c0>   DW_AT_data_member_location: 88
 <2><6c1>: Abbrev Number: 2 (DW_TAG_member)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x503bb): xTaskInitDone
    <6c6>   DW_AT_decl_file   : 1
    <6c7>   DW_AT_decl_line   : 116
    <6c8>   DW_AT_decl_column : 13
    <6c9>   DW_AT_type        : <0x109>
    <6cd>   DW_AT_data_member_location: 92
 <2><6ce>: Abbrev Number: 2 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0x2de97): xTaskSpecificTimer
    <6d3>   DW_AT_decl_file   : 1
    <6d4>   DW_AT_decl_line   : 121
    <6d5>   DW_AT_decl_column : 16
    <6d6>   DW_AT_type        : <0x362>
    <6da>   DW_AT_data_member_location: 96
 <2><6db>: Abbrev Number: 2 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x83a6f): xUsFromIdealRelease
    <6e0>   DW_AT_decl_file   : 1
    <6e1>   DW_AT_decl_line   : 127
    <6e2>   DW_AT_decl_column : 10
    <6e3>   DW_AT_type        : <0xb8>
    <6e7>   DW_AT_data_member_location: 100
 <2><6e8>: Abbrev Number: 2 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x2e70e): xNumOfIterations
    <6ed>   DW_AT_decl_file   : 1
    <6ee>   DW_AT_decl_line   : 128
    <6ef>   DW_AT_decl_column : 11
    <6f0>   DW_AT_type        : <0xc4>
    <6f4>   DW_AT_data_member_location: 104
 <2><6f5>: Abbrev Number: 2 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x41315): xUsAverageReleaseGap
    <6fa>   DW_AT_decl_file   : 1
    <6fb>   DW_AT_decl_line   : 129
    <6fc>   DW_AT_decl_column : 10
    <6fd>   DW_AT_type        : <0xb8>
    <701>   DW_AT_data_member_location: 108
 <2><702>: Abbrev Number: 2 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x7e891): xTaskInterarrivalTime
    <707>   DW_AT_decl_file   : 1
    <708>   DW_AT_decl_line   : 134
    <709>   DW_AT_decl_column : 13
    <70a>   DW_AT_type        : <0x130>
    <70e>   DW_AT_data_member_location: 112
 <2><70f>: Abbrev Number: 2 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0x43bb0): xInterarrivalTimerRunning
    <714>   DW_AT_decl_file   : 1
    <715>   DW_AT_decl_line   : 135
    <716>   DW_AT_decl_column : 13
    <717>   DW_AT_type        : <0x109>
    <71b>   DW_AT_data_member_location: 116
 <2><71c>: Abbrev Number: 2 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x3d536): xJobCalled
    <721>   DW_AT_decl_file   : 1
    <722>   DW_AT_decl_line   : 136
    <723>   DW_AT_decl_column : 13
    <724>   DW_AT_type        : <0x109>
    <728>   DW_AT_data_member_location: 120
 <2><729>: Abbrev Number: 0
 <1><72a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <72b>   DW_AT_byte_size   : 4
    <72b>   DW_AT_type        : <0x248>
 <1><72f>: Abbrev Number: 8 (DW_TAG_const_type)
    <730>   DW_AT_type        : <0x72a>
 <1><734>: Abbrev Number: 5 (DW_TAG_typedef)
    <735>   DW_AT_name        : (indirect string, offset: 0x8c120): extTCB_t
    <739>   DW_AT_decl_file   : 1
    <73a>   DW_AT_decl_line   : 145
    <73b>   DW_AT_decl_column : 3
    <73c>   DW_AT_type        : <0x5bd>
 <1><740>: Abbrev Number: 44 (DW_TAG_variable)
    <741>   DW_AT_name        : (indirect string, offset: 0x79a2d): prvPeriodicTasksDensity
    <745>   DW_AT_decl_file   : 1
    <746>   DW_AT_decl_line   : 149
    <747>   DW_AT_decl_column : 7
    <748>   DW_AT_type        : <0x399>
    <74c>   DW_AT_external    : 1
    <74c>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><752>: Abbrev Number: 3 (DW_TAG_variable)
    <753>   DW_AT_name        : (indirect string, offset: 0x7afba): prvXMaxInterrarrivalTime
    <757>   DW_AT_decl_file   : 1
    <757>   DW_AT_decl_line   : 431
    <759>   DW_AT_decl_column : 19
    <75a>   DW_AT_type        : <0x130>
    <75e>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><764>: Abbrev Number: 15 (DW_TAG_subprogram)
    <765>   DW_AT_external    : 1
    <765>   DW_AT_name        : (indirect string, offset: 0x5ffa9): uxListRemove
    <769>   DW_AT_decl_file   : 7
    <76a>   DW_AT_decl_line   : 405
    <76c>   DW_AT_decl_column : 13
    <76d>   DW_AT_prototyped  : 1
    <76d>   DW_AT_type        : <0x11a>
    <771>   DW_AT_declaration : 1
    <771>   DW_AT_sibling     : <0x77b>
 <2><775>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <776>   DW_AT_type        : <0x237>
 <2><77a>: Abbrev Number: 0
 <1><77b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <77c>   DW_AT_external    : 1
    <77c>   DW_AT_name        : (indirect string, offset: 0x44932): xTaskGenericNotify
    <780>   DW_AT_decl_file   : 8
    <781>   DW_AT_decl_line   : 1853
    <783>   DW_AT_decl_column : 12
    <784>   DW_AT_prototyped  : 1
    <784>   DW_AT_type        : <0x109>
    <788>   DW_AT_declaration : 1
    <788>   DW_AT_sibling     : <0x7a1>
 <2><78c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <78d>   DW_AT_type        : <0x248>
 <2><791>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <792>   DW_AT_type        : <0xc4>
 <2><796>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <797>   DW_AT_type        : <0x2c2>
 <2><79b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79c>   DW_AT_type        : <0x7a1>
 <2><7a0>: Abbrev Number: 0
 <1><7a1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7a2>   DW_AT_byte_size   : 4
    <7a2>   DW_AT_type        : <0xc4>
 <1><7a6>: Abbrev Number: 8 (DW_TAG_const_type)
    <7a7>   DW_AT_type        : <0x7a1>
 <1><7ab>: Abbrev Number: 45 (DW_TAG_subprogram)
    <7ac>   DW_AT_external    : 1
    <7ac>   DW_AT_name        : (indirect string, offset: 0x728ec): vTaskStartScheduler
    <7b0>   DW_AT_decl_file   : 8
    <7b1>   DW_AT_decl_line   : 1180
    <7b3>   DW_AT_decl_column : 6
    <7b4>   DW_AT_prototyped  : 1
    <7b4>   DW_AT_declaration : 1
 <1><7b4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <7b5>   DW_AT_external    : 1
    <7b5>   DW_AT_name        : (indirect string, offset: 0x7ce05): vTaskPrioritySet
    <7b9>   DW_AT_decl_file   : 8
    <7ba>   DW_AT_decl_line   : 1018
    <7bc>   DW_AT_decl_column : 6
    <7bd>   DW_AT_prototyped  : 1
    <7bd>   DW_AT_declaration : 1
    <7bd>   DW_AT_sibling     : <0x7cc>
 <2><7c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7c2>   DW_AT_type        : <0x248>
 <2><7c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7c7>   DW_AT_type        : <0x11a>
 <2><7cb>: Abbrev Number: 0
 <1><7cc>: Abbrev Number: 46 (DW_TAG_subprogram)
    <7cd>   DW_AT_external    : 1
    <7cd>   DW_AT_name        : (indirect string, offset: 0xd13b): qsort
    <7d1>   DW_AT_decl_file   : 11
    <7d2>   DW_AT_decl_line   : 143
    <7d3>   DW_AT_decl_column : 6
    <7d4>   DW_AT_prototyped  : 1
    <7d4>   DW_AT_declaration : 1
    <7d4>   DW_AT_sibling     : <0x7ed>
 <2><7d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7d9>   DW_AT_type        : <0xf6>
 <2><7dd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7de>   DW_AT_type        : <0x31>
 <2><7e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e3>   DW_AT_type        : <0x31>
 <2><7e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x523>
 <2><7ec>: Abbrev Number: 0
 <1><7ed>: Abbrev Number: 15 (DW_TAG_subprogram)
    <7ee>   DW_AT_external    : 1
    <7ee>   DW_AT_name        : (indirect string, offset: 0x373d8): xTaskNotifyWait
    <7f2>   DW_AT_decl_file   : 8
    <7f3>   DW_AT_decl_line   : 2021
    <7f5>   DW_AT_decl_column : 12
    <7f6>   DW_AT_prototyped  : 1
    <7f6>   DW_AT_type        : <0x109>
    <7fa>   DW_AT_declaration : 1
    <7fa>   DW_AT_sibling     : <0x813>
 <2><7fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ff>   DW_AT_type        : <0xc4>
 <2><803>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <804>   DW_AT_type        : <0xc4>
 <2><808>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <809>   DW_AT_type        : <0x7a1>
 <2><80d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <80e>   DW_AT_type        : <0x130>
 <2><812>: Abbrev Number: 0
 <1><813>: Abbrev Number: 15 (DW_TAG_subprogram)
    <814>   DW_AT_external    : 1
    <814>   DW_AT_name        : (indirect string, offset: 0x316a5): uxTaskGetSystemState
    <818>   DW_AT_decl_file   : 8
    <819>   DW_AT_decl_line   : 1641
    <81b>   DW_AT_decl_column : 13
    <81c>   DW_AT_prototyped  : 1
    <81c>   DW_AT_type        : <0x11a>
    <820>   DW_AT_declaration : 1
    <820>   DW_AT_sibling     : <0x834>
 <2><824>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <825>   DW_AT_type        : <0x839>
 <2><829>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <82a>   DW_AT_type        : <0x12b>
 <2><82e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <82f>   DW_AT_type        : <0x7a6>
 <2><833>: Abbrev Number: 0
 <1><834>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <835>   DW_AT_byte_size   : 4
    <835>   DW_AT_type        : <0x356>
 <1><839>: Abbrev Number: 8 (DW_TAG_const_type)
    <83a>   DW_AT_type        : <0x834>
 <1><83e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <83f>   DW_AT_external    : 1
    <83f>   DW_AT_name        : (indirect string, offset: 0x2825a): pvTimerGetTimerID
    <843>   DW_AT_decl_file   : 9
    <844>   DW_AT_decl_line   : 386
    <846>   DW_AT_decl_column : 7
    <847>   DW_AT_prototyped  : 1
    <847>   DW_AT_type        : <0xf6>
    <84b>   DW_AT_declaration : 1
    <84b>   DW_AT_sibling     : <0x855>
 <2><84f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <850>   DW_AT_type        : <0x36e>
 <2><854>: Abbrev Number: 0
 <1><855>: Abbrev Number: 15 (DW_TAG_subprogram)
    <856>   DW_AT_external    : 1
    <856>   DW_AT_name        : (indirect string, offset: 0x68056): pvTaskGetThreadLocalStoragePointer
    <85a>   DW_AT_decl_file   : 8
    <85b>   DW_AT_decl_line   : 1518
    <85d>   DW_AT_decl_column : 8
    <85e>   DW_AT_prototyped  : 1
    <85e>   DW_AT_type        : <0xf6>
    <862>   DW_AT_declaration : 1
    <862>   DW_AT_sibling     : <0x871>
 <2><866>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <867>   DW_AT_type        : <0x248>
 <2><86b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86c>   DW_AT_type        : <0x109>
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 31 (DW_TAG_subprogram)
    <872>   DW_AT_external    : 1
    <872>   DW_AT_name        : (indirect string, offset: 0x66106): xTaskGetCurrentTaskHandle
    <876>   DW_AT_decl_file   : 8
    <876>   DW_AT_decl_line   : 2438
    <878>   DW_AT_decl_column : 14
    <879>   DW_AT_prototyped  : 1
    <879>   DW_AT_type        : <0x248>
    <87d>   DW_AT_declaration : 1
 <1><87d>: Abbrev Number: 15 (DW_TAG_subprogram)
    <87e>   DW_AT_external    : 1
    <87e>   DW_AT_name        : (indirect string, offset: 0x8cc7d): ulTaskNotifyTake
    <882>   DW_AT_decl_file   : 8
    <883>   DW_AT_decl_line   : 2191
    <885>   DW_AT_decl_column : 10
    <886>   DW_AT_prototyped  : 1
    <886>   DW_AT_type        : <0xc4>
    <88a>   DW_AT_declaration : 1
    <88a>   DW_AT_sibling     : <0x899>
 <2><88e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <88f>   DW_AT_type        : <0x109>
 <2><893>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <894>   DW_AT_type        : <0x130>
 <2><898>: Abbrev Number: 0
 <1><899>: Abbrev Number: 32 (DW_TAG_subprogram)
    <89a>   DW_AT_external    : 1
    <89a>   DW_AT_name        : (indirect string, offset: 0x8f69b): pvPortMalloc
    <89e>   DW_AT_decl_file   : 12
    <89f>   DW_AT_decl_line   : 163
    <8a0>   DW_AT_decl_column : 7
    <8a1>   DW_AT_prototyped  : 1
    <8a1>   DW_AT_type        : <0xf6>
    <8a5>   DW_AT_declaration : 1
    <8a5>   DW_AT_sibling     : <0x8af>
 <2><8a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8aa>   DW_AT_type        : <0x31>
 <2><8ae>: Abbrev Number: 0
 <1><8af>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8b0>   DW_AT_external    : 1
    <8b0>   DW_AT_name        : (indirect string, offset: 0x54df4): vListInsertEnd
    <8b4>   DW_AT_decl_file   : 7
    <8b5>   DW_AT_decl_line   : 390
    <8b7>   DW_AT_decl_column : 6
    <8b8>   DW_AT_prototyped  : 1
    <8b8>   DW_AT_declaration : 1
    <8b8>   DW_AT_sibling     : <0x8c7>
 <2><8bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8bd>   DW_AT_type        : <0x8cc>
 <2><8c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8c2>   DW_AT_type        : <0x237>
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8c8>   DW_AT_byte_size   : 4
    <8c8>   DW_AT_type        : <0x23c>
 <1><8cc>: Abbrev Number: 8 (DW_TAG_const_type)
    <8cd>   DW_AT_type        : <0x8c7>
 <1><8d1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8d2>   DW_AT_external    : 1
    <8d2>   DW_AT_name        : (indirect string, offset: 0x5133b): vListInitialiseItem
    <8d6>   DW_AT_decl_file   : 7
    <8d7>   DW_AT_decl_line   : 356
    <8d9>   DW_AT_decl_column : 6
    <8da>   DW_AT_prototyped  : 1
    <8da>   DW_AT_declaration : 1
    <8da>   DW_AT_sibling     : <0x8e4>
 <2><8de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8df>   DW_AT_type        : <0x237>
 <2><8e3>: Abbrev Number: 0
 <1><8e4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8e5>   DW_AT_external    : 1
    <8e5>   DW_AT_name        : (indirect string, offset: 0x53b1d): vListInitialise
    <8e9>   DW_AT_decl_file   : 7
    <8ea>   DW_AT_decl_line   : 345
    <8ec>   DW_AT_decl_column : 6
    <8ed>   DW_AT_prototyped  : 1
    <8ed>   DW_AT_declaration : 1
    <8ed>   DW_AT_sibling     : <0x8f7>
 <2><8f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8f2>   DW_AT_type        : <0x8cc>
 <2><8f6>: Abbrev Number: 0
 <1><8f7>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8f8>   DW_AT_external    : 1
    <8f8>   DW_AT_name        : (indirect string, offset: 0x5b539): vTaskSetThreadLocalStoragePointer
    <8fc>   DW_AT_decl_file   : 8
    <8fd>   DW_AT_decl_line   : 1517
    <8ff>   DW_AT_decl_column : 7
    <900>   DW_AT_prototyped  : 1
    <900>   DW_AT_declaration : 1
    <900>   DW_AT_sibling     : <0x914>
 <2><904>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <905>   DW_AT_type        : <0x248>
 <2><909>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <90a>   DW_AT_type        : <0x109>
 <2><90e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <90f>   DW_AT_type        : <0xf6>
 <2><913>: Abbrev Number: 0
 <1><914>: Abbrev Number: 15 (DW_TAG_subprogram)
    <915>   DW_AT_external    : 1
    <915>   DW_AT_name        : (indirect string, offset: 0x7f238): xTimerGenericCommand
    <919>   DW_AT_decl_file   : 9
    <91a>   DW_AT_decl_line   : 1296
    <91c>   DW_AT_decl_column : 12
    <91d>   DW_AT_prototyped  : 1
    <91d>   DW_AT_type        : <0x109>
    <921>   DW_AT_declaration : 1
    <921>   DW_AT_sibling     : <0x93f>
 <2><925>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <926>   DW_AT_type        : <0x362>
 <2><92a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92b>   DW_AT_type        : <0x115>
 <2><92f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <930>   DW_AT_type        : <0x13c>
 <2><934>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <935>   DW_AT_type        : <0x944>
 <2><939>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <93a>   DW_AT_type        : <0x13c>
 <2><93e>: Abbrev Number: 0
 <1><93f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <940>   DW_AT_byte_size   : 4
    <940>   DW_AT_type        : <0x109>
 <1><944>: Abbrev Number: 8 (DW_TAG_const_type)
    <945>   DW_AT_type        : <0x93f>
 <1><949>: Abbrev Number: 31 (DW_TAG_subprogram)
    <94a>   DW_AT_external    : 1
    <94a>   DW_AT_name        : (indirect string, offset: 0x472e): xTaskGetTickCount
    <94e>   DW_AT_decl_file   : 8
    <94e>   DW_AT_decl_line   : 1356
    <950>   DW_AT_decl_column : 12
    <951>   DW_AT_prototyped  : 1
    <951>   DW_AT_type        : <0x130>
    <955>   DW_AT_declaration : 1
 <1><955>: Abbrev Number: 32 (DW_TAG_subprogram)
    <956>   DW_AT_external    : 1
    <956>   DW_AT_name        : (indirect string, offset: 0x8a46c): xTimerCreate
    <95a>   DW_AT_decl_file   : 9
    <95b>   DW_AT_decl_line   : 228
    <95c>   DW_AT_decl_column : 16
    <95d>   DW_AT_prototyped  : 1
    <95d>   DW_AT_type        : <0x362>
    <961>   DW_AT_declaration : 1
    <961>   DW_AT_sibling     : <0x97f>
 <2><965>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <966>   DW_AT_type        : <0x152>
 <2><96a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <96b>   DW_AT_type        : <0x13c>
 <2><96f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <970>   DW_AT_type        : <0x12b>
 <2><974>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <975>   DW_AT_type        : <0xf8>
 <2><979>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97a>   DW_AT_type        : <0x37d>
 <2><97e>: Abbrev Number: 0
 <1><97f>: Abbrev Number: 33 (DW_TAG_subprogram)
    <980>   DW_AT_external    : 1
    <980>   DW_AT_name        : (indirect string, offset: 0x54a19): vPortExitCritical
    <984>   DW_AT_decl_file   : 2
    <984>   DW_AT_decl_line   : 98
    <985>   DW_AT_decl_column : 13
    <985>   DW_AT_prototyped  : 1
    <985>   DW_AT_declaration : 1
 <1><985>: Abbrev Number: 33 (DW_TAG_subprogram)
    <986>   DW_AT_external    : 1
    <986>   DW_AT_name        : (indirect string, offset: 0x8880f): vPortEnterCritical
    <98a>   DW_AT_decl_file   : 2
    <98a>   DW_AT_decl_line   : 97
    <98b>   DW_AT_decl_column : 13
    <98b>   DW_AT_prototyped  : 1
    <98b>   DW_AT_declaration : 1
 <1><98b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <98c>   DW_AT_external    : 1
    <98c>   DW_AT_name        : (indirect string, offset: 0x6bf81): xTaskCreate
    <990>   DW_AT_decl_file   : 8
    <991>   DW_AT_decl_line   : 330
    <993>   DW_AT_decl_column : 13
    <994>   DW_AT_prototyped  : 1
    <994>   DW_AT_type        : <0x109>
    <998>   DW_AT_declaration : 1
    <998>   DW_AT_sibling     : <0x9bb>
 <2><99c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <99d>   DW_AT_type        : <0xda>
 <2><9a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_type        : <0x152>
 <2><9a6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9a7>   DW_AT_type        : <0xb3>
 <2><9ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ac>   DW_AT_type        : <0xf8>
 <2><9b0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9b1>   DW_AT_type        : <0x11a>
 <2><9b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9b6>   DW_AT_type        : <0x72f>
 <2><9ba>: Abbrev Number: 0
 <1><9bb>: Abbrev Number: 22 (DW_TAG_subprogram)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x5b3bc): prvMSTDispatch
    <9c0>   DW_AT_decl_file   : 1
    <9c0>   DW_AT_decl_line   : 1148
    <9c2>   DW_AT_decl_column : 13
    <9c2>   DW_AT_prototyped  : 1
    <9c2>   DW_AT_low_pc      : 0x800135c
    <9c6>   DW_AT_high_pc     : 0x16c
    <9ca>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9cc>   DW_AT_call_all_tail_calls: 1
    <9cc>   DW_AT_sibling     : <0xac8>
 <2><9d0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9d1>   DW_AT_name        : (indirect string, offset: 0x312fe): forTask
    <9d5>   DW_AT_decl_file   : 1
    <9d5>   DW_AT_decl_line   : 1148
    <9d7>   DW_AT_decl_column : 42
    <9d8>   DW_AT_type        : <0x72a>
    <9dc>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><9df>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x20a45): xAsCallee
    <9e4>   DW_AT_decl_file   : 1
    <9e4>   DW_AT_decl_line   : 1148
    <9e6>   DW_AT_decl_column : 62
    <9e7>   DW_AT_type        : <0x109>
    <9eb>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><9ee>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x8d29d): xOfTaskType
    <9f3>   DW_AT_decl_file   : 1
    <9f3>   DW_AT_decl_line   : 1149
    <9f5>   DW_AT_decl_column : 14
    <9f6>   DW_AT_type        : <0x56d>
    <9fa>   DW_AT_location    : 2 byte block: 91 4f 	(DW_OP_fbreg: -49)
 <2><9fd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x8a07d): xFromUserRequest
    <a02>   DW_AT_decl_file   : 1
    <a02>   DW_AT_decl_line   : 1149
    <a04>   DW_AT_decl_column : 38
    <a05>   DW_AT_type        : <0x109>
    <a09>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><a0c>: Abbrev Number: 47 (DW_TAG_lexical_block)
    <a0d>   DW_AT_ranges      : 0xc
    <a11>   DW_AT_sibling     : <0xa5b>
 <3><a15>: Abbrev Number: 3 (DW_TAG_variable)
    <a16>   DW_AT_name        : (indirect string, offset: 0x14076): xCurrExtTCB
    <a1a>   DW_AT_decl_file   : 1
    <a1a>   DW_AT_decl_line   : 1155
    <a1c>   DW_AT_decl_column : 13
    <a1d>   DW_AT_type        : <0xac8>
    <a21>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><a24>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <a25>   DW_AT_abstract_origin: <0x1386>
    <a29>   DW_AT_low_pc      : 0x80013b4
    <a2d>   DW_AT_high_pc     : 0x14
    <a31>   DW_AT_call_file   : 1
    <a31>   DW_AT_call_line   : 1174
    <a33>   DW_AT_call_column : 7
    <a34>   DW_AT_sibling     : <0xa41>
 <4><a38>: Abbrev Number: 10 (DW_TAG_variable)
    <a39>   DW_AT_abstract_origin: <0x138f>
    <a3d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><a40>: Abbrev Number: 0
 <3><a41>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <a42>   DW_AT_abstract_origin: <0x1386>
    <a46>   DW_AT_low_pc      : 0x8001412
    <a4a>   DW_AT_high_pc     : 0x14
    <a4e>   DW_AT_call_file   : 1
    <a4e>   DW_AT_call_line   : 1204
    <a50>   DW_AT_call_column : 4
 <4><a51>: Abbrev Number: 10 (DW_TAG_variable)
    <a52>   DW_AT_abstract_origin: <0x138f>
    <a56>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><a59>: Abbrev Number: 0
 <3><a5a>: Abbrev Number: 0
 <2><a5b>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <a5c>   DW_AT_low_pc      : 0x800142a
    <a60>   DW_AT_high_pc     : 0x8e
 <3><a64>: Abbrev Number: 3 (DW_TAG_variable)
    <a65>   DW_AT_name        : (indirect string, offset: 0x14076): xCurrExtTCB
    <a69>   DW_AT_decl_file   : 1
    <a69>   DW_AT_decl_line   : 1213
    <a6b>   DW_AT_decl_column : 15
    <a6c>   DW_AT_type        : <0xac8>
    <a70>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a73>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <a74>   DW_AT_abstract_origin: <0x1386>
    <a78>   DW_AT_low_pc      : 0x800143e
    <a7c>   DW_AT_high_pc     : 0x14
    <a80>   DW_AT_call_file   : 1
    <a80>   DW_AT_call_line   : 1216
    <a82>   DW_AT_call_column : 5
    <a83>   DW_AT_sibling     : <0xa90>
 <4><a87>: Abbrev Number: 10 (DW_TAG_variable)
    <a88>   DW_AT_abstract_origin: <0x138f>
    <a8c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><a8f>: Abbrev Number: 0
 <3><a90>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <a91>   DW_AT_abstract_origin: <0x1386>
    <a95>   DW_AT_low_pc      : 0x8001482
    <a99>   DW_AT_high_pc     : 0x14
    <a9d>   DW_AT_call_file   : 1
    <a9d>   DW_AT_call_line   : 1224
    <a9f>   DW_AT_call_column : 13
    <aa0>   DW_AT_sibling     : <0xaad>
 <4><aa4>: Abbrev Number: 10 (DW_TAG_variable)
    <aa5>   DW_AT_abstract_origin: <0x138f>
    <aa9>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><aac>: Abbrev Number: 0
 <3><aad>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <aae>   DW_AT_abstract_origin: <0x1386>
    <ab2>   DW_AT_low_pc      : 0x800149a
    <ab6>   DW_AT_high_pc     : 0x14
    <aba>   DW_AT_call_file   : 1
    <aba>   DW_AT_call_line   : 1227
    <abc>   DW_AT_call_column : 9
 <4><abd>: Abbrev Number: 10 (DW_TAG_variable)
    <abe>   DW_AT_abstract_origin: <0x138f>
    <ac2>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <4><ac5>: Abbrev Number: 0
 <3><ac6>: Abbrev Number: 0
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ac9>   DW_AT_byte_size   : 4
    <ac9>   DW_AT_type        : <0x734>
 <1><acd>: Abbrev Number: 34 (DW_TAG_subprogram)
    <ace>   DW_AT_name        : (indirect string, offset: 0x38653): prvAsmissionControlEDF
    <ad2>   DW_AT_decl_file   : 1
    <ad2>   DW_AT_decl_line   : 1054
    <ad4>   DW_AT_decl_column : 19
    <ad4>   DW_AT_prototyped  : 1
    <ad4>   DW_AT_type        : <0x109>
    <ad8>   DW_AT_low_pc      : 0x8000df4
    <adc>   DW_AT_high_pc     : 0x568
    <ae0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae2>   DW_AT_call_all_tail_calls: 1
    <ae2>   DW_AT_sibling     : <0xd60>
 <2><ae6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x4226b): forTCB
    <aeb>   DW_AT_decl_file   : 1
    <aeb>   DW_AT_decl_line   : 1054
    <aed>   DW_AT_decl_column : 52
    <aee>   DW_AT_type        : <0xac8>
    <af2>   DW_AT_location    : 3 byte block: 91 cc 7e 	(DW_OP_fbreg: -180)
 <2><af6>: Abbrev Number: 9 (DW_TAG_variable)
    <af7>   DW_AT_name        : now
    <afb>   DW_AT_decl_file   : 1
    <afb>   DW_AT_decl_line   : 1056
    <afd>   DW_AT_decl_column : 16
    <afe>   DW_AT_type        : <0x130>
    <b02>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><b06>: Abbrev Number: 3 (DW_TAG_variable)
    <b07>   DW_AT_name        : (indirect string, offset: 0x7061c): D_new
    <b0b>   DW_AT_decl_file   : 1
    <b0b>   DW_AT_decl_line   : 1057
    <b0d>   DW_AT_decl_column : 16
    <b0e>   DW_AT_type        : <0x130>
    <b12>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><b16>: Abbrev Number: 3 (DW_TAG_variable)
    <b17>   DW_AT_name        : (indirect string, offset: 0x38d68): C_new
    <b1b>   DW_AT_decl_file   : 1
    <b1b>   DW_AT_decl_line   : 1058
    <b1d>   DW_AT_decl_column : 16
    <b1e>   DW_AT_type        : <0x130>
    <b22>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><b26>: Abbrev Number: 3 (DW_TAG_variable)
    <b27>   DW_AT_name        : (indirect string, offset: 0x70619): absD_new
    <b2b>   DW_AT_decl_file   : 1
    <b2b>   DW_AT_decl_line   : 1059
    <b2d>   DW_AT_decl_column : 16
    <b2e>   DW_AT_type        : <0x130>
    <b32>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><b36>: Abbrev Number: 3 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0x770d9): cutpoints
    <b3b>   DW_AT_decl_file   : 1
    <b3b>   DW_AT_decl_line   : 1062
    <b3d>   DW_AT_decl_column : 16
    <b3e>   DW_AT_type        : <0xd60>
    <b42>   DW_AT_location    : 4 byte block: 91 94 7f 6 	(DW_OP_fbreg: -108; DW_OP_deref)
 <2><b47>: Abbrev Number: 3 (DW_TAG_variable)
    <b48>   DW_AT_name        : (indirect string, offset: 0x8c6c): ncuts
    <b4c>   DW_AT_decl_file   : 1
    <b4c>   DW_AT_decl_line   : 1063
    <b4e>   DW_AT_decl_column : 16
    <b4f>   DW_AT_type        : <0x109>
    <b53>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><b56>: Abbrev Number: 9 (DW_TAG_variable)
    <b57>   DW_AT_name        : it
    <b5a>   DW_AT_decl_file   : 1
    <b5a>   DW_AT_decl_line   : 1065
    <b5c>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0x232>
    <b61>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><b64>: Abbrev Number: 3 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0x9727): starts
    <b69>   DW_AT_decl_file   : 1
    <b69>   DW_AT_decl_line   : 1082
    <b6b>   DW_AT_decl_column : 16
    <b6c>   DW_AT_type        : <0xd74>
    <b70>   DW_AT_location    : 4 byte block: 91 8c 7f 6 	(DW_OP_fbreg: -116; DW_OP_deref)
 <2><b75>: Abbrev Number: 3 (DW_TAG_variable)
    <b76>   DW_AT_name        : (indirect string, offset: 0x4295e): lens
    <b7a>   DW_AT_decl_file   : 1
    <b7a>   DW_AT_decl_line   : 1083
    <b7c>   DW_AT_decl_column : 16
    <b7d>   DW_AT_type        : <0xd88>
    <b81>   DW_AT_location    : 4 byte block: 91 84 7f 6 	(DW_OP_fbreg: -124; DW_OP_deref)
 <2><b86>: Abbrev Number: 3 (DW_TAG_variable)
    <b87>   DW_AT_name        : (indirect string, offset: 0x35e92): nint
    <b8b>   DW_AT_decl_file   : 1
    <b8b>   DW_AT_decl_line   : 1084
    <b8d>   DW_AT_decl_column : 16
    <b8e>   DW_AT_type        : <0x109>
    <b92>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><b95>: Abbrev Number: 3 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x8ba8d): prev
    <b9a>   DW_AT_decl_file   : 1
    <b9a>   DW_AT_decl_line   : 1086
    <b9c>   DW_AT_decl_column : 16
    <b9d>   DW_AT_type        : <0x130>
    <ba1>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><ba4>: Abbrev Number: 3 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x772): dens
    <ba9>   DW_AT_decl_file   : 1
    <ba9>   DW_AT_decl_line   : 1102
    <bab>   DW_AT_decl_column : 11
    <bac>   DW_AT_type        : <0xd9c>
    <bb0>   DW_AT_location    : 4 byte block: 91 fc 7e 6 	(DW_OP_fbreg: -132; DW_OP_deref)
 <2><bb5>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <bb6>   DW_AT_low_pc      : 0x8000ea8
    <bba>   DW_AT_high_pc     : 0xe4
    <bbe>   DW_AT_sibling     : <0xc3f>
 <3><bc2>: Abbrev Number: 9 (DW_TAG_variable)
    <bc3>   DW_AT_name        : i
    <bc5>   DW_AT_decl_file   : 1
    <bc5>   DW_AT_decl_line   : 1066
    <bc7>   DW_AT_decl_column : 21
    <bc8>   DW_AT_type        : <0x109>
    <bcc>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><bcf>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <bd0>   DW_AT_low_pc      : 0x8000eb0
    <bd4>   DW_AT_high_pc     : 0xc6
 <4><bd8>: Abbrev Number: 9 (DW_TAG_variable)
    <bd9>   DW_AT_name        : tcb
    <bdd>   DW_AT_decl_file   : 1
    <bdd>   DW_AT_decl_line   : 1067
    <bdf>   DW_AT_decl_column : 19
    <be0>   DW_AT_type        : <0xac8>
    <be4>   DW_AT_location    : 3 byte block: 91 e4 7e 	(DW_OP_fbreg: -156)
 <4><be8>: Abbrev Number: 3 (DW_TAG_variable)
    <be9>   DW_AT_name        : (indirect string, offset: 0x342af): absD_i
    <bed>   DW_AT_decl_file   : 1
    <bed>   DW_AT_decl_line   : 1070
    <bef>   DW_AT_decl_column : 20
    <bf0>   DW_AT_type        : <0x130>
    <bf4>   DW_AT_location    : 3 byte block: 91 e0 7e 	(DW_OP_fbreg: -160)
 <4><bf8>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <bf9>   DW_AT_low_pc      : 0x8000eee
    <bfd>   DW_AT_high_pc     : 0x7e
    <c01>   DW_AT_sibling     : <0xc23>
 <5><c05>: Abbrev Number: 9 (DW_TAG_variable)
    <c06>   DW_AT_name        : rel
    <c0a>   DW_AT_decl_file   : 1
    <c0a>   DW_AT_decl_line   : 1072
    <c0c>   DW_AT_decl_column : 24
    <c0d>   DW_AT_type        : <0x130>
    <c11>   DW_AT_location    : 3 byte block: 91 dc 7e 	(DW_OP_fbreg: -164)
 <5><c15>: Abbrev Number: 9 (DW_TAG_variable)
    <c16>   DW_AT_name        : j
    <c18>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 1074
    <c1a>   DW_AT_decl_column : 24
    <c1b>   DW_AT_type        : <0x109>
    <c1f>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <5><c22>: Abbrev Number: 0
 <4><c23>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <c24>   DW_AT_abstract_origin: <0x1386>
    <c28>   DW_AT_low_pc      : 0x8000ebe
    <c2c>   DW_AT_high_pc     : 0x14
    <c30>   DW_AT_call_file   : 1
    <c30>   DW_AT_call_line   : 1068
    <c32>   DW_AT_call_column : 9
 <5><c33>: Abbrev Number: 10 (DW_TAG_variable)
    <c34>   DW_AT_abstract_origin: <0x138f>
    <c38>   DW_AT_location    : 3 byte block: 91 d8 7e 	(DW_OP_fbreg: -168)
 <5><c3c>: Abbrev Number: 0
 <4><c3d>: Abbrev Number: 0
 <3><c3e>: Abbrev Number: 0
 <2><c3f>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <c40>   DW_AT_low_pc      : 0x800105e
    <c44>   DW_AT_high_pc     : 0x7e
    <c48>   DW_AT_sibling     : <0xc5b>
 <3><c4c>: Abbrev Number: 9 (DW_TAG_variable)
    <c4d>   DW_AT_name        : i
    <c4f>   DW_AT_decl_file   : 1
    <c4f>   DW_AT_decl_line   : 1087
    <c51>   DW_AT_decl_column : 21
    <c52>   DW_AT_type        : <0x109>
    <c56>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <3><c5a>: Abbrev Number: 0
 <2><c5b>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <c5c>   DW_AT_low_pc      : 0x800117a
    <c60>   DW_AT_high_pc     : 0x2e
    <c64>   DW_AT_sibling     : <0xc77>
 <3><c68>: Abbrev Number: 9 (DW_TAG_variable)
    <c69>   DW_AT_name        : k
    <c6b>   DW_AT_decl_file   : 1
    <c6b>   DW_AT_decl_line   : 1103
    <c6d>   DW_AT_decl_column : 21
    <c6e>   DW_AT_type        : <0x109>
    <c72>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><c76>: Abbrev Number: 0
 <2><c77>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <c78>   DW_AT_low_pc      : 0x80011b0
    <c7c>   DW_AT_high_pc     : 0x11c
    <c80>   DW_AT_sibling     : <0xd2d>
 <3><c84>: Abbrev Number: 9 (DW_TAG_variable)
    <c85>   DW_AT_name        : i
    <c87>   DW_AT_decl_file   : 1
    <c87>   DW_AT_decl_line   : 1106
    <c89>   DW_AT_decl_column : 21
    <c8a>   DW_AT_type        : <0x109>
    <c8e>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <3><c92>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <c93>   DW_AT_low_pc      : 0x80011b8
    <c97>   DW_AT_high_pc     : 0xfc
 <4><c9b>: Abbrev Number: 9 (DW_TAG_variable)
    <c9c>   DW_AT_name        : tcb
    <ca0>   DW_AT_decl_file   : 1
    <ca0>   DW_AT_decl_line   : 1107
    <ca2>   DW_AT_decl_column : 19
    <ca3>   DW_AT_type        : <0xac8>
    <ca7>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <4><cab>: Abbrev Number: 9 (DW_TAG_variable)
    <cac>   DW_AT_name        : C_i
    <cb0>   DW_AT_decl_file   : 1
    <cb0>   DW_AT_decl_line   : 1110
    <cb2>   DW_AT_decl_column : 20
    <cb3>   DW_AT_type        : <0x130>
    <cb7>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <4><cbb>: Abbrev Number: 3 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x342af): absD_i
    <cc0>   DW_AT_decl_file   : 1
    <cc0>   DW_AT_decl_line   : 1111
    <cc2>   DW_AT_decl_column : 20
    <cc3>   DW_AT_type        : <0x130>
    <cc7>   DW_AT_location    : 3 byte block: 91 ec 7e 	(DW_OP_fbreg: -148)
 <4><ccb>: Abbrev Number: 9 (DW_TAG_variable)
    <ccc>   DW_AT_name        : rel
    <cd0>   DW_AT_decl_file   : 1
    <cd0>   DW_AT_decl_line   : 1112
    <cd2>   DW_AT_decl_column : 20
    <cd3>   DW_AT_type        : <0x130>
    <cd7>   DW_AT_location    : 3 byte block: 91 e8 7e 	(DW_OP_fbreg: -152)
 <4><cdb>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <cdc>   DW_AT_low_pc      : 0x8001212
    <ce0>   DW_AT_high_pc     : 0x98
    <ce4>   DW_AT_sibling     : <0xd11>
 <5><ce8>: Abbrev Number: 9 (DW_TAG_variable)
    <ce9>   DW_AT_name        : k
    <ceb>   DW_AT_decl_file   : 1
    <ceb>   DW_AT_decl_line   : 1114
    <ced>   DW_AT_decl_column : 25
    <cee>   DW_AT_type        : <0x109>
    <cf2>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <5><cf6>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <cf7>   DW_AT_abstract_origin: <0x1386>
    <cfb>   DW_AT_low_pc      : 0x8001238
    <cff>   DW_AT_high_pc     : 0x14
    <d03>   DW_AT_call_file   : 1
    <d03>   DW_AT_call_line   : 1116
    <d05>   DW_AT_call_column : 17
 <6><d06>: Abbrev Number: 10 (DW_TAG_variable)
    <d07>   DW_AT_abstract_origin: <0x138f>
    <d0b>   DW_AT_location    : 3 byte block: 91 d0 7e 	(DW_OP_fbreg: -176)
 <6><d0f>: Abbrev Number: 0
 <5><d10>: Abbrev Number: 0
 <4><d11>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <d12>   DW_AT_abstract_origin: <0x1386>
    <d16>   DW_AT_low_pc      : 0x80011c6
    <d1a>   DW_AT_high_pc     : 0x14
    <d1e>   DW_AT_call_file   : 1
    <d1e>   DW_AT_call_line   : 1108
    <d20>   DW_AT_call_column : 9
 <5><d21>: Abbrev Number: 10 (DW_TAG_variable)
    <d22>   DW_AT_abstract_origin: <0x138f>
    <d26>   DW_AT_location    : 3 byte block: 91 d4 7e 	(DW_OP_fbreg: -172)
 <5><d2a>: Abbrev Number: 0
 <4><d2b>: Abbrev Number: 0
 <3><d2c>: Abbrev Number: 0
 <2><d2d>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <d2e>   DW_AT_low_pc      : 0x80012cc
    <d32>   DW_AT_high_pc     : 0x70
 <3><d36>: Abbrev Number: 9 (DW_TAG_variable)
    <d37>   DW_AT_name        : k
    <d39>   DW_AT_decl_file   : 1
    <d39>   DW_AT_decl_line   : 1126
    <d3b>   DW_AT_decl_column : 21
    <d3c>   DW_AT_type        : <0x109>
    <d40>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><d44>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <d45>   DW_AT_low_pc      : 0x80012d4
    <d49>   DW_AT_high_pc     : 0x52
 <4><d4d>: Abbrev Number: 3 (DW_TAG_variable)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x38b60): checkVal
    <d52>   DW_AT_decl_file   : 1
    <d52>   DW_AT_decl_line   : 1127
    <d54>   DW_AT_decl_column : 15
    <d55>   DW_AT_type        : <0x399>
    <d59>   DW_AT_location    : 3 byte block: 91 f8 7e 	(DW_OP_fbreg: -136)
 <4><d5d>: Abbrev Number: 0
 <3><d5e>: Abbrev Number: 0
 <2><d5f>: Abbrev Number: 0
 <1><d60>: Abbrev Number: 19 (DW_TAG_array_type)
    <d61>   DW_AT_type        : <0x130>
    <d65>   DW_AT_sibling     : <0xd74>
 <2><d69>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <d6a>   DW_AT_type        : <0x3d>
    <d6e>   DW_AT_upper_bound : 4 byte block: 91 98 7f 6 	(DW_OP_fbreg: -104; DW_OP_deref)
 <2><d73>: Abbrev Number: 0
 <1><d74>: Abbrev Number: 19 (DW_TAG_array_type)
    <d75>   DW_AT_type        : <0x130>
    <d79>   DW_AT_sibling     : <0xd88>
 <2><d7d>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <d7e>   DW_AT_type        : <0x3d>
    <d82>   DW_AT_upper_bound : 4 byte block: 91 90 7f 6 	(DW_OP_fbreg: -112; DW_OP_deref)
 <2><d87>: Abbrev Number: 0
 <1><d88>: Abbrev Number: 19 (DW_TAG_array_type)
    <d89>   DW_AT_type        : <0x130>
    <d8d>   DW_AT_sibling     : <0xd9c>
 <2><d91>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <d92>   DW_AT_type        : <0x3d>
    <d96>   DW_AT_upper_bound : 4 byte block: 91 88 7f 6 	(DW_OP_fbreg: -120; DW_OP_deref)
 <2><d9b>: Abbrev Number: 0
 <1><d9c>: Abbrev Number: 19 (DW_TAG_array_type)
    <d9d>   DW_AT_type        : <0x399>
    <da1>   DW_AT_sibling     : <0xdb0>
 <2><da5>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <da6>   DW_AT_type        : <0x3d>
    <daa>   DW_AT_upper_bound : 4 byte block: 91 80 7f 6 	(DW_OP_fbreg: -128; DW_OP_deref)
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 48 (DW_TAG_subprogram)
    <db1>   DW_AT_external    : 1
    <db1>   DW_AT_name        : (indirect string, offset: 0x866a4): vMSTSchedulerStart
    <db5>   DW_AT_decl_file   : 1
    <db6>   DW_AT_decl_line   : 998
    <db8>   DW_AT_decl_column : 6
    <db9>   DW_AT_prototyped  : 1
    <db9>   DW_AT_low_pc      : 0x8000de4
    <dbd>   DW_AT_high_pc     : 0x10
    <dc1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc3>   DW_AT_call_all_tail_calls: 1
 <1><dc3>: Abbrev Number: 49 (DW_TAG_subprogram)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x20eee): prvComputeOrderedPriorities
    <dc8>   DW_AT_decl_file   : 1
    <dc9>   DW_AT_decl_line   : 928
    <dcb>   DW_AT_decl_column : 19
    <dcc>   DW_AT_type        : <0x109>
    <dd0>   DW_AT_low_pc      : 0x8000cac
    <dd4>   DW_AT_high_pc     : 0x138
    <dd8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dda>   DW_AT_call_all_tail_calls: 1
    <dda>   DW_AT_sibling     : <0xec3>
 <2><dde>: Abbrev Number: 50 (DW_TAG_variable)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x373c6): initialEvaluation
    <de3>   DW_AT_decl_file   : 1
    <de4>   DW_AT_decl_line   : 929
    <de6>   DW_AT_decl_column : 20
    <de7>   DW_AT_type        : <0x109>
    <deb>   DW_AT_const_value : 1
 <2><dec>: Abbrev Number: 3 (DW_TAG_variable)
    <ded>   DW_AT_name        : (indirect string, offset: 0x35b9e): listArray
    <df1>   DW_AT_decl_file   : 1
    <df1>   DW_AT_decl_line   : 930
    <df3>   DW_AT_decl_column : 12
    <df4>   DW_AT_type        : <0xec3>
    <df8>   DW_AT_location    : 3 byte block: 91 50 6 	(DW_OP_fbreg: -48; DW_OP_deref)
 <2><dfc>: Abbrev Number: 3 (DW_TAG_variable)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x73d07): xItm
    <e01>   DW_AT_decl_file   : 1
    <e01>   DW_AT_decl_line   : 933
    <e03>   DW_AT_decl_column : 14
    <e04>   DW_AT_type        : <0x232>
    <e08>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><e0b>: Abbrev Number: 3 (DW_TAG_variable)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x6e320): uxUsedPriority
    <e10>   DW_AT_decl_file   : 1
    <e10>   DW_AT_decl_line   : 956
    <e12>   DW_AT_decl_column : 14
    <e13>   DW_AT_type        : <0x11a>
    <e17>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><e1a>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <e1b>   DW_AT_low_pc      : 0x8000d0e
    <e1f>   DW_AT_high_pc     : 0x4a
    <e23>   DW_AT_sibling     : <0xe67>
 <3><e27>: Abbrev Number: 9 (DW_TAG_variable)
    <e28>   DW_AT_name        : i
    <e2a>   DW_AT_decl_file   : 1
    <e2a>   DW_AT_decl_line   : 934
    <e2c>   DW_AT_decl_column : 11
    <e2d>   DW_AT_type        : <0x2a>
    <e31>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><e34>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <e35>   DW_AT_low_pc      : 0x8000d14
    <e39>   DW_AT_high_pc     : 0x34
 <4><e3d>: Abbrev Number: 3 (DW_TAG_variable)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x7eca7): xTCB
    <e42>   DW_AT_decl_file   : 1
    <e42>   DW_AT_decl_line   : 935
    <e44>   DW_AT_decl_column : 13
    <e45>   DW_AT_type        : <0xac8>
    <e49>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><e4c>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <e4d>   DW_AT_abstract_origin: <0x1386>
    <e51>   DW_AT_low_pc      : 0x8000d20
    <e55>   DW_AT_high_pc     : 0x14
    <e59>   DW_AT_call_file   : 1
    <e59>   DW_AT_call_line   : 937
    <e5b>   DW_AT_call_column : 3
 <5><e5c>: Abbrev Number: 10 (DW_TAG_variable)
    <e5d>   DW_AT_abstract_origin: <0x138f>
    <e61>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <5><e64>: Abbrev Number: 0
 <4><e65>: Abbrev Number: 0
 <3><e66>: Abbrev Number: 0
 <2><e67>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <e68>   DW_AT_low_pc      : 0x8000d6c
    <e6c>   DW_AT_high_pc     : 0x5e
 <3><e70>: Abbrev Number: 3 (DW_TAG_variable)
    <e71>   DW_AT_name        : (indirect string, offset: 0x68aa): xCurrInx
    <e75>   DW_AT_decl_file   : 1
    <e75>   DW_AT_decl_line   : 958
    <e77>   DW_AT_decl_column : 19
    <e78>   DW_AT_type        : <0x11a>
    <e7c>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><e7f>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <e80>   DW_AT_low_pc      : 0x8000d72
    <e84>   DW_AT_high_pc     : 0x46
 <4><e88>: Abbrev Number: 3 (DW_TAG_variable)
    <e89>   DW_AT_name        : (indirect string, offset: 0x4b7e3): xTCB_Reference
    <e8d>   DW_AT_decl_file   : 1
    <e8d>   DW_AT_decl_line   : 959
    <e8f>   DW_AT_decl_column : 13
    <e90>   DW_AT_type        : <0xac8>
    <e94>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <4><e97>: Abbrev Number: 3 (DW_TAG_variable)
    <e98>   DW_AT_name        : (indirect string, offset: 0x36f00): bNewPriority
    <e9c>   DW_AT_decl_file   : 1
    <e9c>   DW_AT_decl_line   : 960
    <e9e>   DW_AT_decl_column : 15
    <e9f>   DW_AT_type        : <0x11a>
    <ea3>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <4><ea6>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <ea7>   DW_AT_abstract_origin: <0x1386>
    <eab>   DW_AT_low_pc      : 0x8000d92
    <eaf>   DW_AT_high_pc     : 0x14
    <eb3>   DW_AT_call_file   : 1
    <eb3>   DW_AT_call_line   : 974
    <eb5>   DW_AT_call_column : 3
 <5><eb6>: Abbrev Number: 10 (DW_TAG_variable)
    <eb7>   DW_AT_abstract_origin: <0x138f>
    <ebb>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <5><ebf>: Abbrev Number: 0
 <4><ec0>: Abbrev Number: 0
 <3><ec1>: Abbrev Number: 0
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 19 (DW_TAG_array_type)
    <ec4>   DW_AT_type        : <0xac8>
    <ec8>   DW_AT_sibling     : <0xed6>
 <2><ecc>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <ecd>   DW_AT_type        : <0x3d>
    <ed1>   DW_AT_upper_bound : 3 byte block: 91 54 6 	(DW_OP_fbreg: -44; DW_OP_deref)
 <2><ed5>: Abbrev Number: 0
 <1><ed6>: Abbrev Number: 51 (DW_TAG_subprogram)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x2dae3): prv_compare
    <edb>   DW_AT_decl_file   : 1
    <edc>   DW_AT_decl_line   : 598
    <ede>   DW_AT_decl_column : 12
    <edf>   DW_AT_prototyped  : 1
    <edf>   DW_AT_type        : <0x2a>
    <ee3>   DW_AT_low_pc      : 0x8000c66
    <ee7>   DW_AT_high_pc     : 0x46
    <eeb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eed>   DW_AT_call_all_calls: 1
    <eed>   DW_AT_sibling     : <0xf2e>
 <2><ef1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x1e2d7): arg1
    <ef6>   DW_AT_decl_file   : 1
    <ef6>   DW_AT_decl_line   : 598
    <ef8>   DW_AT_decl_column : 36
    <ef9>   DW_AT_type        : <0x548>
    <efd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f00>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f01>   DW_AT_name        : (indirect string, offset: 0x1e2dc): arg2
    <f05>   DW_AT_decl_file   : 1
    <f05>   DW_AT_decl_line   : 598
    <f07>   DW_AT_decl_column : 54
    <f08>   DW_AT_type        : <0x548>
    <f0c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f0f>: Abbrev Number: 3 (DW_TAG_variable)
    <f10>   DW_AT_name        : (indirect string, offset: 0x8bdbd): itm1
    <f14>   DW_AT_decl_file   : 1
    <f14>   DW_AT_decl_line   : 599
    <f16>   DW_AT_decl_column : 12
    <f17>   DW_AT_type        : <0xac8>
    <f1b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f1e>: Abbrev Number: 3 (DW_TAG_variable)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x8bdc2): itm2
    <f23>   DW_AT_decl_file   : 1
    <f23>   DW_AT_decl_line   : 600
    <f25>   DW_AT_decl_column : 12
    <f26>   DW_AT_type        : <0xac8>
    <f2a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f2d>: Abbrev Number: 0
 <1><f2e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <f2f>   DW_AT_external    : 1
    <f2f>   DW_AT_name        : (indirect string, offset: 0x84340): vMSTSporadicTaskRun
    <f33>   DW_AT_decl_file   : 1
    <f33>   DW_AT_decl_line   : 582
    <f35>   DW_AT_decl_column : 12
    <f35>   DW_AT_prototyped  : 1
    <f35>   DW_AT_type        : <0x109>
    <f39>   DW_AT_low_pc      : 0x8000c30
    <f3d>   DW_AT_high_pc     : 0x36
    <f41>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f43>   DW_AT_call_all_tail_calls: 1
    <f43>   DW_AT_sibling     : <0xf66>
 <2><f47>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f48>   DW_AT_name        : (indirect string, offset: 0x7747b): pxTaskToRunHandle
    <f4c>   DW_AT_decl_file   : 1
    <f4c>   DW_AT_decl_line   : 582
    <f4e>   DW_AT_decl_column : 46
    <f4f>   DW_AT_type        : <0x72a>
    <f53>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f56>: Abbrev Number: 3 (DW_TAG_variable)
    <f57>   DW_AT_name        : (indirect string, offset: 0x14076): xCurrExtTCB
    <f5b>   DW_AT_decl_file   : 1
    <f5b>   DW_AT_decl_line   : 586
    <f5d>   DW_AT_decl_column : 12
    <f5e>   DW_AT_type        : <0xac8>
    <f62>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f65>: Abbrev Number: 0
 <1><f66>: Abbrev Number: 22 (DW_TAG_subprogram)
    <f67>   DW_AT_name        : (indirect string, offset: 0x8632): prvMSTSporadicGenericJob
    <f6b>   DW_AT_decl_file   : 1
    <f6b>   DW_AT_decl_line   : 488
    <f6d>   DW_AT_decl_column : 13
    <f6d>   DW_AT_prototyped  : 1
    <f6d>   DW_AT_low_pc      : 0x8000ad4
    <f71>   DW_AT_high_pc     : 0x15c
    <f75>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f77>   DW_AT_call_all_tail_calls: 1
    <f77>   DW_AT_sibling     : <0x1016>
 <2><f7b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x6bbe): pvParameters
    <f80>   DW_AT_decl_file   : 1
    <f80>   DW_AT_decl_line   : 488
    <f82>   DW_AT_decl_column : 44
    <f83>   DW_AT_type        : <0xf6>
    <f87>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><f8a>: Abbrev Number: 3 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x56775): xCurrentHandle
    <f8f>   DW_AT_decl_file   : 1
    <f8f>   DW_AT_decl_line   : 490
    <f91>   DW_AT_decl_column : 15
    <f92>   DW_AT_type        : <0x248>
    <f96>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f99>: Abbrev Number: 3 (DW_TAG_variable)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x14076): xCurrExtTCB
    <f9e>   DW_AT_decl_file   : 1
    <f9e>   DW_AT_decl_line   : 491
    <fa0>   DW_AT_decl_column : 12
    <fa1>   DW_AT_type        : <0xac8>
    <fa5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fa8>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <fa9>   DW_AT_low_pc      : 0x8000b0a
    <fad>   DW_AT_high_pc     : 0x116
    <fb1>   DW_AT_sibling     : <0xffc>
 <3><fb5>: Abbrev Number: 3 (DW_TAG_variable)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x2d045): notificationGiver
    <fba>   DW_AT_decl_file   : 1
    <fba>   DW_AT_decl_line   : 500
    <fbc>   DW_AT_decl_column : 12
    <fbd>   DW_AT_type        : <0xc4>
    <fc1>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><fc4>: Abbrev Number: 3 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x986e3): xTimer
    <fc9>   DW_AT_decl_file   : 1
    <fc9>   DW_AT_decl_line   : 523
    <fcb>   DW_AT_decl_column : 17
    <fcc>   DW_AT_type        : <0x362>
    <fd0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><fd3>: Abbrev Number: 3 (DW_TAG_variable)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x3ca0c): actualCPUCycles
    <fd8>   DW_AT_decl_file   : 1
    <fd8>   DW_AT_decl_line   : 549
    <fda>   DW_AT_decl_column : 14
    <fdb>   DW_AT_type        : <0x109>
    <fdf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><fe2>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <fe3>   DW_AT_abstract_origin: <0x1386>
    <fe7>   DW_AT_low_pc      : 0x8000baa
    <feb>   DW_AT_high_pc     : 0x14
    <fef>   DW_AT_call_file   : 1
    <fef>   DW_AT_call_line   : 529
    <ff1>   DW_AT_call_column : 3
 <4><ff2>: Abbrev Number: 10 (DW_TAG_variable)
    <ff3>   DW_AT_abstract_origin: <0x138f>
    <ff7>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><ffa>: Abbrev Number: 0
 <3><ffb>: Abbrev Number: 0
 <2><ffc>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <ffd>   DW_AT_abstract_origin: <0x1386>
    <1001>   DW_AT_low_pc      : 0x8000af2
    <1005>   DW_AT_high_pc     : 0x14
    <1009>   DW_AT_call_file   : 1
    <1009>   DW_AT_call_line   : 493
    <100b>   DW_AT_call_column : 2
 <3><100c>: Abbrev Number: 10 (DW_TAG_variable)
    <100d>   DW_AT_abstract_origin: <0x138f>
    <1011>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><1014>: Abbrev Number: 0
 <2><1015>: Abbrev Number: 0
 <1><1016>: Abbrev Number: 34 (DW_TAG_subprogram)
    <1017>   DW_AT_name        : (indirect string, offset: 0x6581b): getTaskRunTime
    <101b>   DW_AT_decl_file   : 1
    <101b>   DW_AT_decl_line   : 480
    <101d>   DW_AT_decl_column : 19
    <101d>   DW_AT_prototyped  : 1
    <101d>   DW_AT_type        : <0x109>
    <1021>   DW_AT_low_pc      : 0x8000aa0
    <1025>   DW_AT_high_pc     : 0x34
    <1029>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <102b>   DW_AT_call_all_tail_calls: 1
    <102b>   DW_AT_sibling     : <0x105d>
 <2><102f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1030>   DW_AT_name        : (indirect string, offset: 0x873f3): handle
    <1034>   DW_AT_decl_file   : 1
    <1034>   DW_AT_decl_line   : 480
    <1036>   DW_AT_decl_column : 47
    <1037>   DW_AT_type        : <0x248>
    <103b>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><103e>: Abbrev Number: 3 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0x9342f): status
    <1043>   DW_AT_decl_file   : 1
    <1043>   DW_AT_decl_line   : 481
    <1045>   DW_AT_decl_column : 15
    <1046>   DW_AT_type        : <0x356>
    <104a>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><104d>: Abbrev Number: 3 (DW_TAG_variable)
    <104e>   DW_AT_name        : (indirect string, offset: 0x9560c): count
    <1052>   DW_AT_decl_file   : 1
    <1052>   DW_AT_decl_line   : 482
    <1054>   DW_AT_decl_column : 14
    <1055>   DW_AT_type        : <0x11a>
    <1059>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><105c>: Abbrev Number: 0
 <1><105d>: Abbrev Number: 35 (DW_TAG_subprogram)
    <105e>   DW_AT_external    : 1
    <105e>   DW_AT_name        : (indirect string, offset: 0xa012): vMSTSporadicTaskCreate
    <1062>   DW_AT_decl_file   : 1
    <1062>   DW_AT_decl_line   : 432
    <1064>   DW_AT_decl_column : 12
    <1064>   DW_AT_prototyped  : 1
    <1064>   DW_AT_type        : <0x109>
    <1068>   DW_AT_low_pc      : 0x80009c8
    <106c>   DW_AT_high_pc     : 0xd8
    <1070>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1072>   DW_AT_call_all_tail_calls: 1
    <1072>   DW_AT_sibling     : <0x1111>
 <2><1076>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1077>   DW_AT_name        : (indirect string, offset: 0x3b6cf): pvJobCode
    <107b>   DW_AT_decl_file   : 1
    <107b>   DW_AT_decl_line   : 432
    <107d>   DW_AT_decl_column : 50
    <107e>   DW_AT_type        : <0xda>
    <1082>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <2><1086>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1087>   DW_AT_name        : (indirect string, offset: 0x4230d): pcName
    <108b>   DW_AT_decl_file   : 1
    <108b>   DW_AT_decl_line   : 432
    <108d>   DW_AT_decl_column : 73
    <108e>   DW_AT_type        : <0x14d>
    <1092>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <2><1096>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1097>   DW_AT_name        : (indirect string, offset: 0x6b877): usStackDepth
    <109b>   DW_AT_decl_file   : 1
    <109b>   DW_AT_decl_line   : 433
    <109d>   DW_AT_decl_column : 12
    <109e>   DW_AT_type        : <0xa7>
    <10a2>   DW_AT_location    : 3 byte block: 91 ee 7e 	(DW_OP_fbreg: -146)
 <2><10a6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x6bbe): pvParameters
    <10ab>   DW_AT_decl_file   : 1
    <10ab>   DW_AT_decl_line   : 433
    <10ad>   DW_AT_decl_column : 32
    <10ae>   DW_AT_type        : <0xf6>
    <10b2>   DW_AT_location    : 3 byte block: 91 e8 7e 	(DW_OP_fbreg: -152)
 <2><10b6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x2b1f8): uxPriority
    <10bb>   DW_AT_decl_file   : 1
    <10bb>   DW_AT_decl_line   : 433
    <10bd>   DW_AT_decl_column : 58
    <10be>   DW_AT_type        : <0x11a>
    <10c2>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><10c5>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x4603a): pxCreatedTask
    <10ca>   DW_AT_decl_file   : 1
    <10ca>   DW_AT_decl_line   : 434
    <10cc>   DW_AT_decl_column : 17
    <10cd>   DW_AT_type        : <0x72a>
    <10d1>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><10d4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10d5>   DW_AT_name        : (indirect string, offset: 0x7e891): xTaskInterarrivalTime
    <10d9>   DW_AT_decl_file   : 1
    <10d9>   DW_AT_decl_line   : 436
    <10db>   DW_AT_decl_column : 14
    <10dc>   DW_AT_type        : <0x130>
    <10e0>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><10e3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x6daeb): xTaskDeadline
    <10e8>   DW_AT_decl_file   : 1
    <10e8>   DW_AT_decl_line   : 436
    <10ea>   DW_AT_decl_column : 48
    <10eb>   DW_AT_type        : <0x130>
    <10ef>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><10f2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x2749a): xTaskWCET
    <10f7>   DW_AT_decl_file   : 1
    <10f7>   DW_AT_decl_line   : 437
    <10f9>   DW_AT_decl_column : 14
    <10fa>   DW_AT_type        : <0x130>
    <10fe>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
 <2><1101>: Abbrev Number: 3 (DW_TAG_variable)
    <1102>   DW_AT_name        : (indirect string, offset: 0x77f2a): xNewExtTCB
    <1106>   DW_AT_decl_file   : 1
    <1106>   DW_AT_decl_line   : 439
    <1108>   DW_AT_decl_column : 12
    <1109>   DW_AT_type        : <0xac8>
    <110d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1110>: Abbrev Number: 0
 <1><1111>: Abbrev Number: 22 (DW_TAG_subprogram)
    <1112>   DW_AT_name        : (indirect string, offset: 0x3b692): prvMSTSporadicTimerCallback
    <1116>   DW_AT_decl_file   : 1
    <1116>   DW_AT_decl_line   : 419
    <1118>   DW_AT_decl_column : 13
    <1118>   DW_AT_prototyped  : 1
    <1118>   DW_AT_low_pc      : 0x80009a4
    <111c>   DW_AT_high_pc     : 0x24
    <1120>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1122>   DW_AT_call_all_tail_calls: 1
    <1122>   DW_AT_sibling     : <0x1145>
 <2><1126>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1127>   DW_AT_name        : (indirect string, offset: 0x986e3): xTimer
    <112b>   DW_AT_decl_file   : 1
    <112b>   DW_AT_decl_line   : 419
    <112d>   DW_AT_decl_column : 55
    <112e>   DW_AT_type        : <0x362>
    <1132>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1135>: Abbrev Number: 3 (DW_TAG_variable)
    <1136>   DW_AT_name        : (indirect string, offset: 0x7f504): param
    <113a>   DW_AT_decl_file   : 1
    <113a>   DW_AT_decl_line   : 423
    <113c>   DW_AT_decl_column : 16
    <113d>   DW_AT_type        : <0x72a>
    <1141>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1144>: Abbrev Number: 0
 <1><1145>: Abbrev Number: 22 (DW_TAG_subprogram)
    <1146>   DW_AT_name        : (indirect string, offset: 0x471be): prvMSTPeriodicTimerCallback
    <114a>   DW_AT_decl_file   : 1
    <114a>   DW_AT_decl_line   : 409
    <114c>   DW_AT_decl_column : 13
    <114c>   DW_AT_prototyped  : 1
    <114c>   DW_AT_low_pc      : 0x8000980
    <1150>   DW_AT_high_pc     : 0x24
    <1154>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1156>   DW_AT_call_all_tail_calls: 1
    <1156>   DW_AT_sibling     : <0x1179>
 <2><115a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <115b>   DW_AT_name        : (indirect string, offset: 0x986e3): xTimer
    <115f>   DW_AT_decl_file   : 1
    <115f>   DW_AT_decl_line   : 409
    <1161>   DW_AT_decl_column : 55
    <1162>   DW_AT_type        : <0x362>
    <1166>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1169>: Abbrev Number: 3 (DW_TAG_variable)
