Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x139e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8cb72): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x73a0): ../Core/Src/MSTScheduler.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x5e521): /Users/enricoalberti/Desktop/FILES/Embedded/FreeRTOS/MST4FreeRTOS/MST-FreeRTOS-Example/Debug
    <1a>   DW_AT_ranges      : 0x18
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 38 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5ee4): size_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 10 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

    <68>   DW_AT_name        : (indirect string, offset: 0x7486d): __uint16_t
    <6c>   DW_AT_decl_file   : 4
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 10 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x88fea): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_typedef)
    <7b>   DW_AT_name        : (indirect string, offset: 0x5692d): __int32_t
    <7f>   DW_AT_decl_file   : 4
    <80>   DW_AT_decl_line   : 77
    <81>   DW_AT_decl_column : 24
    <82>   DW_AT_type        : <0x86>
 <1><86>: Abbrev Number: 10 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0xb969): long int
 <1><8d>: Abbrev Number: 6 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x59b92): __uint32_t
    <92>   DW_AT_decl_file   : 4
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 10 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x2abd7): long unsigned int
 <1><a0>: Abbrev Number: 10 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1ce60): long long unsigned int
 <1><a7>: Abbrev Number: 6 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x67586): uint16_t
    <ac>   DW_AT_decl_file   : 5
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 9 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 6 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x5692f): int32_t
    <bd>   DW_AT_decl_file   : 5
    <be>   DW_AT_decl_line   : 44
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x7a>
 <1><c4>: Abbrev Number: 6 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x66df6): uint32_t
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 48
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x8d>
 <1><d0>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <d1>   DW_AT_type        : <0xc4>
 <1><d5>: Abbrev Number: 9 (DW_TAG_const_type)
    <d6>   DW_AT_type        : <0xd0>
 <1><da>: Abbrev Number: 6 (DW_TAG_typedef)
    <db>   DW_AT_name        : (indirect string, offset: 0x4267a): TaskFunction_t
    <df>   DW_AT_decl_file   : 6
    <e0>   DW_AT_decl_line   : 35
    <e1>   DW_AT_decl_column : 16
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <ec>   DW_AT_prototyped  : 1
    <ec>   DW_AT_sibling     : <0xf6>
 <2><f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f1>   DW_AT_type        : <0xf6>
 <2><f5>: Abbrev Number: 0
 <1><f6>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 9 (DW_TAG_const_type)
    <f9>   DW_AT_type        : <0xf6>
 <1><fd>: Abbrev Number: 6 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x678dc): StackType_t
    <102>   DW_AT_decl_file   : 2
    <103>   DW_AT_decl_line   : 55
    <104>   DW_AT_decl_column : 24
    <105>   DW_AT_type        : <0xc4>
 <1><109>: Abbrev Number: 6 (DW_TAG_typedef)
    <10a>   DW_AT_name        : (indirect string, offset: 0x83c03): BaseType_t
    <10e>   DW_AT_decl_file   : 2
    <10f>   DW_AT_decl_line   : 56
    <110>   DW_AT_decl_column : 14
    <111>   DW_AT_type        : <0x86>
 <1><115>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <116>   DW_AT_type        : <0x109>
 <1><11a>: Abbrev Number: 9 (DW_TAG_const_type)
    <11b>   DW_AT_type        : <0x109>
 <1><11f>: Abbrev Number: 6 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0x83c02): UBaseType_t
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 57
    <126>   DW_AT_decl_column : 23
    <127>   DW_AT_type        : <0x99>
 <1><12b>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <12c>   DW_AT_type        : <0x11f>
 <1><130>: Abbrev Number: 9 (DW_TAG_const_type)
    <131>   DW_AT_type        : <0x11f>
 <1><135>: Abbrev Number: 6 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x4da29): TickType_t
    <13a>   DW_AT_decl_file   : 2
    <13b>   DW_AT_decl_line   : 63
    <13c>   DW_AT_decl_column : 19
    <13d>   DW_AT_type        : <0xc4>
 <1><141>: Abbrev Number: 9 (DW_TAG_const_type)
    <142>   DW_AT_type        : <0x135>
 <1><146>: Abbrev Number: 10 (DW_TAG_base_type)
    <147>   DW_AT_byte_size   : 1
    <148>   DW_AT_encoding    : 8	(unsigned char)
    <149>   DW_AT_name        : (indirect string, offset: 0x2ce49): char
 <1><14d>: Abbrev Number: 9 (DW_TAG_const_type)
    <14e>   DW_AT_type        : <0x146>
 <1><152>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <153>   DW_AT_byte_size   : 4
    <153>   DW_AT_type        : <0x14d>
 <1><157>: Abbrev Number: 9 (DW_TAG_const_type)
    <158>   DW_AT_type        : <0x152>
 <1><15c>: Abbrev Number: 20 (DW_TAG_structure_type)
    <15d>   DW_AT_name        : (indirect string, offset: 0x3e886): xLIST_ITEM
    <161>   DW_AT_byte_size   : 20
    <162>   DW_AT_decl_file   : 7
    <163>   DW_AT_decl_line   : 140
    <164>   DW_AT_decl_column : 8
    <165>   DW_AT_sibling     : <0x1ab>
 <2><169>: Abbrev Number: 2 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0x6baca): xItemValue
    <16e>   DW_AT_decl_file   : 7
    <16f>   DW_AT_decl_line   : 143
    <170>   DW_AT_decl_column : 33
    <171>   DW_AT_type        : <0x135>
    <175>   DW_AT_data_member_location: 0
 <2><176>: Abbrev Number: 2 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x6d2cd): pxNext
    <17b>   DW_AT_decl_file   : 7
    <17c>   DW_AT_decl_line   : 144
    <17d>   DW_AT_decl_column : 42
    <17e>   DW_AT_type        : <0x1ab>
    <182>   DW_AT_data_member_location: 4
 <2><183>: Abbrev Number: 2 (DW_TAG_member)
    <184>   DW_AT_name        : (indirect string, offset: 0xc24b): pxPrevious
    <188>   DW_AT_decl_file   : 7
    <189>   DW_AT_decl_line   : 145
    <18a>   DW_AT_decl_column : 42
    <18b>   DW_AT_type        : <0x1ab>
    <18f>   DW_AT_data_member_location: 8
 <2><190>: Abbrev Number: 2 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x5235a): pvOwner
    <195>   DW_AT_decl_file   : 7
    <196>   DW_AT_decl_line   : 146
    <197>   DW_AT_decl_column : 9
    <198>   DW_AT_type        : <0xf6>
    <19c>   DW_AT_data_member_location: 12
 <2><19d>: Abbrev Number: 2 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0x662a1): pvContainer
    <1a2>   DW_AT_decl_file   : 7
    <1a3>   DW_AT_decl_line   : 147
    <1a4>   DW_AT_decl_column : 37
    <1a5>   DW_AT_type        : <0x1e5>
    <1a9>   DW_AT_data_member_location: 16
 <2><1aa>: Abbrev Number: 0
 <1><1ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ac>   DW_AT_type        : <0x15c>
 <1><1b0>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x8029a): xLIST
    <1b5>   DW_AT_byte_size   : 20
    <1b6>   DW_AT_decl_file   : 7
    <1b7>   DW_AT_decl_line   : 164
    <1b8>   DW_AT_decl_column : 16
    <1b9>   DW_AT_sibling     : <0x1e5>
 <2><1bd>: Abbrev Number: 2 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x6a5f0): uxNumberOfItems
    <1c2>   DW_AT_decl_file   : 7
    <1c3>   DW_AT_decl_line   : 167
    <1c4>   DW_AT_decl_column : 23
    <1c5>   DW_AT_type        : <0x12b>
    <1c9>   DW_AT_data_member_location: 0
 <2><1ca>: Abbrev Number: 2 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x4c154): pxIndex
    <1cf>   DW_AT_decl_file   : 7
    <1d0>   DW_AT_decl_line   : 168
    <1d1>   DW_AT_decl_column : 35
    <1d2>   DW_AT_type        : <0x237>
    <1d6>   DW_AT_data_member_location: 4
 <2><1d7>: Abbrev Number: 2 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x8bb1): xListEnd
    <1dc>   DW_AT_decl_file   : 7
    <1dd>   DW_AT_decl_line   : 169
    <1de>   DW_AT_decl_column : 17
    <1df>   DW_AT_type        : <0x22b>
    <1e3>   DW_AT_data_member_location: 8
 <2><1e4>: Abbrev Number: 0
 <1><1e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e6>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1b0>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_typedef)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x73596): ListItem_t
    <1ef>   DW_AT_decl_file   : 7
    <1f0>   DW_AT_decl_line   : 150
    <1f1>   DW_AT_decl_column : 27
    <1f2>   DW_AT_type        : <0x15c>
 <1><1f6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x59fec): xMINI_LIST_ITEM
    <1fb>   DW_AT_byte_size   : 12
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 152
    <1fe>   DW_AT_decl_column : 8
    <1ff>   DW_AT_sibling     : <0x22b>
 <2><203>: Abbrev Number: 2 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x6baca): xItemValue
    <208>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 155
    <20a>   DW_AT_decl_column : 33
    <20b>   DW_AT_type        : <0x135>
    <20f>   DW_AT_data_member_location: 0
 <2><210>: Abbrev Number: 2 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x6d2cd): pxNext
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 156
    <217>   DW_AT_decl_column : 42
    <218>   DW_AT_type        : <0x1ab>
    <21c>   DW_AT_data_member_location: 4
 <2><21d>: Abbrev Number: 2 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0xc24b): pxPrevious
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 157
    <224>   DW_AT_decl_column : 42
    <225>   DW_AT_type        : <0x1ab>
    <229>   DW_AT_data_member_location: 8
 <2><22a>: Abbrev Number: 0
 <1><22b>: Abbrev Number: 6 (DW_TAG_typedef)
    <22c>   DW_AT_name        : (indirect string, offset: 0x966a2): MiniListItem_t
    <230>   DW_AT_decl_file   : 7
    <231>   DW_AT_decl_line   : 159
    <232>   DW_AT_decl_column : 32
    <233>   DW_AT_type        : <0x1f6>
 <1><237>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <238>   DW_AT_byte_size   : 4
    <238>   DW_AT_type        : <0x1ea>
 <1><23c>: Abbrev Number: 9 (DW_TAG_const_type)
    <23d>   DW_AT_type        : <0x237>
 <1><241>: Abbrev Number: 6 (DW_TAG_typedef)
    <242>   DW_AT_name        : (indirect string, offset: 0x3bd8c): List_t
    <246>   DW_AT_decl_file   : 7
    <247>   DW_AT_decl_line   : 171
    <248>   DW_AT_decl_column : 3
    <249>   DW_AT_type        : <0x1b0>
 <1><24d>: Abbrev Number: 6 (DW_TAG_typedef)
    <24e>   DW_AT_name        : (indirect string, offset: 0x7c2a2): TaskHandle_t
    <252>   DW_AT_decl_file   : 8
    <253>   DW_AT_decl_line   : 70
    <254>   DW_AT_decl_column : 37
    <255>   DW_AT_type        : <0x259>
 <1><259>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25a>   DW_AT_byte_size   : 4
    <25a>   DW_AT_type        : <0x25e>
 <1><25e>: Abbrev Number: 25 (DW_TAG_structure_type)
    <25f>   DW_AT_name        : (indirect string, offset: 0x794fd): tskTaskControlBlock
    <263>   DW_AT_declaration : 1
 <1><263>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <264>   DW_AT_encoding    : 7	(unsigned)
    <264>   DW_AT_byte_size   : 1
    <264>   DW_AT_type        : <0x59>
    <268>   DW_AT_decl_file   : 8
    <268>   DW_AT_decl_line   : 80
    <269>   DW_AT_decl_column : 1
    <269>   DW_AT_sibling     : <0x292>
 <2><26d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <26e>   DW_AT_name        : (indirect string, offset: 0x3f2c4): eRunning
    <272>   DW_AT_const_value : 0
 <2><273>: Abbrev Number: 11 (DW_TAG_enumerator)
    <274>   DW_AT_name        : (indirect string, offset: 0x35d0b): eReady
    <278>   DW_AT_const_value : 1
 <2><279>: Abbrev Number: 11 (DW_TAG_enumerator)
    <27a>   DW_AT_name        : (indirect string, offset: 0x2f00e): eBlocked
    <27e>   DW_AT_const_value : 2
 <2><27f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <280>   DW_AT_name        : (indirect string, offset: 0x5206e): eSuspended
    <284>   DW_AT_const_value : 3
 <2><285>: Abbrev Number: 11 (DW_TAG_enumerator)
    <286>   DW_AT_name        : (indirect string, offset: 0x68d05): eDeleted
    <28a>   DW_AT_const_value : 4
 <2><28b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <28c>   DW_AT_name        : (indirect string, offset: 0x1681b): eInvalid
    <290>   DW_AT_const_value : 5
 <2><291>: Abbrev Number: 0
 <1><292>: Abbrev Number: 6 (DW_TAG_typedef)
    <293>   DW_AT_name        : (indirect string, offset: 0x312d): eTaskState
    <297>   DW_AT_decl_file   : 8
    <298>   DW_AT_decl_line   : 87
    <299>   DW_AT_decl_column : 3
    <29a>   DW_AT_type        : <0x263>
 <1><29e>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <29f>   DW_AT_encoding    : 7	(unsigned)
    <29f>   DW_AT_byte_size   : 1
    <29f>   DW_AT_type        : <0x59>
    <2a3>   DW_AT_decl_file   : 8
    <2a3>   DW_AT_decl_line   : 91
    <2a4>   DW_AT_decl_column : 1
    <2a4>   DW_AT_sibling     : <0x2c7>
 <2><2a8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x39906): eNoAction
    <2ad>   DW_AT_const_value : 0
 <2><2ae>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x61a4b): eSetBits
    <2b3>   DW_AT_const_value : 1
 <2><2b4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x983b6): eIncrement
    <2b9>   DW_AT_const_value : 2
 <2><2ba>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x6450d): eSetValueWithOverwrite
    <2bf>   DW_AT_const_value : 3
 <2><2c0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x275e3): eSetValueWithoutOverwrite
    <2c5>   DW_AT_const_value : 4
 <2><2c6>: Abbrev Number: 0
 <1><2c7>: Abbrev Number: 6 (DW_TAG_typedef)
    <2c8>   DW_AT_name        : (indirect string, offset: 0x4d528): eNotifyAction
    <2cc>   DW_AT_decl_file   : 8
    <2cd>   DW_AT_decl_line   : 97
    <2ce>   DW_AT_decl_column : 3
    <2cf>   DW_AT_type        : <0x29e>
 <1><2d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2d4>   DW_AT_byte_size   : 4
    <2d4>   DW_AT_type        : <0xfd>
 <1><2d8>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x88186): xTASK_STATUS
    <2dd>   DW_AT_byte_size   : 36
    <2de>   DW_AT_decl_file   : 8
    <2df>   DW_AT_decl_line   : 137
    <2e0>   DW_AT_decl_column : 16
    <2e1>   DW_AT_sibling     : <0x35b>
 <2><2e5>: Abbrev Number: 2 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x98375): xHandle
    <2ea>   DW_AT_decl_file   : 8
    <2eb>   DW_AT_decl_line   : 139
    <2ec>   DW_AT_decl_column : 15
    <2ed>   DW_AT_type        : <0x24d>
    <2f1>   DW_AT_data_member_location: 0
 <2><2f2>: Abbrev Number: 2 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x2f602): pcTaskName
    <2f7>   DW_AT_decl_file   : 8
    <2f8>   DW_AT_decl_line   : 140
    <2f9>   DW_AT_decl_column : 14
    <2fa>   DW_AT_type        : <0x152>
    <2fe>   DW_AT_data_member_location: 4
 <2><2ff>: Abbrev Number: 2 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x97da7): xTaskNumber
    <304>   DW_AT_decl_file   : 8
    <305>   DW_AT_decl_line   : 141
    <306>   DW_AT_decl_column : 14
    <307>   DW_AT_type        : <0x11f>
    <30b>   DW_AT_data_member_location: 8
 <2><30c>: Abbrev Number: 2 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x54060): eCurrentState
    <311>   DW_AT_decl_file   : 8
    <312>   DW_AT_decl_line   : 142
    <313>   DW_AT_decl_column : 13
    <314>   DW_AT_type        : <0x292>
    <318>   DW_AT_data_member_location: 12
 <2><319>: Abbrev Number: 2 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x3aca8): uxCurrentPriority
    <31e>   DW_AT_decl_file   : 8
    <31f>   DW_AT_decl_line   : 143
    <320>   DW_AT_decl_column : 14
    <321>   DW_AT_type        : <0x11f>
    <325>   DW_AT_data_member_location: 16
 <2><326>: Abbrev Number: 2 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x57355): uxBasePriority
    <32b>   DW_AT_decl_file   : 8
    <32c>   DW_AT_decl_line   : 144
    <32d>   DW_AT_decl_column : 14
    <32e>   DW_AT_type        : <0x11f>
    <332>   DW_AT_data_member_location: 20
 <2><333>: Abbrev Number: 2 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x6109e): ulRunTimeCounter
    <338>   DW_AT_decl_file   : 8
    <339>   DW_AT_decl_line   : 145
    <33a>   DW_AT_decl_column : 11
    <33b>   DW_AT_type        : <0xc4>
    <33f>   DW_AT_data_member_location: 24
 <2><340>: Abbrev Number: 2 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x43c39): pxStackBase
    <345>   DW_AT_decl_file   : 8
    <346>   DW_AT_decl_line   : 146
    <347>   DW_AT_decl_column : 15
    <348>   DW_AT_type        : <0x2d3>
    <34c>   DW_AT_data_member_location: 28
 <2><34d>: Abbrev Number: 2 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x3ff02): usStackHighWaterMark
    <352>   DW_AT_decl_file   : 8
    <353>   DW_AT_decl_line   : 147
    <354>   DW_AT_decl_column : 25
    <355>   DW_AT_type        : <0xa7>
    <359>   DW_AT_data_member_location: 32
 <2><35a>: Abbrev Number: 0
 <1><35b>: Abbrev Number: 6 (DW_TAG_typedef)
    <35c>   DW_AT_name        : (indirect string, offset: 0x1c2a6): TaskStatus_t
    <360>   DW_AT_decl_file   : 8
    <361>   DW_AT_decl_line   : 148
    <362>   DW_AT_decl_column : 3
    <363>   DW_AT_type        : <0x2d8>
 <1><367>: Abbrev Number: 6 (DW_TAG_typedef)
    <368>   DW_AT_name        : (indirect string, offset: 0x35a3): TimerHandle_t
    <36c>   DW_AT_decl_file   : 9
    <36d>   DW_AT_decl_line   : 77
    <36e>   DW_AT_decl_column : 34
    <36f>   DW_AT_type        : <0x378>
 <1><373>: Abbrev Number: 9 (DW_TAG_const_type)
    <374>   DW_AT_type        : <0x367>
 <1><378>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <379>   DW_AT_byte_size   : 4
    <379>   DW_AT_type        : <0x37d>
 <1><37d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <37e>   DW_AT_name        : (indirect string, offset: 0x16ea7): tmrTimerControl
    <382>   DW_AT_declaration : 1
 <1><382>: Abbrev Number: 6 (DW_TAG_typedef)
    <383>   DW_AT_name        : (indirect string, offset: 0x49f35): TimerCallbackFunction_t
    <387>   DW_AT_decl_file   : 9
    <388>   DW_AT_decl_line   : 82
    <389>   DW_AT_decl_column : 16
    <38a>   DW_AT_type        : <0x38e>
 <1><38e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <38f>   DW_AT_byte_size   : 4
    <38f>   DW_AT_type        : <0x393>
 <1><393>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <394>   DW_AT_prototyped  : 1
    <394>   DW_AT_sibling     : <0x39e>
 <2><398>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <399>   DW_AT_type        : <0x367>
 <2><39d>: Abbrev Number: 0
 <1><39e>: Abbrev Number: 10 (DW_TAG_base_type)
    <39f>   DW_AT_byte_size   : 4
    <3a0>   DW_AT_encoding    : 4	(float)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x7a796): float
 <1><3a5>: Abbrev Number: 10 (DW_TAG_base_type)
    <3a6>   DW_AT_byte_size   : 8
    <3a7>   DW_AT_encoding    : 4	(float)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x10b88): double
 <1><3ac>: Abbrev Number: 27 (DW_TAG_array_type)
    <3ad>   DW_AT_type        : <0xc4>
    <3b1>   DW_AT_sibling     : <0x3bc>
 <2><3b5>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <3b6>   DW_AT_type        : <0x3d>
    <3ba>   DW_AT_upper_bound : 0
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 28 (DW_TAG_structure_type)
    <3bd>   DW_AT_byte_size   : 92
    <3be>   DW_AT_decl_file   : 10
    <3be>   DW_AT_decl_line   : 904
    <3c0>   DW_AT_decl_column : 9
    <3c0>   DW_AT_sibling     : <0x4d9>
 <2><3c4>: Abbrev Number: 4 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x4d316): CTRL
    <3c9>   DW_AT_decl_file   : 10
    <3c9>   DW_AT_decl_line   : 906
    <3cb>   DW_AT_decl_column : 18
    <3cb>   DW_AT_type        : <0xd0>
    <3cf>   DW_AT_data_member_location: 0
 <2><3d0>: Abbrev Number: 4 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x2a4ae): CYCCNT
    <3d5>   DW_AT_decl_file   : 10
    <3d5>   DW_AT_decl_line   : 907
    <3d7>   DW_AT_decl_column : 18
    <3d7>   DW_AT_type        : <0xd0>
    <3db>   DW_AT_data_member_location: 4
 <2><3dc>: Abbrev Number: 4 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x4a179): CPICNT
    <3e1>   DW_AT_decl_file   : 10
    <3e1>   DW_AT_decl_line   : 908
    <3e3>   DW_AT_decl_column : 18
    <3e3>   DW_AT_type        : <0xd0>
    <3e7>   DW_AT_data_member_location: 8
 <2><3e8>: Abbrev Number: 4 (DW_TAG_member)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x79161): EXCCNT
    <3ed>   DW_AT_decl_file   : 10
    <3ed>   DW_AT_decl_line   : 909
    <3ef>   DW_AT_decl_column : 18
    <3ef>   DW_AT_type        : <0xd0>
    <3f3>   DW_AT_data_member_location: 12
 <2><3f4>: Abbrev Number: 4 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x2f291): SLEEPCNT
    <3f9>   DW_AT_decl_file   : 10
    <3f9>   DW_AT_decl_line   : 910
    <3fb>   DW_AT_decl_column : 18
    <3fb>   DW_AT_type        : <0xd0>
    <3ff>   DW_AT_data_member_location: 16
 <2><400>: Abbrev Number: 4 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0xc429): LSUCNT
    <405>   DW_AT_decl_file   : 10
    <405>   DW_AT_decl_line   : 911
    <407>   DW_AT_decl_column : 18
    <407>   DW_AT_type        : <0xd0>
    <40b>   DW_AT_data_member_location: 20
 <2><40c>: Abbrev Number: 4 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x5acd9): FOLDCNT
    <411>   DW_AT_decl_file   : 10
    <411>   DW_AT_decl_line   : 912
    <413>   DW_AT_decl_column : 18
    <413>   DW_AT_type        : <0xd0>
    <417>   DW_AT_data_member_location: 24
 <2><418>: Abbrev Number: 4 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0x55d9e): PCSR
    <41d>   DW_AT_decl_file   : 10
    <41d>   DW_AT_decl_line   : 913
    <41f>   DW_AT_decl_column : 18
    <41f>   DW_AT_type        : <0xd5>
    <423>   DW_AT_data_member_location: 28
 <2><424>: Abbrev Number: 4 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x81c9): COMP0
    <429>   DW_AT_decl_file   : 10
    <429>   DW_AT_decl_line   : 914
    <42b>   DW_AT_decl_column : 18
    <42b>   DW_AT_type        : <0xd0>
    <42f>   DW_AT_data_member_location: 32
 <2><430>: Abbrev Number: 4 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0x46259): MASK0
    <435>   DW_AT_decl_file   : 10
    <435>   DW_AT_decl_line   : 915
    <437>   DW_AT_decl_column : 18
    <437>   DW_AT_type        : <0xd0>
    <43b>   DW_AT_data_member_location: 36
 <2><43c>: Abbrev Number: 4 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x1d9f): FUNCTION0
    <441>   DW_AT_decl_file   : 10
    <441>   DW_AT_decl_line   : 916
    <443>   DW_AT_decl_column : 18
    <443>   DW_AT_type        : <0xd0>
    <447>   DW_AT_data_member_location: 40
 <2><448>: Abbrev Number: 4 (DW_TAG_member)
    <449>   DW_AT_name        : (indirect string, offset: 0x86e20): RESERVED0
    <44d>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 917
    <44f>   DW_AT_decl_column : 18
    <44f>   DW_AT_type        : <0x3ac>
    <453>   DW_AT_data_member_location: 44
 <2><454>: Abbrev Number: 4 (DW_TAG_member)
    <455>   DW_AT_name        : (indirect string, offset: 0x4907f): COMP1
    <459>   DW_AT_decl_file   : 10
    <459>   DW_AT_decl_line   : 918
    <45b>   DW_AT_decl_column : 18
    <45b>   DW_AT_type        : <0xd0>
    <45f>   DW_AT_data_member_location: 48
 <2><460>: Abbrev Number: 4 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0x4625f): MASK1
    <465>   DW_AT_decl_file   : 10
    <465>   DW_AT_decl_line   : 919
    <467>   DW_AT_decl_column : 18
    <467>   DW_AT_type        : <0xd0>
    <46b>   DW_AT_data_member_location: 52
 <2><46c>: Abbrev Number: 4 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0x1da9): FUNCTION1
    <471>   DW_AT_decl_file   : 10
    <471>   DW_AT_decl_line   : 920
    <473>   DW_AT_decl_column : 18
    <473>   DW_AT_type        : <0xd0>
    <477>   DW_AT_data_member_location: 56
 <2><478>: Abbrev Number: 4 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x86e2a): RESERVED1
    <47d>   DW_AT_decl_file   : 10
    <47d>   DW_AT_decl_line   : 921
    <47f>   DW_AT_decl_column : 18
    <47f>   DW_AT_type        : <0x3ac>
    <483>   DW_AT_data_member_location: 60
 <2><484>: Abbrev Number: 4 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x111a8): COMP2
    <489>   DW_AT_decl_file   : 10
    <489>   DW_AT_decl_line   : 922
    <48b>   DW_AT_decl_column : 18
    <48b>   DW_AT_type        : <0xd0>
    <48f>   DW_AT_data_member_location: 64
 <2><490>: Abbrev Number: 4 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x58999): MASK2
    <495>   DW_AT_decl_file   : 10
    <495>   DW_AT_decl_line   : 923
    <497>   DW_AT_decl_column : 18
    <497>   DW_AT_type        : <0xd0>
    <49b>   DW_AT_data_member_location: 68
 <2><49c>: Abbrev Number: 4 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x1db3): FUNCTION2
    <4a1>   DW_AT_decl_file   : 10
    <4a1>   DW_AT_decl_line   : 924
    <4a3>   DW_AT_decl_column : 18
    <4a3>   DW_AT_type        : <0xd0>
    <4a7>   DW_AT_data_member_location: 72
 <2><4a8>: Abbrev Number: 4 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x86e34): RESERVED2
    <4ad>   DW_AT_decl_file   : 10
    <4ad>   DW_AT_decl_line   : 925
    <4af>   DW_AT_decl_column : 18
    <4af>   DW_AT_type        : <0x3ac>
    <4b3>   DW_AT_data_member_location: 76
 <2><4b4>: Abbrev Number: 4 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x6112e): COMP3
    <4b9>   DW_AT_decl_file   : 10
    <4b9>   DW_AT_decl_line   : 926
    <4bb>   DW_AT_decl_column : 18
    <4bb>   DW_AT_type        : <0xd0>
    <4bf>   DW_AT_data_member_location: 80
 <2><4c0>: Abbrev Number: 4 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x462b8): MASK3
    <4c5>   DW_AT_decl_file   : 10
    <4c5>   DW_AT_decl_line   : 927
    <4c7>   DW_AT_decl_column : 18
    <4c7>   DW_AT_type        : <0xd0>
    <4cb>   DW_AT_data_member_location: 84
 <2><4cc>: Abbrev Number: 4 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x1dbd): FUNCTION3
    <4d1>   DW_AT_decl_file   : 10
    <4d1>   DW_AT_decl_line   : 928
    <4d3>   DW_AT_decl_column : 18
    <4d3>   DW_AT_type        : <0xd0>
    <4d7>   DW_AT_data_member_location: 88
 <2><4d8>: Abbrev Number: 0
 <1><4d9>: Abbrev Number: 29 (DW_TAG_typedef)
    <4da>   DW_AT_name        : (indirect string, offset: 0x25577): DWT_Type
    <4de>   DW_AT_decl_file   : 10
    <4de>   DW_AT_decl_line   : 929
    <4e0>   DW_AT_decl_column : 3
    <4e0>   DW_AT_type        : <0x3bc>
 <1><4e4>: Abbrev Number: 28 (DW_TAG_structure_type)
    <4e5>   DW_AT_byte_size   : 16
    <4e6>   DW_AT_decl_file   : 10
    <4e6>   DW_AT_decl_line   : 1421
    <4e8>   DW_AT_decl_column : 9
    <4e8>   DW_AT_sibling     : <0x51d>
 <2><4ec>: Abbrev Number: 4 (DW_TAG_member)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x677a7): DHCSR
    <4f1>   DW_AT_decl_file   : 10
    <4f1>   DW_AT_decl_line   : 1423
    <4f3>   DW_AT_decl_column : 18
    <4f3>   DW_AT_type        : <0xd0>
    <4f7>   DW_AT_data_member_location: 0
 <2><4f8>: Abbrev Number: 4 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x7bd2b): DCRSR
    <4fd>   DW_AT_decl_file   : 10
    <4fd>   DW_AT_decl_line   : 1424
    <4ff>   DW_AT_decl_column : 18
    <4ff>   DW_AT_type        : <0xd0>
    <503>   DW_AT_data_member_location: 4
 <2><504>: Abbrev Number: 4 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x7759c): DCRDR
    <509>   DW_AT_decl_file   : 10
    <509>   DW_AT_decl_line   : 1425
    <50b>   DW_AT_decl_column : 18
    <50b>   DW_AT_type        : <0xd0>
    <50f>   DW_AT_data_member_location: 8
 <2><510>: Abbrev Number: 4 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x48722): DEMCR
    <515>   DW_AT_decl_file   : 10
    <515>   DW_AT_decl_line   : 1426
    <517>   DW_AT_decl_column : 18
    <517>   DW_AT_type        : <0xd0>
    <51b>   DW_AT_data_member_location: 12
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 29 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x3b4b4): CoreDebug_Type
    <522>   DW_AT_decl_file   : 10
    <522>   DW_AT_decl_line   : 1427
    <524>   DW_AT_decl_column : 3
    <524>   DW_AT_type        : <0x4e4>
 <1><528>: Abbrev Number: 6 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x5db37): __compar_fn_t
    <52d>   DW_AT_decl_file   : 11
    <52e>   DW_AT_decl_line   : 57
    <52f>   DW_AT_decl_column : 15
    <530>   DW_AT_type        : <0x534>
 <1><534>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <535>   DW_AT_byte_size   : 4
    <535>   DW_AT_type        : <0x539>
 <1><539>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <53a>   DW_AT_prototyped  : 1
    <53a>   DW_AT_type        : <0x2a>
    <53e>   DW_AT_sibling     : <0x54d>
 <2><542>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <543>   DW_AT_type        : <0x54d>
 <2><547>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <548>   DW_AT_type        : <0x54d>
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <54e>   DW_AT_byte_size   : 4
    <54e>   DW_AT_type        : <0x552>
 <1><552>: Abbrev Number: 42 (DW_TAG_const_type)
 <1><553>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <554>   DW_AT_name        : (indirect string, offset: 0x34d42): taskType_e
    <558>   DW_AT_encoding    : 7	(unsigned)
    <559>   DW_AT_byte_size   : 1
    <55a>   DW_AT_type        : <0x59>
    <55e>   DW_AT_decl_file   : 1
    <55f>   DW_AT_decl_line   : 29
    <560>   DW_AT_decl_column : 14
    <561>   DW_AT_sibling     : <0x572>
 <2><565>: Abbrev Number: 11 (DW_TAG_enumerator)
    <566>   DW_AT_name        : (indirect string, offset: 0x47dda): taskTypePeriodic
    <56a>   DW_AT_const_value : 0
 <2><56b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <56c>   DW_AT_name        : (indirect string, offset: 0x6279): taskTypeSporadic
    <570>   DW_AT_const_value : 1
 <2><571>: Abbrev Number: 0
 <1><572>: Abbrev Number: 6 (DW_TAG_typedef)
    <573>   DW_AT_name        : (indirect string, offset: 0x34d42): taskType_e
    <577>   DW_AT_decl_file   : 1
    <578>   DW_AT_decl_line   : 31
    <579>   DW_AT_decl_column : 3
    <57a>   DW_AT_type        : <0x553>
 <1><57e>: Abbrev Number: 15 (DW_TAG_variable)
    <57f>   DW_AT_name        : (indirect string, offset: 0x5b290): vTasksListInit
    <583>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 44
    <584>   DW_AT_decl_column : 19
    <585>   DW_AT_type        : <0x109>
    <589>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><58f>: Abbrev Number: 15 (DW_TAG_variable)
    <590>   DW_AT_name        : (indirect string, offset: 0x706a0): xTasksList
    <594>   DW_AT_decl_file   : 1
    <594>   DW_AT_decl_line   : 45
    <595>   DW_AT_decl_column : 15
    <596>   DW_AT_type        : <0x241>
    <59a>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><5a0>: Abbrev Number: 15 (DW_TAG_variable)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x6570e): xListTasksNumber
    <5a5>   DW_AT_decl_file   : 1
    <5a5>   DW_AT_decl_line   : 46
    <5a6>   DW_AT_decl_column : 19
    <5a7>   DW_AT_type        : <0x109>
    <5ab>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><5b1>: Abbrev Number: 15 (DW_TAG_variable)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x19334): SporadicServerHandle
    <5b6>   DW_AT_decl_file   : 1
    <5b6>   DW_AT_decl_line   : 74
    <5b7>   DW_AT_decl_column : 21
    <5b8>   DW_AT_type        : <0x24d>
    <5bc>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><5c2>: Abbrev Number: 20 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x14f05): MSTextendedTCB
    <5c7>   DW_AT_byte_size   : 124
    <5c8>   DW_AT_decl_file   : 1
    <5c9>   DW_AT_decl_line   : 88
    <5ca>   DW_AT_decl_column : 16
    <5cb>   DW_AT_sibling     : <0x72f>
 <2><5cf>: Abbrev Number: 2 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x3d96b): pxTaskTCBListItem
    <5d4>   DW_AT_decl_file   : 1
    <5d5>   DW_AT_decl_line   : 91
    <5d6>   DW_AT_decl_column : 13
    <5d7>   DW_AT_type        : <0x1ea>
    <5db>   DW_AT_data_member_location: 0
 <2><5dc>: Abbrev Number: 2 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x3b733): pvJobCode
    <5e1>   DW_AT_decl_file   : 1
    <5e2>   DW_AT_decl_line   : 93
    <5e3>   DW_AT_decl_column : 17
    <5e4>   DW_AT_type        : <0xda>
    <5e8>   DW_AT_data_member_location: 20
 <2><5e9>: Abbrev Number: 2 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x42345): pcName
    <5ee>   DW_AT_decl_file   : 1
    <5ef>   DW_AT_decl_line   : 94
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x152>
    <5f5>   DW_AT_data_member_location: 24
 <2><5f6>: Abbrev Number: 2 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x6b80c): usStackDepth
    <5fb>   DW_AT_decl_file   : 1
    <5fc>   DW_AT_decl_line   : 95
    <5fd>   DW_AT_decl_column : 25
    <5fe>   DW_AT_type        : <0xa7>
    <602>   DW_AT_data_member_location: 28
 <2><603>: Abbrev Number: 2 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x6bf7): pvParameters
    <608>   DW_AT_decl_file   : 1
    <609>   DW_AT_decl_line   : 96
    <60a>   DW_AT_decl_column : 8
    <60b>   DW_AT_type        : <0xf6>
    <60f>   DW_AT_data_member_location: 32
 <2><610>: Abbrev Number: 2 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x2b1c5): uxPriority
    <615>   DW_AT_decl_file   : 1
    <616>   DW_AT_decl_line   : 97
    <617>   DW_AT_decl_column : 14
    <618>   DW_AT_type        : <0x11f>
    <61c>   DW_AT_data_member_location: 36
 <2><61d>: Abbrev Number: 2 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x45ffd): pxCreatedTask
    <622>   DW_AT_decl_file   : 1
    <623>   DW_AT_decl_line   : 98
    <624>   DW_AT_decl_column : 16
    <625>   DW_AT_type        : <0x72f>
    <629>   DW_AT_data_member_location: 40
 <2><62a>: Abbrev Number: 2 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x78ce7): taskType
    <62f>   DW_AT_decl_file   : 1
    <630>   DW_AT_decl_line   : 99
    <631>   DW_AT_decl_column : 18
    <632>   DW_AT_type        : <0x553>
    <636>   DW_AT_data_member_location: 44
 <2><637>: Abbrev Number: 2 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0x5898d): xTaskPeriod
    <63c>   DW_AT_decl_file   : 1
    <63d>   DW_AT_decl_line   : 101
    <63e>   DW_AT_decl_column : 13
    <63f>   DW_AT_type        : <0x135>
    <643>   DW_AT_data_member_location: 48
 <2><644>: Abbrev Number: 2 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x6da94): xTaskDeadline
    <649>   DW_AT_decl_file   : 1
    <64a>   DW_AT_decl_line   : 102
    <64b>   DW_AT_decl_column : 13
    <64c>   DW_AT_type        : <0x135>
    <650>   DW_AT_data_member_location: 52
 <2><651>: Abbrev Number: 2 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x3fa85): xTaskPhase
    <656>   DW_AT_decl_file   : 1
    <657>   DW_AT_decl_line   : 103
    <658>   DW_AT_decl_column : 13
    <659>   DW_AT_type        : <0x135>
    <65d>   DW_AT_data_member_location: 56
 <2><65e>: Abbrev Number: 2 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x2756c): xTaskWCET
    <663>   DW_AT_decl_file   : 1
    <664>   DW_AT_decl_line   : 104
    <665>   DW_AT_decl_column : 13
    <666>   DW_AT_type        : <0x135>
    <66a>   DW_AT_data_member_location: 60
 <2><66b>: Abbrev Number: 2 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x3ad08): xPrevReleaseTime
    <670>   DW_AT_decl_file   : 1
    <671>   DW_AT_decl_line   : 106
    <672>   DW_AT_decl_column : 13
    <673>   DW_AT_type        : <0x135>
    <677>   DW_AT_data_member_location: 64
 <2><678>: Abbrev Number: 2 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x49210): xPrevExecTime
    <67d>   DW_AT_decl_file   : 1
    <67e>   DW_AT_decl_line   : 107
    <67f>   DW_AT_decl_column : 13
    <680>   DW_AT_type        : <0x135>
    <684>   DW_AT_data_member_location: 68
 <2><685>: Abbrev Number: 2 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0x655f3): xPrevAbsDeadline
    <68a>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 108
    <68c>   DW_AT_decl_column : 13
    <68d>   DW_AT_type        : <0x135>
    <691>   DW_AT_data_member_location: 72
 <2><692>: Abbrev Number: 2 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0xfb): xPrevStartTime
    <697>   DW_AT_decl_file   : 1
    <698>   DW_AT_decl_line   : 109
    <699>   DW_AT_decl_column : 13
    <69a>   DW_AT_type        : <0x135>
    <69e>   DW_AT_data_member_location: 76
 <2><69f>: Abbrev Number: 2 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x5e6f6): xPrevFinishTime
    <6a4>   DW_AT_decl_file   : 1
    <6a5>   DW_AT_decl_line   : 110
    <6a6>   DW_AT_decl_column : 13
    <6a7>   DW_AT_type        : <0x135>
    <6ab>   DW_AT_data_member_location: 80
 <2><6ac>: Abbrev Number: 2 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x15972): uNumOfMissedDeadlines
    <6b1>   DW_AT_decl_file   : 1
    <6b2>   DW_AT_decl_line   : 111
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x11f>
    <6b8>   DW_AT_data_member_location: 84
 <2><6b9>: Abbrev Number: 2 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x77784): xNextIdealReleaseTime
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 112
    <6c0>   DW_AT_decl_column : 13
    <6c1>   DW_AT_type        : <0x135>
    <6c5>   DW_AT_data_member_location: 88
 <2><6c6>: Abbrev Number: 2 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x503a8): xTaskInitDone
    <6cb>   DW_AT_decl_file   : 1
    <6cc>   DW_AT_decl_line   : 116
    <6cd>   DW_AT_decl_column : 13
    <6ce>   DW_AT_type        : <0x109>
    <6d2>   DW_AT_data_member_location: 92
 <2><6d3>: Abbrev Number: 2 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x2de9f): xTaskSpecificTimer
    <6d8>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 121
    <6da>   DW_AT_decl_column : 16
    <6db>   DW_AT_type        : <0x367>
    <6df>   DW_AT_data_member_location: 96
 <2><6e0>: Abbrev Number: 2 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x83ab9): xUsFromIdealRelease
    <6e5>   DW_AT_decl_file   : 1
    <6e6>   DW_AT_decl_line   : 127
    <6e7>   DW_AT_decl_column : 10
    <6e8>   DW_AT_type        : <0xb8>
    <6ec>   DW_AT_data_member_location: 100
 <2><6ed>: Abbrev Number: 2 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x2e716): xNumOfIterations
    <6f2>   DW_AT_decl_file   : 1
    <6f3>   DW_AT_decl_line   : 128
    <6f4>   DW_AT_decl_column : 11
    <6f5>   DW_AT_type        : <0xc4>
    <6f9>   DW_AT_data_member_location: 104
 <2><6fa>: Abbrev Number: 2 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x4134d): xUsAverageReleaseGap
    <6ff>   DW_AT_decl_file   : 1
    <700>   DW_AT_decl_line   : 129
    <701>   DW_AT_decl_column : 10
    <702>   DW_AT_type        : <0xb8>
    <706>   DW_AT_data_member_location: 108
 <2><707>: Abbrev Number: 2 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x7e8b3): xTaskInterarrivalTime
    <70c>   DW_AT_decl_file   : 1
    <70d>   DW_AT_decl_line   : 134
    <70e>   DW_AT_decl_column : 13
    <70f>   DW_AT_type        : <0x135>
    <713>   DW_AT_data_member_location: 112
 <2><714>: Abbrev Number: 2 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x43be1): xInterarrivalTimerRunning
    <719>   DW_AT_decl_file   : 1
    <71a>   DW_AT_decl_line   : 135
    <71b>   DW_AT_decl_column : 13
    <71c>   DW_AT_type        : <0x109>
    <720>   DW_AT_data_member_location: 116
 <2><721>: Abbrev Number: 2 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0x3d59a): xJobCalled
    <726>   DW_AT_decl_file   : 1
    <727>   DW_AT_decl_line   : 136
    <728>   DW_AT_decl_column : 13
    <729>   DW_AT_type        : <0x109>
    <72d>   DW_AT_data_member_location: 120
 <2><72e>: Abbrev Number: 0
 <1><72f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <730>   DW_AT_byte_size   : 4
    <730>   DW_AT_type        : <0x24d>
 <1><734>: Abbrev Number: 9 (DW_TAG_const_type)
    <735>   DW_AT_type        : <0x72f>
 <1><739>: Abbrev Number: 6 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x8c19e): extTCB_t
    <73e>   DW_AT_decl_file   : 1
    <73f>   DW_AT_decl_line   : 145
    <740>   DW_AT_decl_column : 3
    <741>   DW_AT_type        : <0x5c2>
 <1><745>: Abbrev Number: 3 (DW_TAG_variable)
    <746>   DW_AT_name        : (indirect string, offset: 0x7aff4): prvXMaxInterrarrivalTime
    <74a>   DW_AT_decl_file   : 1
    <74a>   DW_AT_decl_line   : 422
    <74c>   DW_AT_decl_column : 19
    <74d>   DW_AT_type        : <0x135>
    <751>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><757>: Abbrev Number: 30 (DW_TAG_variable)
    <758>   DW_AT_name        : (indirect string, offset: 0x95b6): SporadicServerBudget
    <75c>   DW_AT_decl_file   : 1
    <75c>   DW_AT_decl_line   : 710
    <75e>   DW_AT_decl_column : 21
    <75e>   DW_AT_type        : <0x115>
    <762>   DW_AT_external    : 1
    <762>   DW_AT_location    : 5 byte block: 3 a4 0 0 20 	(DW_OP_addr: 200000a4)
 <1><768>: Abbrev Number: 30 (DW_TAG_variable)
    <769>   DW_AT_name        : (indirect string, offset: 0x81756): isNextTaskAvailable
    <76d>   DW_AT_decl_file   : 1
    <76d>   DW_AT_decl_line   : 721
    <76f>   DW_AT_decl_column : 21
    <76f>   DW_AT_type        : <0x115>
    <773>   DW_AT_external    : 1
    <773>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><779>: Abbrev Number: 44 (DW_TAG_subprogram)
    <77a>   DW_AT_external    : 1
    <77a>   DW_AT_name        : (indirect string, offset: 0x72978): vTaskStartScheduler
    <77e>   DW_AT_decl_file   : 8
    <77f>   DW_AT_decl_line   : 1180
    <781>   DW_AT_decl_column : 6
    <782>   DW_AT_prototyped  : 1
    <782>   DW_AT_declaration : 1
 <1><782>: Abbrev Number: 45 (DW_TAG_subprogram)
    <783>   DW_AT_external    : 1
    <783>   DW_AT_name        : (indirect string, offset: 0xd17a): qsort
    <787>   DW_AT_decl_file   : 11
    <788>   DW_AT_decl_line   : 143
    <789>   DW_AT_decl_column : 6
    <78a>   DW_AT_prototyped  : 1
    <78a>   DW_AT_declaration : 1
    <78a>   DW_AT_sibling     : <0x7a3>
 <2><78e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <78f>   DW_AT_type        : <0xf6>
 <2><793>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <794>   DW_AT_type        : <0x31>
 <2><798>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <799>   DW_AT_type        : <0x31>
 <2><79d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e>   DW_AT_type        : <0x528>
 <2><7a2>: Abbrev Number: 0
 <1><7a3>: Abbrev Number: 21 (DW_TAG_subprogram)
    <7a4>   DW_AT_external    : 1
    <7a4>   DW_AT_name        : (indirect string, offset: 0x16e68): vTimerSetTimerID
    <7a8>   DW_AT_decl_file   : 9
    <7a9>   DW_AT_decl_line   : 407
    <7ab>   DW_AT_decl_column : 6
    <7ac>   DW_AT_prototyped  : 1
    <7ac>   DW_AT_declaration : 1
    <7ac>   DW_AT_sibling     : <0x7bb>
 <2><7b0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7b1>   DW_AT_type        : <0x367>
 <2><7b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7b6>   DW_AT_type        : <0xf6>
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7bc>   DW_AT_external    : 1
    <7bc>   DW_AT_name        : (indirect string, offset: 0x5ffc1): uxListRemove
    <7c0>   DW_AT_decl_file   : 7
    <7c1>   DW_AT_decl_line   : 405
    <7c3>   DW_AT_decl_column : 13
    <7c4>   DW_AT_prototyped  : 1
    <7c4>   DW_AT_type        : <0x11f>
    <7c8>   DW_AT_declaration : 1
    <7c8>   DW_AT_sibling     : <0x7d2>
 <2><7cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7cd>   DW_AT_type        : <0x23c>
 <2><7d1>: Abbrev Number: 0
 <1><7d2>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7d3>   DW_AT_external    : 1
    <7d3>   DW_AT_name        : (indirect string, offset: 0x549c5): vPortExitCritical
    <7d7>   DW_AT_decl_file   : 2
    <7d7>   DW_AT_decl_line   : 98
    <7d8>   DW_AT_decl_column : 13
    <7d8>   DW_AT_prototyped  : 1
    <7d8>   DW_AT_declaration : 1
 <1><7d8>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7d9>   DW_AT_external    : 1
    <7d9>   DW_AT_name        : (indirect string, offset: 0x8888d): vPortEnterCritical
    <7dd>   DW_AT_decl_file   : 2
    <7dd>   DW_AT_decl_line   : 97
    <7de>   DW_AT_decl_column : 13
    <7de>   DW_AT_prototyped  : 1
    <7de>   DW_AT_declaration : 1
 <1><7de>: Abbrev Number: 46 (DW_TAG_subprogram)
    <7df>   DW_AT_external    : 1
    <7df>   DW_AT_name        : pow
    <7e3>   DW_AT_decl_file   : 13
    <7e4>   DW_AT_decl_line   : 111
    <7e5>   DW_AT_decl_column : 15
    <7e6>   DW_AT_prototyped  : 1
    <7e6>   DW_AT_type        : <0x3a5>
    <7ea>   DW_AT_declaration : 1
    <7ea>   DW_AT_sibling     : <0x7f9>
 <2><7ee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ef>   DW_AT_type        : <0x3a5>
 <2><7f3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f4>   DW_AT_type        : <0x3a5>
 <2><7f8>: Abbrev Number: 0
 <1><7f9>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7fa>   DW_AT_external    : 1
    <7fa>   DW_AT_name        : (indirect string, offset: 0x44963): xTaskGenericNotify
    <7fe>   DW_AT_decl_file   : 8
    <7ff>   DW_AT_decl_line   : 1853
    <801>   DW_AT_decl_column : 12
    <802>   DW_AT_prototyped  : 1
    <802>   DW_AT_type        : <0x109>
    <806>   DW_AT_declaration : 1
    <806>   DW_AT_sibling     : <0x81f>
 <2><80a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <80b>   DW_AT_type        : <0x24d>
 <2><80f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <810>   DW_AT_type        : <0xc4>
 <2><814>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <815>   DW_AT_type        : <0x2c7>
 <2><819>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <81a>   DW_AT_type        : <0x81f>
 <2><81e>: Abbrev Number: 0
 <1><81f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <820>   DW_AT_byte_size   : 4
    <820>   DW_AT_type        : <0xc4>
 <1><824>: Abbrev Number: 9 (DW_TAG_const_type)
    <825>   DW_AT_type        : <0x81f>
 <1><829>: Abbrev Number: 14 (DW_TAG_subprogram)
    <82a>   DW_AT_external    : 1
    <82a>   DW_AT_name        : (indirect string, offset: 0x37441): xTaskNotifyWait
    <82e>   DW_AT_decl_file   : 8
    <82f>   DW_AT_decl_line   : 2021
    <831>   DW_AT_decl_column : 12
    <832>   DW_AT_prototyped  : 1
    <832>   DW_AT_type        : <0x109>
    <836>   DW_AT_declaration : 1
    <836>   DW_AT_sibling     : <0x84f>
 <2><83a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <83b>   DW_AT_type        : <0xc4>
 <2><83f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <840>   DW_AT_type        : <0xc4>
 <2><844>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <845>   DW_AT_type        : <0x81f>
 <2><849>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <84a>   DW_AT_type        : <0x135>
 <2><84e>: Abbrev Number: 0
 <1><84f>: Abbrev Number: 14 (DW_TAG_subprogram)
    <850>   DW_AT_external    : 1
    <850>   DW_AT_name        : (indirect string, offset: 0x316a0): uxTaskGetSystemState
    <854>   DW_AT_decl_file   : 8
    <855>   DW_AT_decl_line   : 1641
    <857>   DW_AT_decl_column : 13
    <858>   DW_AT_prototyped  : 1
    <858>   DW_AT_type        : <0x11f>
    <85c>   DW_AT_declaration : 1
    <85c>   DW_AT_sibling     : <0x870>
 <2><860>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <861>   DW_AT_type        : <0x875>
 <2><865>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <866>   DW_AT_type        : <0x130>
 <2><86a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86b>   DW_AT_type        : <0x824>
 <2><86f>: Abbrev Number: 0
 <1><870>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <871>   DW_AT_byte_size   : 4
    <871>   DW_AT_type        : <0x35b>
 <1><875>: Abbrev Number: 9 (DW_TAG_const_type)
    <876>   DW_AT_type        : <0x870>
 <1><87a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <87b>   DW_AT_external    : 1
    <87b>   DW_AT_name        : (indirect string, offset: 0x2832c): pvTimerGetTimerID
    <87f>   DW_AT_decl_file   : 9
    <880>   DW_AT_decl_line   : 386
    <882>   DW_AT_decl_column : 7
    <883>   DW_AT_prototyped  : 1
    <883>   DW_AT_type        : <0xf6>
    <887>   DW_AT_declaration : 1
    <887>   DW_AT_sibling     : <0x891>
 <2><88b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <88c>   DW_AT_type        : <0x373>
 <2><890>: Abbrev Number: 0
 <1><891>: Abbrev Number: 14 (DW_TAG_subprogram)
    <892>   DW_AT_external    : 1
    <892>   DW_AT_name        : (indirect string, offset: 0x6800e): pvTaskGetThreadLocalStoragePointer
    <896>   DW_AT_decl_file   : 8
    <897>   DW_AT_decl_line   : 1518
    <899>   DW_AT_decl_column : 8
    <89a>   DW_AT_prototyped  : 1
    <89a>   DW_AT_type        : <0xf6>
    <89e>   DW_AT_declaration : 1
    <89e>   DW_AT_sibling     : <0x8ad>
 <2><8a2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8a3>   DW_AT_type        : <0x24d>
 <2><8a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8a8>   DW_AT_type        : <0x109>
 <2><8ac>: Abbrev Number: 0
 <1><8ad>: Abbrev Number: 32 (DW_TAG_subprogram)
    <8ae>   DW_AT_external    : 1
    <8ae>   DW_AT_name        : (indirect string, offset: 0x660bc): xTaskGetCurrentTaskHandle
    <8b2>   DW_AT_decl_file   : 8
    <8b2>   DW_AT_decl_line   : 2438
    <8b4>   DW_AT_decl_column : 14
    <8b5>   DW_AT_prototyped  : 1
    <8b5>   DW_AT_type        : <0x24d>
    <8b9>   DW_AT_declaration : 1
 <1><8b9>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8ba>   DW_AT_external    : 1
    <8ba>   DW_AT_name        : (indirect string, offset: 0x8ccfb): ulTaskNotifyTake
    <8be>   DW_AT_decl_file   : 8
    <8bf>   DW_AT_decl_line   : 2191
    <8c1>   DW_AT_decl_column : 10
    <8c2>   DW_AT_prototyped  : 1
    <8c2>   DW_AT_type        : <0xc4>
    <8c6>   DW_AT_declaration : 1
    <8c6>   DW_AT_sibling     : <0x8d5>
 <2><8ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8cb>   DW_AT_type        : <0x109>
 <2><8cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8d0>   DW_AT_type        : <0x135>
 <2><8d4>: Abbrev Number: 0
 <1><8d5>: Abbrev Number: 33 (DW_TAG_subprogram)
    <8d6>   DW_AT_external    : 1
    <8d6>   DW_AT_name        : (indirect string, offset: 0x8f728): pvPortMalloc
    <8da>   DW_AT_decl_file   : 12
    <8db>   DW_AT_decl_line   : 163
    <8dc>   DW_AT_decl_column : 7
    <8dd>   DW_AT_prototyped  : 1
    <8dd>   DW_AT_type        : <0xf6>
    <8e1>   DW_AT_declaration : 1
    <8e1>   DW_AT_sibling     : <0x8eb>
 <2><8e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8e6>   DW_AT_type        : <0x31>
 <2><8ea>: Abbrev Number: 0
 <1><8eb>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8ec>   DW_AT_external    : 1
    <8ec>   DW_AT_name        : (indirect string, offset: 0x54dcc): vListInsertEnd
    <8f0>   DW_AT_decl_file   : 7
    <8f1>   DW_AT_decl_line   : 390
    <8f3>   DW_AT_decl_column : 6
    <8f4>   DW_AT_prototyped  : 1
    <8f4>   DW_AT_declaration : 1
    <8f4>   DW_AT_sibling     : <0x903>
 <2><8f8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8f9>   DW_AT_type        : <0x908>
 <2><8fd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8fe>   DW_AT_type        : <0x23c>
 <2><902>: Abbrev Number: 0
 <1><903>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <904>   DW_AT_byte_size   : 4
    <904>   DW_AT_type        : <0x241>
 <1><908>: Abbrev Number: 9 (DW_TAG_const_type)
    <909>   DW_AT_type        : <0x903>
 <1><90d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <90e>   DW_AT_external    : 1
    <90e>   DW_AT_name        : (indirect string, offset: 0x51328): vListInitialiseItem
    <912>   DW_AT_decl_file   : 7
    <913>   DW_AT_decl_line   : 356
    <915>   DW_AT_decl_column : 6
    <916>   DW_AT_prototyped  : 1
    <916>   DW_AT_declaration : 1
    <916>   DW_AT_sibling     : <0x920>
 <2><91a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91b>   DW_AT_type        : <0x23c>
 <2><91f>: Abbrev Number: 0
 <1><920>: Abbrev Number: 21 (DW_TAG_subprogram)
    <921>   DW_AT_external    : 1
    <921>   DW_AT_name        : (indirect string, offset: 0x53ac9): vListInitialise
    <925>   DW_AT_decl_file   : 7
    <926>   DW_AT_decl_line   : 345
    <928>   DW_AT_decl_column : 6
    <929>   DW_AT_prototyped  : 1
    <929>   DW_AT_declaration : 1
    <929>   DW_AT_sibling     : <0x933>
 <2><92d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92e>   DW_AT_type        : <0x908>
 <2><932>: Abbrev Number: 0
 <1><933>: Abbrev Number: 14 (DW_TAG_subprogram)
    <934>   DW_AT_external    : 1
    <934>   DW_AT_name        : (indirect string, offset: 0x7f25a): xTimerGenericCommand
    <938>   DW_AT_decl_file   : 9
    <939>   DW_AT_decl_line   : 1296
    <93b>   DW_AT_decl_column : 12
    <93c>   DW_AT_prototyped  : 1
    <93c>   DW_AT_type        : <0x109>
    <940>   DW_AT_declaration : 1
    <940>   DW_AT_sibling     : <0x95e>
 <2><944>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <945>   DW_AT_type        : <0x367>
 <2><949>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <94a>   DW_AT_type        : <0x11a>
 <2><94e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <94f>   DW_AT_type        : <0x141>
 <2><953>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <954>   DW_AT_type        : <0x963>
 <2><958>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <959>   DW_AT_type        : <0x141>
 <2><95d>: Abbrev Number: 0
 <1><95e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <95f>   DW_AT_byte_size   : 4
    <95f>   DW_AT_type        : <0x109>
 <1><963>: Abbrev Number: 9 (DW_TAG_const_type)
    <964>   DW_AT_type        : <0x95e>
 <1><968>: Abbrev Number: 32 (DW_TAG_subprogram)
    <969>   DW_AT_external    : 1
    <969>   DW_AT_name        : (indirect string, offset: 0x476d): xTaskGetTickCount
    <96d>   DW_AT_decl_file   : 8
    <96d>   DW_AT_decl_line   : 1356
    <96f>   DW_AT_decl_column : 12
    <970>   DW_AT_prototyped  : 1
    <970>   DW_AT_type        : <0x135>
    <974>   DW_AT_declaration : 1
 <1><974>: Abbrev Number: 33 (DW_TAG_subprogram)
    <975>   DW_AT_external    : 1
    <975>   DW_AT_name        : (indirect string, offset: 0x8a4e1): xTimerCreate
    <979>   DW_AT_decl_file   : 9
    <97a>   DW_AT_decl_line   : 228
    <97b>   DW_AT_decl_column : 16
    <97c>   DW_AT_prototyped  : 1
    <97c>   DW_AT_type        : <0x367>
    <980>   DW_AT_declaration : 1
    <980>   DW_AT_sibling     : <0x99e>
 <2><984>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <985>   DW_AT_type        : <0x157>
 <2><989>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <98a>   DW_AT_type        : <0x141>
 <2><98e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <98f>   DW_AT_type        : <0x130>
 <2><993>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <994>   DW_AT_type        : <0xf8>
 <2><998>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <999>   DW_AT_type        : <0x382>
 <2><99d>: Abbrev Number: 0
 <1><99e>: Abbrev Number: 21 (DW_TAG_subprogram)
    <99f>   DW_AT_external    : 1
    <99f>   DW_AT_name        : (indirect string, offset: 0x5b588): vTaskSetThreadLocalStoragePointer
    <9a3>   DW_AT_decl_file   : 8
    <9a4>   DW_AT_decl_line   : 1517
    <9a6>   DW_AT_decl_column : 7
    <9a7>   DW_AT_prototyped  : 1
    <9a7>   DW_AT_declaration : 1
    <9a7>   DW_AT_sibling     : <0x9bb>
 <2><9ab>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ac>   DW_AT_type        : <0x24d>
 <2><9b0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9b1>   DW_AT_type        : <0x109>
 <2><9b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9b6>   DW_AT_type        : <0xf6>
 <2><9ba>: Abbrev Number: 0
 <1><9bb>: Abbrev Number: 14 (DW_TAG_subprogram)
    <9bc>   DW_AT_external    : 1
    <9bc>   DW_AT_name        : (indirect string, offset: 0x6bf1d): xTaskCreate
    <9c0>   DW_AT_decl_file   : 8
    <9c1>   DW_AT_decl_line   : 330
    <9c3>   DW_AT_decl_column : 13
    <9c4>   DW_AT_prototyped  : 1
    <9c4>   DW_AT_type        : <0x109>
    <9c8>   DW_AT_declaration : 1
    <9c8>   DW_AT_sibling     : <0x9eb>
 <2><9cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9cd>   DW_AT_type        : <0xda>
 <2><9d1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9d2>   DW_AT_type        : <0x157>
 <2><9d6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9d7>   DW_AT_type        : <0xb3>
 <2><9db>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9dc>   DW_AT_type        : <0xf8>
 <2><9e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9e1>   DW_AT_type        : <0x11f>
 <2><9e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9e6>   DW_AT_type        : <0x734>
 <2><9ea>: Abbrev Number: 0
 <1><9eb>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x5b40b): prvMSTDispatch
    <9f0>   DW_AT_decl_file   : 1
    <9f0>   DW_AT_decl_line   : 1029
    <9f2>   DW_AT_decl_column : 13
    <9f2>   DW_AT_prototyped  : 1
    <9f2>   DW_AT_low_pc      : 0x8001b58
    <9f6>   DW_AT_high_pc     : 0xa4
    <9fa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9fc>   DW_AT_call_all_tail_calls: 1
    <9fc>   DW_AT_sibling     : <0xa8c>
 <2><a00>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a01>   DW_AT_name        : (indirect string, offset: 0x312f9): forTask
    <a05>   DW_AT_decl_file   : 1
    <a05>   DW_AT_decl_line   : 1029
    <a07>   DW_AT_decl_column : 42
    <a08>   DW_AT_type        : <0x72f>
    <a0c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a0f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a10>   DW_AT_name        : (indirect string, offset: 0x20b03): xAsCallee
    <a14>   DW_AT_decl_file   : 1
    <a14>   DW_AT_decl_line   : 1029
    <a16>   DW_AT_decl_column : 62
    <a17>   DW_AT_type        : <0x109>
    <a1b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><a1e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x8d31b): xOfTaskType
    <a23>   DW_AT_decl_file   : 1
    <a23>   DW_AT_decl_line   : 1030
    <a25>   DW_AT_decl_column : 14
    <a26>   DW_AT_type        : <0x572>
    <a2a>   DW_AT_location    : 2 byte block: 91 5f 	(DW_OP_fbreg: -33)
 <2><a2d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x8a0f2): xFromUserRequest
    <a32>   DW_AT_decl_file   : 1
    <a32>   DW_AT_decl_line   : 1030
    <a34>   DW_AT_decl_column : 38
    <a35>   DW_AT_type        : <0x109>
    <a39>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><a3c>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <a3d>   DW_AT_low_pc      : 0x8001b6e
    <a41>   DW_AT_high_pc     : 0x80
 <3><a45>: Abbrev Number: 3 (DW_TAG_variable)
    <a46>   DW_AT_name        : (indirect string, offset: 0x140cc): xCurrExtTCB
    <a4a>   DW_AT_decl_file   : 1
    <a4a>   DW_AT_decl_line   : 1036
    <a4c>   DW_AT_decl_column : 13
    <a4d>   DW_AT_type        : <0xa8c>
    <a51>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a54>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <a55>   DW_AT_abstract_origin: <0x138b>
    <a59>   DW_AT_low_pc      : 0x8001bae
    <a5d>   DW_AT_high_pc     : 0x14
    <a61>   DW_AT_call_file   : 1
    <a61>   DW_AT_call_line   : 1072
    <a63>   DW_AT_call_column : 4
    <a64>   DW_AT_sibling     : <0xa71>
 <4><a68>: Abbrev Number: 8 (DW_TAG_variable)
    <a69>   DW_AT_abstract_origin: <0x1394>
    <a6d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <4><a70>: Abbrev Number: 0
 <3><a71>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <a72>   DW_AT_abstract_origin: <0x138b>
    <a76>   DW_AT_low_pc      : 0x8001bd6
    <a7a>   DW_AT_high_pc     : 0x14
    <a7e>   DW_AT_call_file   : 1
    <a7e>   DW_AT_call_line   : 1085
    <a80>   DW_AT_call_column : 4
 <4><a81>: Abbrev Number: 8 (DW_TAG_variable)
    <a82>   DW_AT_abstract_origin: <0x1394>
    <a86>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><a89>: Abbrev Number: 0
 <3><a8a>: Abbrev Number: 0
 <2><a8b>: Abbrev Number: 0
 <1><a8c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a8d>   DW_AT_byte_size   : 4
    <a8d>   DW_AT_type        : <0x739>
 <1><a91>: Abbrev Number: 47 (DW_TAG_subprogram)
    <a92>   DW_AT_external    : 1
    <a92>   DW_AT_name        : (indirect string, offset: 0x86736): vMSTSchedulerStart
    <a96>   DW_AT_decl_file   : 1
    <a97>   DW_AT_decl_line   : 887
    <a99>   DW_AT_decl_column : 6
    <a9a>   DW_AT_prototyped  : 1
    <a9a>   DW_AT_low_pc      : 0x8001ae0
    <a9e>   DW_AT_high_pc     : 0x78
    <aa2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aa4>   DW_AT_call_all_tail_calls: 1
    <aa4>   DW_AT_sibling     : <0xae0>
 <2><aa8>: Abbrev Number: 3 (DW_TAG_variable)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x423ce): tSS_Period
    <aad>   DW_AT_decl_file   : 1
    <aad>   DW_AT_decl_line   : 902
    <aaf>   DW_AT_decl_column : 13
    <ab0>   DW_AT_type        : <0x135>
    <ab4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ab7>: Abbrev Number: 3 (DW_TAG_variable)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x3091d): tSS_WCET
    <abc>   DW_AT_decl_file   : 1
    <abc>   DW_AT_decl_line   : 903
    <abe>   DW_AT_decl_column : 13
    <abf>   DW_AT_type        : <0x135>
    <ac3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ac6>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <ac7>   DW_AT_abstract_origin: <0x138b>
    <acb>   DW_AT_low_pc      : 0x8001b26
    <acf>   DW_AT_high_pc     : 0x14
    <ad3>   DW_AT_call_file   : 1
    <ad3>   DW_AT_call_line   : 912
    <ad5>   DW_AT_call_column : 2
 <3><ad6>: Abbrev Number: 8 (DW_TAG_variable)
    <ad7>   DW_AT_abstract_origin: <0x1394>
    <adb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><ade>: Abbrev Number: 0
 <2><adf>: Abbrev Number: 0
 <1><ae0>: Abbrev Number: 48 (DW_TAG_subprogram)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x20fac): prvComputeOrderedPriorities
    <ae5>   DW_AT_decl_file   : 1
    <ae6>   DW_AT_decl_line   : 817
    <ae8>   DW_AT_decl_column : 19
    <ae9>   DW_AT_type        : <0x109>
    <aed>   DW_AT_low_pc      : 0x800195c
    <af1>   DW_AT_high_pc     : 0x184
    <af5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <af7>   DW_AT_call_all_tail_calls: 1
    <af7>   DW_AT_sibling     : <0xc28>
 <2><afb>: Abbrev Number: 3 (DW_TAG_variable)
    <afc>   DW_AT_name        : (indirect string, offset: 0x3742f): initialEvaluation
    <b00>   DW_AT_decl_file   : 1
    <b00>   DW_AT_decl_line   : 818
    <b02>   DW_AT_decl_column : 20
    <b03>   DW_AT_type        : <0x109>
    <b07>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><b0d>: Abbrev Number: 3 (DW_TAG_variable)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x35bcf): listArray
    <b12>   DW_AT_decl_file   : 1
    <b12>   DW_AT_decl_line   : 819
    <b14>   DW_AT_decl_column : 12
    <b15>   DW_AT_type        : <0xc28>
    <b19>   DW_AT_location    : 3 byte block: 91 50 6 	(DW_OP_fbreg: -48; DW_OP_deref)
 <2><b1d>: Abbrev Number: 3 (DW_TAG_variable)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x73df2): xItm
    <b22>   DW_AT_decl_file   : 1
    <b22>   DW_AT_decl_line   : 822
    <b24>   DW_AT_decl_column : 14
    <b25>   DW_AT_type        : <0x237>
    <b29>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b2c>: Abbrev Number: 3 (DW_TAG_variable)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x6e2b3): uxUsedPriority
    <b31>   DW_AT_decl_file   : 1
    <b31>   DW_AT_decl_line   : 845
    <b33>   DW_AT_decl_column : 14
    <b34>   DW_AT_type        : <0x11f>
    <b38>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b3b>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <b3c>   DW_AT_low_pc      : 0x80019be
    <b40>   DW_AT_high_pc     : 0x4a
    <b44>   DW_AT_sibling     : <0xb8a>
 <3><b48>: Abbrev Number: 19 (DW_TAG_variable)
    <b49>   DW_AT_name        : i
    <b4b>   DW_AT_decl_file   : 1
    <b4b>   DW_AT_decl_line   : 823
    <b4d>   DW_AT_decl_column : 11
    <b4e>   DW_AT_type        : <0x2a>
    <b52>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><b55>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <b56>   DW_AT_low_pc      : 0x80019c4
    <b5a>   DW_AT_high_pc     : 0x34
 <4><b5e>: Abbrev Number: 3 (DW_TAG_variable)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x7ecc9): xTCB
    <b63>   DW_AT_decl_file   : 1
    <b63>   DW_AT_decl_line   : 824
    <b65>   DW_AT_decl_column : 13
    <b66>   DW_AT_type        : <0xa8c>
    <b6a>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <4><b6e>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <b6f>   DW_AT_abstract_origin: <0x138b>
    <b73>   DW_AT_low_pc      : 0x80019d0
    <b77>   DW_AT_high_pc     : 0x14
    <b7b>   DW_AT_call_file   : 1
    <b7b>   DW_AT_call_line   : 826
    <b7d>   DW_AT_call_column : 3
 <5><b7e>: Abbrev Number: 8 (DW_TAG_variable)
    <b7f>   DW_AT_abstract_origin: <0x1394>
    <b83>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <5><b87>: Abbrev Number: 0
 <4><b88>: Abbrev Number: 0
 <3><b89>: Abbrev Number: 0
 <2><b8a>: Abbrev Number: 49 (DW_TAG_lexical_block)
    <b8b>   DW_AT_ranges      : 0xc
    <b8f>   DW_AT_sibling     : <0xbe5>
 <3><b93>: Abbrev Number: 3 (DW_TAG_variable)
    <b94>   DW_AT_name        : (indirect string, offset: 0x68e3): xCurrInx
    <b98>   DW_AT_decl_file   : 1
    <b98>   DW_AT_decl_line   : 847
    <b9a>   DW_AT_decl_column : 19
    <b9b>   DW_AT_type        : <0x11f>
    <b9f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><ba2>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <ba3>   DW_AT_low_pc      : 0x8001a34
    <ba7>   DW_AT_high_pc     : 0x3c
 <4><bab>: Abbrev Number: 3 (DW_TAG_variable)
    <bac>   DW_AT_name        : (indirect string, offset: 0x4b7d0): xTCB_Reference
    <bb0>   DW_AT_decl_file   : 1
    <bb0>   DW_AT_decl_line   : 848
    <bb2>   DW_AT_decl_column : 13
    <bb3>   DW_AT_type        : <0xa8c>
    <bb7>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><bba>: Abbrev Number: 3 (DW_TAG_variable)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x36f69): bNewPriority
    <bbf>   DW_AT_decl_file   : 1
    <bbf>   DW_AT_decl_line   : 849
    <bc1>   DW_AT_decl_column : 15
    <bc2>   DW_AT_type        : <0x11f>
    <bc6>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><bc9>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <bca>   DW_AT_abstract_origin: <0x138b>
    <bce>   DW_AT_low_pc      : 0x8001a58
    <bd2>   DW_AT_high_pc     : 0x14
    <bd6>   DW_AT_call_file   : 1
    <bd6>   DW_AT_call_line   : 857
    <bd8>   DW_AT_call_column : 3
 <5><bd9>: Abbrev Number: 8 (DW_TAG_variable)
    <bda>   DW_AT_abstract_origin: <0x1394>
    <bde>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <5><be2>: Abbrev Number: 0
 <4><be3>: Abbrev Number: 0
 <3><be4>: Abbrev Number: 0
 <2><be5>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <be6>   DW_AT_low_pc      : 0x8001a84
    <bea>   DW_AT_high_pc     : 0x30
 <3><bee>: Abbrev Number: 3 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0x7b992): pxItem
    <bf3>   DW_AT_decl_file   : 1
    <bf3>   DW_AT_decl_line   : 874
    <bf5>   DW_AT_decl_column : 15
    <bf6>   DW_AT_type        : <0x237>
    <bfa>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><bfd>: Abbrev Number: 3 (DW_TAG_variable)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x7ecc9): xTCB
    <c02>   DW_AT_decl_file   : 1
    <c02>   DW_AT_decl_line   : 875
    <c04>   DW_AT_decl_column : 13
    <c05>   DW_AT_type        : <0xa8c>
    <c09>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <3><c0c>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <c0d>   DW_AT_abstract_origin: <0x138b>
    <c11>   DW_AT_low_pc      : 0x8001a96
    <c15>   DW_AT_high_pc     : 0x14
    <c19>   DW_AT_call_file   : 1
    <c19>   DW_AT_call_line   : 876
    <c1b>   DW_AT_call_column : 3
 <4><c1c>: Abbrev Number: 8 (DW_TAG_variable)
    <c1d>   DW_AT_abstract_origin: <0x1394>
    <c21>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <4><c25>: Abbrev Number: 0
 <3><c26>: Abbrev Number: 0
 <2><c27>: Abbrev Number: 0
 <1><c28>: Abbrev Number: 27 (DW_TAG_array_type)
    <c29>   DW_AT_type        : <0xa8c>
    <c2d>   DW_AT_sibling     : <0xc3b>
 <2><c31>: Abbrev Number: 50 (DW_TAG_subrange_type)
    <c32>   DW_AT_type        : <0x3d>
    <c36>   DW_AT_upper_bound : 3 byte block: 91 54 6 	(DW_OP_fbreg: -44; DW_OP_deref)
 <2><c3a>: Abbrev Number: 0
 <1><c3b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x33858): prvMSTSporadicServerJob
    <c40>   DW_AT_decl_file   : 1
    <c40>   DW_AT_decl_line   : 723
    <c42>   DW_AT_decl_column : 13
    <c42>   DW_AT_prototyped  : 1
    <c42>   DW_AT_low_pc      : 0x8001794
    <c46>   DW_AT_high_pc     : 0x1c8
    <c4a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c4c>   DW_AT_call_all_tail_calls: 1
    <c4c>   DW_AT_sibling     : <0xd84>
 <2><c50>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c51>   DW_AT_name        : (indirect string, offset: 0x6bf7): pvParameters
    <c55>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 723
    <c57>   DW_AT_decl_column : 43
    <c58>   DW_AT_type        : <0xf6>
    <c5c>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><c60>: Abbrev Number: 3 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0x56775): xCurrentHandle
    <c65>   DW_AT_decl_file   : 1
    <c65>   DW_AT_decl_line   : 725
    <c67>   DW_AT_decl_column : 15
    <c68>   DW_AT_type        : <0x24d>
    <c6c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c6f>: Abbrev Number: 3 (DW_TAG_variable)
    <c70>   DW_AT_name        : (indirect string, offset: 0x140cc): xCurrExtTCB
    <c74>   DW_AT_decl_file   : 1
    <c74>   DW_AT_decl_line   : 726
    <c76>   DW_AT_decl_column : 12
    <c77>   DW_AT_type        : <0xa8c>
    <c7b>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c7e>: Abbrev Number: 3 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x8058d): xReplenishmentTimer
    <c83>   DW_AT_decl_file   : 1
    <c83>   DW_AT_decl_line   : 731
    <c85>   DW_AT_decl_column : 16
    <c86>   DW_AT_type        : <0x367>
    <c8a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c8d>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <c8e>   DW_AT_low_pc      : 0x80017ea
    <c92>   DW_AT_high_pc     : 0x158
    <c96>   DW_AT_sibling     : <0xd6a>
 <3><c9a>: Abbrev Number: 3 (DW_TAG_variable)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x73df2): xItm
    <c9f>   DW_AT_decl_file   : 1
    <c9f>   DW_AT_decl_line   : 748
    <ca1>   DW_AT_decl_column : 15
    <ca2>   DW_AT_type        : <0x237>
    <ca6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><ca9>: Abbrev Number: 3 (DW_TAG_variable)
    <caa>   DW_AT_name        : (indirect string, offset: 0x7ecc9): xTCB
    <cae>   DW_AT_decl_file   : 1
    <cae>   DW_AT_decl_line   : 749
    <cb0>   DW_AT_decl_column : 13
    <cb1>   DW_AT_type        : <0xa8c>
    <cb5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><cb8>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <cb9>   DW_AT_low_pc      : 0x80017ea
    <cbd>   DW_AT_high_pc     : 0x14
    <cc1>   DW_AT_sibling     : <0xcd5>
 <4><cc5>: Abbrev Number: 3 (DW_TAG_variable)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x6ce33): ulNotifyVal
    <cca>   DW_AT_decl_file   : 1
    <cca>   DW_AT_decl_line   : 740
    <ccc>   DW_AT_decl_column : 13
    <ccd>   DW_AT_type        : <0xc4>
    <cd1>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <4><cd4>: Abbrev Number: 0
 <3><cd5>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <cd6>   DW_AT_low_pc      : 0x8001822
    <cda>   DW_AT_high_pc     : 0x120
 <4><cde>: Abbrev Number: 3 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x2d04d): notificationGiver
    <ce3>   DW_AT_decl_file   : 1
    <ce3>   DW_AT_decl_line   : 758
    <ce5>   DW_AT_decl_column : 13
    <ce6>   DW_AT_type        : <0xc4>
    <cea>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><ced>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <cee>   DW_AT_low_pc      : 0x80018b4
    <cf2>   DW_AT_high_pc     : 0x8a
    <cf6>   DW_AT_sibling     : <0xd4f>
 <5><cfa>: Abbrev Number: 3 (DW_TAG_variable)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x1ccff): xNewPeriod
    <cff>   DW_AT_decl_file   : 1
    <cff>   DW_AT_decl_line   : 791
    <d01>   DW_AT_decl_column : 18
    <d02>   DW_AT_type        : <0x135>
    <d06>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <5><d09>: Abbrev Number: 3 (DW_TAG_variable)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x79e30): xResult
    <d0e>   DW_AT_decl_file   : 1
    <d0e>   DW_AT_decl_line   : 793
    <d10>   DW_AT_decl_column : 18
    <d11>   DW_AT_type        : <0x109>
    <d15>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <5><d18>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <d19>   DW_AT_abstract_origin: <0x138b>
    <d1d>   DW_AT_low_pc      : 0x80018f4
    <d21>   DW_AT_high_pc     : 0x14
    <d25>   DW_AT_call_file   : 1
    <d25>   DW_AT_call_line   : 795
    <d27>   DW_AT_call_column : 7
    <d28>   DW_AT_sibling     : <0xd35>
 <6><d2c>: Abbrev Number: 8 (DW_TAG_variable)
    <d2d>   DW_AT_abstract_origin: <0x1394>
    <d31>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <6><d34>: Abbrev Number: 0
 <5><d35>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <d36>   DW_AT_abstract_origin: <0x138b>
    <d3a>   DW_AT_low_pc      : 0x8001926
    <d3e>   DW_AT_high_pc     : 0x14
    <d42>   DW_AT_call_file   : 1
    <d42>   DW_AT_call_line   : 796
    <d44>   DW_AT_call_column : 7
 <6><d45>: Abbrev Number: 8 (DW_TAG_variable)
    <d46>   DW_AT_abstract_origin: <0x1394>
    <d4a>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <6><d4d>: Abbrev Number: 0
 <5><d4e>: Abbrev Number: 0
 <4><d4f>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <d50>   DW_AT_abstract_origin: <0x138b>
    <d54>   DW_AT_low_pc      : 0x800189c
    <d58>   DW_AT_high_pc     : 0x14
    <d5c>   DW_AT_call_file   : 1
    <d5c>   DW_AT_call_line   : 787
    <d5e>   DW_AT_call_column : 7
 <5><d5f>: Abbrev Number: 8 (DW_TAG_variable)
    <d60>   DW_AT_abstract_origin: <0x1394>
    <d64>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <5><d67>: Abbrev Number: 0
 <4><d68>: Abbrev Number: 0
 <3><d69>: Abbrev Number: 0
 <2><d6a>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <d6b>   DW_AT_abstract_origin: <0x138b>
    <d6f>   DW_AT_low_pc      : 0x80017b2
    <d73>   DW_AT_high_pc     : 0x14
    <d77>   DW_AT_call_file   : 1
    <d77>   DW_AT_call_line   : 728
    <d79>   DW_AT_call_column : 2
 <3><d7a>: Abbrev Number: 8 (DW_TAG_variable)
    <d7b>   DW_AT_abstract_origin: <0x1394>
    <d7f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><d82>: Abbrev Number: 0
 <2><d83>: Abbrev Number: 0
 <1><d84>: Abbrev Number: 16 (DW_TAG_subprogram)
    <d85>   DW_AT_name        : (indirect string, offset: 0x55474): prvMSTGenericReplenishmentTimerCallback
    <d89>   DW_AT_decl_file   : 1
    <d89>   DW_AT_decl_line   : 711
    <d8b>   DW_AT_decl_column : 13
    <d8b>   DW_AT_prototyped  : 1
    <d8b>   DW_AT_low_pc      : 0x8001750
    <d8f>   DW_AT_high_pc     : 0x44
    <d93>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d95>   DW_AT_call_all_tail_calls: 1
    <d95>   DW_AT_sibling     : <0xdb8>
 <2><d99>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x9877a): xTimer
    <d9e>   DW_AT_decl_file   : 1
    <d9e>   DW_AT_decl_line   : 711
    <da0>   DW_AT_decl_column : 67
    <da1>   DW_AT_type        : <0x367>
    <da5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><da8>: Abbrev Number: 3 (DW_TAG_variable)
    <da9>   DW_AT_name        : (indirect string, offset: 0x7f526): param
    <dad>   DW_AT_decl_file   : 1
    <dad>   DW_AT_decl_line   : 716
    <daf>   DW_AT_decl_column : 13
    <db0>   DW_AT_type        : <0x109>
    <db4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><db7>: Abbrev Number: 0
 <1><db8>: Abbrev Number: 34 (DW_TAG_subprogram)
    <db9>   DW_AT_name        : (indirect string, offset: 0x25add): prvAsmissionControlSporadicServer
    <dbd>   DW_AT_decl_file   : 1
    <dbd>   DW_AT_decl_line   : 677
    <dbf>   DW_AT_decl_column : 19
    <dc0>   DW_AT_prototyped  : 1
    <dc0>   DW_AT_type        : <0x109>
    <dc4>   DW_AT_low_pc      : 0
    <dc8>   DW_AT_high_pc     : 0x1a
    <dcc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dce>   DW_AT_call_all_calls: 1
    <dce>   DW_AT_sibling     : <0xde2>
 <2><dd2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x422a3): forTCB
    <dd7>   DW_AT_decl_file   : 1
    <dd7>   DW_AT_decl_line   : 677
    <dd9>   DW_AT_decl_column : 62
    <dda>   DW_AT_type        : <0x739>
    <dde>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><de1>: Abbrev Number: 0
 <1><de2>: Abbrev Number: 16 (DW_TAG_subprogram)
    <de3>   DW_AT_name        : (indirect string, offset: 0x72d4c): prvComputeSporadicServerProprierties
    <de7>   DW_AT_decl_file   : 1
    <de7>   DW_AT_decl_line   : 609
    <de9>   DW_AT_decl_column : 13
    <de9>   DW_AT_prototyped  : 1
    <de9>   DW_AT_low_pc      : 0x8001540
    <ded>   DW_AT_high_pc     : 0x210
    <df1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <df3>   DW_AT_call_all_tail_calls: 1
    <df3>   DW_AT_sibling     : <0xf40>
 <2><df7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <df8>   DW_AT_name        : (indirect string, offset: 0x423ce): tSS_Period
    <dfc>   DW_AT_decl_file   : 1
    <dfc>   DW_AT_decl_line   : 609
    <dfe>   DW_AT_decl_column : 62
    <dff>   DW_AT_type        : <0xf40>
    <e03>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><e07>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <e08>   DW_AT_name        : (indirect string, offset: 0x3091d): tSS_WCET
    <e0c>   DW_AT_decl_file   : 1
    <e0c>   DW_AT_decl_line   : 610
    <e0e>   DW_AT_decl_column : 15
    <e0f>   DW_AT_type        : <0xf40>
    <e13>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><e17>: Abbrev Number: 19 (DW_TAG_variable)
    <e18>   DW_AT_name        : m
    <e1a>   DW_AT_decl_file   : 1
    <e1a>   DW_AT_decl_line   : 637
    <e1c>   DW_AT_decl_column : 8
    <e1d>   DW_AT_type        : <0x39e>
    <e21>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><e24>: Abbrev Number: 19 (DW_TAG_variable)
    <e25>   DW_AT_name        : U
    <e27>   DW_AT_decl_file   : 1
    <e27>   DW_AT_decl_line   : 638
    <e29>   DW_AT_decl_column : 8
    <e2a>   DW_AT_type        : <0x39e>
    <e2e>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><e31>: Abbrev Number: 3 (DW_TAG_variable)
    <e32>   DW_AT_name        : (indirect string, offset: 0xa9e0): min_css
    <e36>   DW_AT_decl_file   : 1
    <e36>   DW_AT_decl_line   : 639
    <e38>   DW_AT_decl_column : 13
    <e39>   DW_AT_type        : <0x135>
    <e3d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e40>: Abbrev Number: 3 (DW_TAG_variable)
    <e41>   DW_AT_name        : (indirect string, offset: 0x30b9f): max_css
    <e45>   DW_AT_decl_file   : 1
    <e45>   DW_AT_decl_line   : 640
    <e47>   DW_AT_decl_column : 13
    <e48>   DW_AT_type        : <0x135>
    <e4c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e4f>: Abbrev Number: 3 (DW_TAG_variable)
    <e50>   DW_AT_name        : (indirect string, offset: 0x17850): sum_up
    <e54>   DW_AT_decl_file   : 1
    <e54>   DW_AT_decl_line   : 641
    <e56>   DW_AT_decl_column : 8
    <e57>   DW_AT_type        : <0x39e>
    <e5b>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><e5e>: Abbrev Number: 3 (DW_TAG_variable)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x73df2): xItm
    <e63>   DW_AT_decl_file   : 1
    <e63>   DW_AT_decl_line   : 642
    <e65>   DW_AT_decl_column : 14
    <e66>   DW_AT_type        : <0x237>
    <e6a>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><e6d>: Abbrev Number: 19 (DW_TAG_variable)
    <e6e>   DW_AT_name        : Css
    <e72>   DW_AT_decl_file   : 1
    <e72>   DW_AT_decl_line   : 656
    <e74>   DW_AT_decl_column : 8
    <e75>   DW_AT_type        : <0x39e>
    <e79>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><e7c>: Abbrev Number: 19 (DW_TAG_variable)
    <e7d>   DW_AT_name        : Uss
    <e81>   DW_AT_decl_file   : 1
    <e81>   DW_AT_decl_line   : 657
    <e83>   DW_AT_decl_column : 8
    <e84>   DW_AT_type        : <0x39e>
    <e88>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><e8b>: Abbrev Number: 19 (DW_TAG_variable)
    <e8c>   DW_AT_name        : Tss
    <e90>   DW_AT_decl_file   : 1
    <e90>   DW_AT_decl_line   : 658
    <e92>   DW_AT_decl_column : 13
    <e93>   DW_AT_type        : <0x135>
    <e97>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><e9a>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <e9b>   DW_AT_low_pc      : 0x80015d0
    <e9f>   DW_AT_high_pc     : 0xa2
    <ea3>   DW_AT_sibling     : <0xf25>
 <3><ea7>: Abbrev Number: 19 (DW_TAG_variable)
    <ea8>   DW_AT_name        : i
    <eaa>   DW_AT_decl_file   : 1
    <eaa>   DW_AT_decl_line   : 643
    <eac>   DW_AT_decl_column : 11
    <ead>   DW_AT_type        : <0x2a>
    <eb1>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><eb4>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <eb5>   DW_AT_low_pc      : 0x80015d6
    <eb9>   DW_AT_high_pc     : 0x8c
 <4><ebd>: Abbrev Number: 3 (DW_TAG_variable)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x7ecc9): xTCB
    <ec2>   DW_AT_decl_file   : 1
    <ec2>   DW_AT_decl_line   : 644
    <ec4>   DW_AT_decl_column : 13
    <ec5>   DW_AT_type        : <0xa8c>
    <ec9>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><ecc>: Abbrev Number: 3 (DW_TAG_variable)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x6b972): t_wcet
    <ed1>   DW_AT_decl_file   : 1
    <ed1>   DW_AT_decl_line   : 646
    <ed3>   DW_AT_decl_column : 14
    <ed4>   DW_AT_type        : <0x135>
    <ed8>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><edb>: Abbrev Number: 3 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0x44bef): t_per
    <ee0>   DW_AT_decl_file   : 1
    <ee0>   DW_AT_decl_line   : 647
    <ee2>   DW_AT_decl_column : 14
    <ee3>   DW_AT_type        : <0x135>
    <ee7>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <4><eeb>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <eec>   DW_AT_abstract_origin: <0x138b>
    <ef0>   DW_AT_low_pc      : 0x80015e2
    <ef4>   DW_AT_high_pc     : 0x14
    <ef8>   DW_AT_call_file   : 1
    <ef8>   DW_AT_call_line   : 645
    <efa>   DW_AT_call_column : 3
    <efb>   DW_AT_sibling     : <0xf09>
 <5><eff>: Abbrev Number: 8 (DW_TAG_variable)
    <f00>   DW_AT_abstract_origin: <0x1394>
    <f04>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <5><f08>: Abbrev Number: 0
 <4><f09>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <f0a>   DW_AT_abstract_origin: <0x138b>
    <f0e>   DW_AT_low_pc      : 0x8001620
    <f12>   DW_AT_high_pc     : 0x14
    <f16>   DW_AT_call_file   : 1
    <f16>   DW_AT_call_line   : 652
    <f18>   DW_AT_call_column : 3
 <5><f19>: Abbrev Number: 8 (DW_TAG_variable)
    <f1a>   DW_AT_abstract_origin: <0x1394>
    <f1e>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <5><f22>: Abbrev Number: 0
 <4><f23>: Abbrev Number: 0
 <3><f24>: Abbrev Number: 0
 <2><f25>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <f26>   DW_AT_abstract_origin: <0x138b>
    <f2a>   DW_AT_low_pc      : 0x80016b4
    <f2e>   DW_AT_high_pc     : 0x14
    <f32>   DW_AT_call_file   : 1
    <f32>   DW_AT_call_line   : 660
    <f34>   DW_AT_call_column : 3
 <3><f35>: Abbrev Number: 8 (DW_TAG_variable)
    <f36>   DW_AT_abstract_origin: <0x1394>
    <f3a>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><f3e>: Abbrev Number: 0
 <2><f3f>: Abbrev Number: 0
 <1><f40>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f41>   DW_AT_byte_size   : 4
    <f41>   DW_AT_type        : <0x135>
 <1><f45>: Abbrev Number: 34 (DW_TAG_subprogram)
    <f46>   DW_AT_name        : (indirect string, offset: 0x2daeb): prv_compare
    <f4a>   DW_AT_decl_file   : 1
    <f4a>   DW_AT_decl_line   : 588
    <f4c>   DW_AT_decl_column : 12
    <f4d>   DW_AT_prototyped  : 1
    <f4d>   DW_AT_type        : <0x2a>
    <f51>   DW_AT_low_pc      : 0x80014fa
    <f55>   DW_AT_high_pc     : 0x46
    <f59>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f5b>   DW_AT_call_all_calls: 1
    <f5b>   DW_AT_sibling     : <0xf9c>
 <2><f5f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f60>   DW_AT_name        : (indirect string, offset: 0x1e343): arg1
    <f64>   DW_AT_decl_file   : 1
    <f64>   DW_AT_decl_line   : 588
    <f66>   DW_AT_decl_column : 36
    <f67>   DW_AT_type        : <0x54d>
    <f6b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f6e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x1e348): arg2
    <f73>   DW_AT_decl_file   : 1
    <f73>   DW_AT_decl_line   : 588
    <f75>   DW_AT_decl_column : 54
    <f76>   DW_AT_type        : <0x54d>
    <f7a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f7d>: Abbrev Number: 3 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x8be3b): itm1
    <f82>   DW_AT_decl_file   : 1
    <f82>   DW_AT_decl_line   : 589
    <f84>   DW_AT_decl_column : 12
    <f85>   DW_AT_type        : <0xa8c>
    <f89>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f8c>: Abbrev Number: 3 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x8be40): itm2
    <f91>   DW_AT_decl_file   : 1
    <f91>   DW_AT_decl_line   : 590
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xa8c>
    <f98>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f9b>: Abbrev Number: 0
 <1><f9c>: Abbrev Number: 35 (DW_TAG_subprogram)
    <f9d>   DW_AT_external    : 1
    <f9d>   DW_AT_name        : (indirect string, offset: 0x8438a): vMSTSporadicTaskRun
    <fa1>   DW_AT_decl_file   : 1
    <fa1>   DW_AT_decl_line   : 572
    <fa3>   DW_AT_decl_column : 12
    <fa3>   DW_AT_prototyped  : 1
    <fa3>   DW_AT_type        : <0x109>
    <fa7>   DW_AT_low_pc      : 0x80014c4
    <fab>   DW_AT_high_pc     : 0x36
    <faf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fb1>   DW_AT_call_all_tail_calls: 1
    <fb1>   DW_AT_sibling     : <0xfd4>
 <2><fb5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x77556): pxTaskToRunHandle
    <fba>   DW_AT_decl_file   : 1
    <fba>   DW_AT_decl_line   : 572
    <fbc>   DW_AT_decl_column : 46
    <fbd>   DW_AT_type        : <0x72f>
    <fc1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><fc4>: Abbrev Number: 3 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x140cc): xCurrExtTCB
    <fc9>   DW_AT_decl_file   : 1
    <fc9>   DW_AT_decl_line   : 576
    <fcb>   DW_AT_decl_column : 12
    <fcc>   DW_AT_type        : <0xa8c>
    <fd0>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 16 (DW_TAG_subprogram)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x8631): prvMSTSporadicGenericJob
    <fd9>   DW_AT_decl_file   : 1
    <fd9>   DW_AT_decl_line   : 478
    <fdb>   DW_AT_decl_column : 13
    <fdb>   DW_AT_prototyped  : 1
    <fdb>   DW_AT_low_pc      : 0x800141c
    <fdf>   DW_AT_high_pc     : 0xa8
    <fe3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe5>   DW_AT_call_all_tail_calls: 1
    <fe5>   DW_AT_sibling     : <0x105c>
 <2><fe9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fea>   DW_AT_name        : (indirect string, offset: 0x6bf7): pvParameters
    <fee>   DW_AT_decl_file   : 1
    <fee>   DW_AT_decl_line   : 478
    <ff0>   DW_AT_decl_column : 44
    <ff1>   DW_AT_type        : <0xf6>
    <ff5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><ff8>: Abbrev Number: 3 (DW_TAG_variable)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x56775): xCurrentHandle
    <ffd>   DW_AT_decl_file   : 1
    <ffd>   DW_AT_decl_line   : 480
    <fff>   DW_AT_decl_column : 15
    <1000>   DW_AT_type        : <0x24d>
    <1004>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1007>: Abbrev Number: 3 (DW_TAG_variable)
    <1008>   DW_AT_name        : (indirect string, offset: 0x140cc): xCurrExtTCB
    <100c>   DW_AT_decl_file   : 1
    <100c>   DW_AT_decl_line   : 481
    <100e>   DW_AT_decl_column : 12
    <100f>   DW_AT_type        : <0xa8c>
    <1013>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><1016>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <1017>   DW_AT_low_pc      : 0x8001452
    <101b>   DW_AT_high_pc     : 0x6c
    <101f>   DW_AT_sibling     : <0x1042>
 <3><1023>: Abbrev Number: 3 (DW_TAG_variable)
    <1024>   DW_AT_name        : (indirect string, offset: 0x2d04d): notificationGiver
    <1028>   DW_AT_decl_file   : 1
    <1028>   DW_AT_decl_line   : 532
    <102a>   DW_AT_decl_column : 12
    <102b>   DW_AT_type        : <0xc4>
    <102f>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><1032>: Abbrev Number: 3 (DW_TAG_variable)
    <1033>   DW_AT_name        : (indirect string, offset: 0x3ca70): actualCPUCycles
    <1037>   DW_AT_decl_file   : 1
    <1037>   DW_AT_decl_line   : 539
    <1039>   DW_AT_decl_column : 14
    <103a>   DW_AT_type        : <0x109>
    <103e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><1041>: Abbrev Number: 0
 <2><1042>: Abbrev Number: 13 (DW_TAG_inlined_subroutine)
    <1043>   DW_AT_abstract_origin: <0x138b>
    <1047>   DW_AT_low_pc      : 0x800143a
    <104b>   DW_AT_high_pc     : 0x14
    <104f>   DW_AT_call_file   : 1
    <104f>   DW_AT_call_line   : 483
    <1051>   DW_AT_call_column : 2
 <3><1052>: Abbrev Number: 8 (DW_TAG_variable)
    <1053>   DW_AT_abstract_origin: <0x1394>
    <1057>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><105a>: Abbrev Number: 0
 <2><105b>: Abbrev Number: 0
 <1><105c>: Abbrev Number: 51 (DW_TAG_subprogram)
    <105d>   DW_AT_name        : (indirect string, offset: 0x657d1): getTaskRunTime
    <1061>   DW_AT_decl_file   : 1
    <1062>   DW_AT_decl_line   : 470
    <1064>   DW_AT_decl_column : 19
    <1065>   DW_AT_prototyped  : 1
    <1065>   DW_AT_type        : <0x109>
    <1069>   DW_AT_low_pc      : 0x80013e8
    <106d>   DW_AT_high_pc     : 0x34
    <1071>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1073>   DW_AT_call_all_tail_calls: 1
    <1073>   DW_AT_sibling     : <0x10a5>
 <2><1077>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1078>   DW_AT_name        : (indirect string, offset: 0x8749e): handle
    <107c>   DW_AT_decl_file   : 1
    <107c>   DW_AT_decl_line   : 470
    <107e>   DW_AT_decl_column : 47
    <107f>   DW_AT_type        : <0x24d>
    <1083>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><1086>: Abbrev Number: 3 (DW_TAG_variable)
    <1087>   DW_AT_name        : (indirect string, offset: 0x934bc): status
    <108b>   DW_AT_decl_file   : 1
    <108b>   DW_AT_decl_line   : 471
    <108d>   DW_AT_decl_column : 15
    <108e>   DW_AT_type        : <0x35b>
    <1092>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><1095>: Abbrev Number: 3 (DW_TAG_variable)
    <1096>   DW_AT_name        : (indirect string, offset: 0x95699): count
    <109a>   DW_AT_decl_file   : 1
    <109a>   DW_AT_decl_line   : 472
    <109c>   DW_AT_decl_column : 14
    <109d>   DW_AT_type        : <0x11f>
    <10a1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><10a4>: Abbrev Number: 0
 <1><10a5>: Abbrev Number: 35 (DW_TAG_subprogram)
    <10a6>   DW_AT_external    : 1
    <10a6>   DW_AT_name        : (indirect string, offset: 0x9f23): vMSTSporadicTaskCreate
    <10aa>   DW_AT_decl_file   : 1
    <10aa>   DW_AT_decl_line   : 423
    <10ac>   DW_AT_decl_column : 12
    <10ac>   DW_AT_prototyped  : 1
    <10ac>   DW_AT_type        : <0x109>
    <10b0>   DW_AT_low_pc      : 0x8001324
    <10b4>   DW_AT_high_pc     : 0xc4
    <10b8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10ba>   DW_AT_call_all_tail_calls: 1
    <10ba>   DW_AT_sibling     : <0x1159>
 <2><10be>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x3b733): pvJobCode
    <10c3>   DW_AT_decl_file   : 1
    <10c3>   DW_AT_decl_line   : 423
    <10c5>   DW_AT_decl_column : 50
    <10c6>   DW_AT_type        : <0xda>
    <10ca>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <2><10ce>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x42345): pcName
    <10d3>   DW_AT_decl_file   : 1
    <10d3>   DW_AT_decl_line   : 423
    <10d5>   DW_AT_decl_column : 73
    <10d6>   DW_AT_type        : <0x152>
    <10da>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <2><10de>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10df>   DW_AT_name        : (indirect string, offset: 0x6b80c): usStackDepth
    <10e3>   DW_AT_decl_file   : 1
    <10e3>   DW_AT_decl_line   : 424
    <10e5>   DW_AT_decl_column : 12
    <10e6>   DW_AT_type        : <0xa7>
    <10ea>   DW_AT_location    : 3 byte block: 91 ee 7e 	(DW_OP_fbreg: -146)
 <2><10ee>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x6bf7): pvParameters
    <10f3>   DW_AT_decl_file   : 1
    <10f3>   DW_AT_decl_line   : 424
    <10f5>   DW_AT_decl_column : 32
    <10f6>   DW_AT_type        : <0xf6>
    <10fa>   DW_AT_location    : 3 byte block: 91 e8 7e 	(DW_OP_fbreg: -152)
 <2><10fe>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10ff>   DW_AT_name        : (indirect string, offset: 0x2b1c5): uxPriority
    <1103>   DW_AT_decl_file   : 1
    <1103>   DW_AT_decl_line   : 424
    <1105>   DW_AT_decl_column : 58
    <1106>   DW_AT_type        : <0x11f>
    <110a>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><110d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <110e>   DW_AT_name        : (indirect string, offset: 0x45ffd): pxCreatedTask
    <1112>   DW_AT_decl_file   : 1
    <1112>   DW_AT_decl_line   : 425
    <1114>   DW_AT_decl_column : 17
    <1115>   DW_AT_type        : <0x72f>
    <1119>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><111c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <111d>   DW_AT_name        : (indirect string, offset: 0x7e8b3): xTaskInterarrivalTime
    <1121>   DW_AT_decl_file   : 1
    <1121>   DW_AT_decl_line   : 427
    <1123>   DW_AT_decl_column : 14
    <1124>   DW_AT_type        : <0x135>
    <1128>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><112b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <112c>   DW_AT_name        : (indirect string, offset: 0x6da94): xTaskDeadline
    <1130>   DW_AT_decl_file   : 1
    <1130>   DW_AT_decl_line   : 427
    <1132>   DW_AT_decl_column : 48
    <1133>   DW_AT_type        : <0x135>
    <1137>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><113a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <113b>   DW_AT_name        : (indirect string, offset: 0x2756c): xTaskWCET
    <113f>   DW_AT_decl_file   : 1
    <113f>   DW_AT_decl_line   : 428
    <1141>   DW_AT_decl_column : 14
    <1142>   DW_AT_type        : <0x135>
