Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xe1c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 33 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x32b03): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x71c9): ../Core/Src/MSTScheduler.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x6d711): /Users/enricoalberti/Desktop/STM/MST-FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 34 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5d74): size_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

    <ec>   DW_AT_sibling     : <0xf6>
 <2><f0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f1>   DW_AT_type        : <0xf6>
 <2><f5>: Abbrev Number: 0
 <1><f6>: Abbrev Number: 36 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 9 (DW_TAG_const_type)
    <f9>   DW_AT_type        : <0xf6>
 <1><fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x813c6): BaseType_t
    <102>   DW_AT_decl_file   : 2
    <103>   DW_AT_decl_line   : 56
    <104>   DW_AT_decl_column : 14
    <105>   DW_AT_type        : <0x86>
 <1><109>: Abbrev Number: 9 (DW_TAG_const_type)
    <10a>   DW_AT_type        : <0xfd>
 <1><10e>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f>   DW_AT_name        : (indirect string, offset: 0x813c5): UBaseType_t
    <113>   DW_AT_decl_file   : 2
    <114>   DW_AT_decl_line   : 57
    <115>   DW_AT_decl_column : 23
    <116>   DW_AT_type        : <0x99>
 <1><11a>: Abbrev Number: 9 (DW_TAG_const_type)
    <11b>   DW_AT_type        : <0x10e>
 <1><11f>: Abbrev Number: 4 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0x4c78e): TickType_t
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 63
    <126>   DW_AT_decl_column : 19
    <127>   DW_AT_type        : <0xc4>
 <1><12b>: Abbrev Number: 9 (DW_TAG_const_type)
    <12c>   DW_AT_type        : <0x11f>
 <1><130>: Abbrev Number: 7 (DW_TAG_base_type)
    <131>   DW_AT_byte_size   : 1
    <132>   DW_AT_encoding    : 8	(unsigned char)
    <133>   DW_AT_name        : (indirect string, offset: 0x2c667): char
 <1><137>: Abbrev Number: 9 (DW_TAG_const_type)
    <138>   DW_AT_type        : <0x130>
 <1><13c>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <13d>   DW_AT_byte_size   : 4
    <13d>   DW_AT_type        : <0x137>
 <1><141>: Abbrev Number: 9 (DW_TAG_const_type)
    <142>   DW_AT_type        : <0x13c>
 <1><146>: Abbrev Number: 4 (DW_TAG_typedef)
    <147>   DW_AT_name        : (indirect string, offset: 0x79a67): TaskHandle_t
    <14b>   DW_AT_decl_file   : 7
    <14c>   DW_AT_decl_line   : 70
    <14d>   DW_AT_decl_column : 37
    <14e>   DW_AT_type        : <0x152>
 <1><152>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <153>   DW_AT_byte_size   : 4
    <153>   DW_AT_type        : <0x157>
 <1><157>: Abbrev Number: 21 (DW_TAG_structure_type)
    <158>   DW_AT_name        : (indirect string, offset: 0x76e90): tskTaskControlBlock
    <15c>   DW_AT_declaration : 1
 <1><15c>: Abbrev Number: 37 (DW_TAG_enumeration_type)
    <15d>   DW_AT_encoding    : 7	(unsigned)
    <15e>   DW_AT_byte_size   : 1
    <15f>   DW_AT_type        : <0x59>
    <163>   DW_AT_decl_file   : 7
    <164>   DW_AT_decl_line   : 91
    <165>   DW_AT_decl_column : 1
    <166>   DW_AT_sibling     : <0x189>
 <2><16a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <16b>   DW_AT_name        : (indirect string, offset: 0x38c10): eNoAction
    <16f>   DW_AT_const_value : 0
 <2><170>: Abbrev Number: 13 (DW_TAG_enumerator)
    <171>   DW_AT_name        : (indirect string, offset: 0x5fe9a): eSetBits
    <175>   DW_AT_const_value : 1
 <2><176>: Abbrev Number: 13 (DW_TAG_enumerator)
    <177>   DW_AT_name        : (indirect string, offset: 0x96d21): eIncrement
    <17b>   DW_AT_const_value : 2
 <2><17c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <17d>   DW_AT_name        : (indirect string, offset: 0x628d1): eSetValueWithOverwrite
    <181>   DW_AT_const_value : 3
 <2><182>: Abbrev Number: 13 (DW_TAG_enumerator)
    <183>   DW_AT_name        : (indirect string, offset: 0x26df3): eSetValueWithoutOverwrite
    <187>   DW_AT_const_value : 4
 <2><188>: Abbrev Number: 0
 <1><189>: Abbrev Number: 4 (DW_TAG_typedef)
    <18a>   DW_AT_name        : (indirect string, offset: 0x4c2c3): eNotifyAction
    <18e>   DW_AT_decl_file   : 7
    <18f>   DW_AT_decl_line   : 97
    <190>   DW_AT_decl_column : 3
    <191>   DW_AT_type        : <0x15c>
 <1><195>: Abbrev Number: 4 (DW_TAG_typedef)
    <196>   DW_AT_name        : (indirect string, offset: 0x3496): TimerHandle_t
    <19a>   DW_AT_decl_file   : 8
    <19b>   DW_AT_decl_line   : 77
    <19c>   DW_AT_decl_column : 34
    <19d>   DW_AT_type        : <0x1a6>
 <1><1a1>: Abbrev Number: 9 (DW_TAG_const_type)
    <1a2>   DW_AT_type        : <0x195>
 <1><1a6>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <1a7>   DW_AT_byte_size   : 4
    <1a7>   DW_AT_type        : <0x1ab>
 <1><1ab>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x16bb7): tmrTimerControl
    <1b0>   DW_AT_declaration : 1
 <1><1b0>: Abbrev Number: 4 (DW_TAG_typedef)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x48e2e): TimerCallbackFunction_t
    <1b5>   DW_AT_decl_file   : 8
    <1b6>   DW_AT_decl_line   : 82
    <1b7>   DW_AT_decl_column : 16
    <1b8>   DW_AT_type        : <0x1bc>
 <1><1bc>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <1bd>   DW_AT_byte_size   : 4
    <1bd>   DW_AT_type        : <0x1c1>
 <1><1c1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <1c2>   DW_AT_prototyped  : 1
    <1c2>   DW_AT_sibling     : <0x1cc>
 <2><1c6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <1c7>   DW_AT_type        : <0x195>
 <2><1cb>: Abbrev Number: 0
 <1><1cc>: Abbrev Number: 22 (DW_TAG_array_type)
    <1cd>   DW_AT_type        : <0xc4>
    <1d1>   DW_AT_sibling     : <0x1dc>
 <2><1d5>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <1d6>   DW_AT_type        : <0x3d>
    <1da>   DW_AT_upper_bound : 0
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1dd>   DW_AT_byte_size   : 92
    <1de>   DW_AT_decl_file   : 9
    <1df>   DW_AT_decl_line   : 904
    <1e1>   DW_AT_decl_column : 9
    <1e1>   DW_AT_sibling     : <0x328>
 <2><1e5>: Abbrev Number: 1 (DW_TAG_member)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x4c0e2): CTRL
    <1ea>   DW_AT_decl_file   : 9
    <1eb>   DW_AT_decl_line   : 906
    <1ed>   DW_AT_decl_column : 18
    <1ee>   DW_AT_type        : <0xd0>
    <1f2>   DW_AT_data_member_location: 0
 <2><1f3>: Abbrev Number: 1 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x29d47): CYCCNT
    <1f8>   DW_AT_decl_file   : 9
    <1f9>   DW_AT_decl_line   : 907
    <1fb>   DW_AT_decl_column : 18
    <1fc>   DW_AT_type        : <0xd0>
    <200>   DW_AT_data_member_location: 4
 <2><201>: Abbrev Number: 1 (DW_TAG_member)
    <202>   DW_AT_name        : (indirect string, offset: 0x49012): CPICNT
    <206>   DW_AT_decl_file   : 9
    <207>   DW_AT_decl_line   : 908
    <209>   DW_AT_decl_column : 18
    <20a>   DW_AT_type        : <0xd0>
    <20e>   DW_AT_data_member_location: 8
 <2><20f>: Abbrev Number: 1 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x76b0d): EXCCNT
    <214>   DW_AT_decl_file   : 9
    <215>   DW_AT_decl_line   : 909
    <217>   DW_AT_decl_column : 18
    <218>   DW_AT_type        : <0xd0>
    <21c>   DW_AT_data_member_location: 12
 <2><21d>: Abbrev Number: 1 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x2eaff): SLEEPCNT
    <222>   DW_AT_decl_file   : 9
    <223>   DW_AT_decl_line   : 910
    <225>   DW_AT_decl_column : 18
    <226>   DW_AT_type        : <0xd0>
    <22a>   DW_AT_data_member_location: 16
 <2><22b>: Abbrev Number: 1 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0xc059): LSUCNT
    <230>   DW_AT_decl_file   : 9
    <231>   DW_AT_decl_line   : 911
    <233>   DW_AT_decl_column : 18
    <234>   DW_AT_type        : <0xd0>
    <238>   DW_AT_data_member_location: 20
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x5952d): FOLDCNT
    <23e>   DW_AT_decl_file   : 9
    <23f>   DW_AT_decl_line   : 912
    <241>   DW_AT_decl_column : 18
    <242>   DW_AT_type        : <0xd0>
    <246>   DW_AT_data_member_location: 24
 <2><247>: Abbrev Number: 1 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x547ad): PCSR
    <24c>   DW_AT_decl_file   : 9
    <24d>   DW_AT_decl_line   : 913
    <24f>   DW_AT_decl_column : 18
    <250>   DW_AT_type        : <0xd5>
    <254>   DW_AT_data_member_location: 28
 <2><255>: Abbrev Number: 1 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0x7fc6): COMP0
    <25a>   DW_AT_decl_file   : 9
    <25b>   DW_AT_decl_line   : 914
    <25d>   DW_AT_decl_column : 18
    <25e>   DW_AT_type        : <0xd0>
    <262>   DW_AT_data_member_location: 32
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x452d1): MASK0
    <268>   DW_AT_decl_file   : 9
    <269>   DW_AT_decl_line   : 915
    <26b>   DW_AT_decl_column : 18
    <26c>   DW_AT_type        : <0xd0>
    <270>   DW_AT_data_member_location: 36
 <2><271>: Abbrev Number: 1 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x1ce5): FUNCTION0
    <276>   DW_AT_decl_file   : 9
    <277>   DW_AT_decl_line   : 916
    <279>   DW_AT_decl_column : 18
    <27a>   DW_AT_type        : <0xd0>
    <27e>   DW_AT_data_member_location: 40
 <2><27f>: Abbrev Number: 1 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x844fc): RESERVED0
    <284>   DW_AT_decl_file   : 9
    <285>   DW_AT_decl_line   : 917
    <287>   DW_AT_decl_column : 18
    <288>   DW_AT_type        : <0x1cc>
    <28c>   DW_AT_data_member_location: 44
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x47fe9): COMP1
    <292>   DW_AT_decl_file   : 9
    <293>   DW_AT_decl_line   : 918
    <295>   DW_AT_decl_column : 18
    <296>   DW_AT_type        : <0xd0>
    <29a>   DW_AT_data_member_location: 48
 <2><29b>: Abbrev Number: 1 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0x452d7): MASK1
    <2a0>   DW_AT_decl_file   : 9
    <2a1>   DW_AT_decl_line   : 919
    <2a3>   DW_AT_decl_column : 18
    <2a4>   DW_AT_type        : <0xd0>
    <2a8>   DW_AT_data_member_location: 52
 <2><2a9>: Abbrev Number: 1 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x1cef): FUNCTION1
    <2ae>   DW_AT_decl_file   : 9
    <2af>   DW_AT_decl_line   : 920
    <2b1>   DW_AT_decl_column : 18
    <2b2>   DW_AT_type        : <0xd0>
    <2b6>   DW_AT_data_member_location: 56
 <2><2b7>: Abbrev Number: 1 (DW_TAG_member)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x84506): RESERVED1
    <2bc>   DW_AT_decl_file   : 9
    <2bd>   DW_AT_decl_line   : 921
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x1cc>
    <2c4>   DW_AT_data_member_location: 60
 <2><2c5>: Abbrev Number: 1 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x110ad): COMP2
    <2ca>   DW_AT_decl_file   : 9
    <2cb>   DW_AT_decl_line   : 922
    <2cd>   DW_AT_decl_column : 18
    <2ce>   DW_AT_type        : <0xd0>
    <2d2>   DW_AT_data_member_location: 64
 <2><2d3>: Abbrev Number: 1 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x57305): MASK2
    <2d8>   DW_AT_decl_file   : 9
    <2d9>   DW_AT_decl_line   : 923
    <2db>   DW_AT_decl_column : 18
    <2dc>   DW_AT_type        : <0xd0>
    <2e0>   DW_AT_data_member_location: 68
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x1cf9): FUNCTION2
    <2e6>   DW_AT_decl_file   : 9
    <2e7>   DW_AT_decl_line   : 924
    <2e9>   DW_AT_decl_column : 18
    <2ea>   DW_AT_type        : <0xd0>
    <2ee>   DW_AT_data_member_location: 72
 <2><2ef>: Abbrev Number: 1 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x84510): RESERVED2
    <2f4>   DW_AT_decl_file   : 9
    <2f5>   DW_AT_decl_line   : 925
    <2f7>   DW_AT_decl_column : 18
    <2f8>   DW_AT_type        : <0x1cc>
    <2fc>   DW_AT_data_member_location: 76
 <2><2fd>: Abbrev Number: 1 (DW_TAG_member)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x5f61a): COMP3
    <302>   DW_AT_decl_file   : 9
    <303>   DW_AT_decl_line   : 926
    <305>   DW_AT_decl_column : 18
    <306>   DW_AT_type        : <0xd0>
    <30a>   DW_AT_data_member_location: 80
 <2><30b>: Abbrev Number: 1 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x45330): MASK3
    <310>   DW_AT_decl_file   : 9
    <311>   DW_AT_decl_line   : 927
    <313>   DW_AT_decl_column : 18
    <314>   DW_AT_type        : <0xd0>
    <318>   DW_AT_data_member_location: 84
 <2><319>: Abbrev Number: 1 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x1d03): FUNCTION3
    <31e>   DW_AT_decl_file   : 9
    <31f>   DW_AT_decl_line   : 928
    <321>   DW_AT_decl_column : 18
    <322>   DW_AT_type        : <0xd0>
    <326>   DW_AT_data_member_location: 88
 <2><327>: Abbrev Number: 0
 <1><328>: Abbrev Number: 16 (DW_TAG_typedef)
    <329>   DW_AT_name        : (indirect string, offset: 0x24c84): DWT_Type
    <32d>   DW_AT_decl_file   : 9
    <32e>   DW_AT_decl_line   : 929
    <330>   DW_AT_decl_column : 3
    <330>   DW_AT_type        : <0x1dc>
 <1><334>: Abbrev Number: 22 (DW_TAG_array_type)
    <335>   DW_AT_type        : <0xc4>
    <339>   DW_AT_sibling     : <0x344>
 <2><33d>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <33e>   DW_AT_type        : <0x3d>
    <342>   DW_AT_upper_bound : 1
 <2><343>: Abbrev Number: 0
 <1><344>: Abbrev Number: 15 (DW_TAG_structure_type)
    <345>   DW_AT_byte_size   : 16
    <346>   DW_AT_decl_file   : 9
    <347>   DW_AT_decl_line   : 1421
    <349>   DW_AT_decl_column : 9
    <349>   DW_AT_sibling     : <0x386>
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x65c86): DHCSR
    <352>   DW_AT_decl_file   : 9
    <353>   DW_AT_decl_line   : 1423
    <355>   DW_AT_decl_column : 18
    <356>   DW_AT_type        : <0xd0>
    <35a>   DW_AT_data_member_location: 0
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x79529): DCRSR
    <360>   DW_AT_decl_file   : 9
    <361>   DW_AT_decl_line   : 1424
    <363>   DW_AT_decl_column : 18
    <364>   DW_AT_type        : <0xd0>
    <368>   DW_AT_data_member_location: 4
 <2><369>: Abbrev Number: 1 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x74fc6): DCRDR
    <36e>   DW_AT_decl_file   : 9
    <36f>   DW_AT_decl_line   : 1425
    <371>   DW_AT_decl_column : 18
    <372>   DW_AT_type        : <0xd0>
    <376>   DW_AT_data_member_location: 8
 <2><377>: Abbrev Number: 1 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x47752): DEMCR
    <37c>   DW_AT_decl_file   : 9
    <37d>   DW_AT_decl_line   : 1426
    <37f>   DW_AT_decl_column : 18
    <380>   DW_AT_type        : <0xd0>
    <384>   DW_AT_data_member_location: 12
 <2><385>: Abbrev Number: 0
 <1><386>: Abbrev Number: 16 (DW_TAG_typedef)
    <387>   DW_AT_name        : (indirect string, offset: 0x3a719): CoreDebug_Type
    <38b>   DW_AT_decl_file   : 9
    <38c>   DW_AT_decl_line   : 1427
    <38e>   DW_AT_decl_column : 3
    <38e>   DW_AT_type        : <0x344>
 <1><392>: Abbrev Number: 15 (DW_TAG_structure_type)
    <393>   DW_AT_byte_size   : 144
    <394>   DW_AT_decl_file   : 10
    <395>   DW_AT_decl_line   : 335
    <397>   DW_AT_decl_column : 9
    <397>   DW_AT_sibling     : <0x555>
 <2><39b>: Abbrev Number: 5 (DW_TAG_member)
    <39c>   DW_AT_name        : CR
    <39f>   DW_AT_decl_file   : 10
    <39f>   DW_AT_decl_line   : 337
    <3a1>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xd0>
    <3a5>   DW_AT_data_member_location: 0
 <2><3a6>: Abbrev Number: 1 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x61575): PLLCFGR
    <3ab>   DW_AT_decl_file   : 10
    <3ac>   DW_AT_decl_line   : 338
    <3ae>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0xd0>
    <3b3>   DW_AT_data_member_location: 4
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x3bad5): CFGR
    <3b9>   DW_AT_decl_file   : 10
    <3ba>   DW_AT_decl_line   : 339
    <3bc>   DW_AT_decl_column : 17
    <3bd>   DW_AT_type        : <0xd0>
    <3c1>   DW_AT_data_member_location: 8
 <2><3c2>: Abbrev Number: 5 (DW_TAG_member)
    <3c3>   DW_AT_name        : CIR
    <3c7>   DW_AT_decl_file   : 10
    <3c7>   DW_AT_decl_line   : 340
    <3c9>   DW_AT_decl_column : 17
    <3c9>   DW_AT_type        : <0xd0>
    <3cd>   DW_AT_data_member_location: 12
 <2><3ce>: Abbrev Number: 1 (DW_TAG_member)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x6f778): AHB1RSTR
    <3d3>   DW_AT_decl_file   : 10
    <3d4>   DW_AT_decl_line   : 341
    <3d6>   DW_AT_decl_column : 17
    <3d7>   DW_AT_type        : <0xd0>
    <3db>   DW_AT_data_member_location: 16
 <2><3dc>: Abbrev Number: 1 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0xf973): AHB2RSTR
    <3e1>   DW_AT_decl_file   : 10
    <3e2>   DW_AT_decl_line   : 342
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0xd0>
    <3e9>   DW_AT_data_member_location: 20
 <2><3ea>: Abbrev Number: 1 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x3b940): AHB3RSTR
    <3ef>   DW_AT_decl_file   : 10
    <3f0>   DW_AT_decl_line   : 343
    <3f2>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0xd0>
    <3f7>   DW_AT_data_member_location: 24
 <2><3f8>: Abbrev Number: 1 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x844fc): RESERVED0
    <3fd>   DW_AT_decl_file   : 10
    <3fe>   DW_AT_decl_line   : 344
    <400>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0xc4>
    <405>   DW_AT_data_member_location: 28
 <2><406>: Abbrev Number: 1 (DW_TAG_member)
    <407>   DW_AT_name        : (indirect string, offset: 0xf537): APB1RSTR
    <40b>   DW_AT_decl_file   : 10
    <40c>   DW_AT_decl_line   : 345
    <40e>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0xd0>
    <413>   DW_AT_data_member_location: 32
 <2><414>: Abbrev Number: 1 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0x3b503): APB2RSTR
    <419>   DW_AT_decl_file   : 10
    <41a>   DW_AT_decl_line   : 346
    <41c>   DW_AT_decl_column : 17
    <41d>   DW_AT_type        : <0xd0>
    <421>   DW_AT_data_member_location: 36
 <2><422>: Abbrev Number: 1 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x84506): RESERVED1
    <427>   DW_AT_decl_file   : 10
    <428>   DW_AT_decl_line   : 347
    <42a>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0x334>
    <42f>   DW_AT_data_member_location: 40
 <2><430>: Abbrev Number: 1 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0xb04a): AHB1ENR
    <435>   DW_AT_decl_file   : 10
    <436>   DW_AT_decl_line   : 348
    <438>   DW_AT_decl_column : 17
    <439>   DW_AT_type        : <0xd0>
    <43d>   DW_AT_data_member_location: 48
 <2><43e>: Abbrev Number: 1 (DW_TAG_member)
    <43f>   DW_AT_name        : (indirect string, offset: 0x24330): AHB2ENR
    <443>   DW_AT_decl_file   : 10
    <444>   DW_AT_decl_line   : 349
    <446>   DW_AT_decl_column : 17
    <447>   DW_AT_type        : <0xd0>
    <44b>   DW_AT_data_member_location: 52
 <2><44c>: Abbrev Number: 1 (DW_TAG_member)
    <44d>   DW_AT_name        : (indirect string, offset: 0x3d8e9): AHB3ENR
    <451>   DW_AT_decl_file   : 10
    <452>   DW_AT_decl_line   : 350
    <454>   DW_AT_decl_column : 17
    <455>   DW_AT_type        : <0xd0>
    <459>   DW_AT_data_member_location: 56
 <2><45a>: Abbrev Number: 1 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0x84510): RESERVED2
    <45f>   DW_AT_decl_file   : 10
    <460>   DW_AT_decl_line   : 351
    <462>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0xc4>
    <467>   DW_AT_data_member_location: 60
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x6957f): APB1ENR
    <46d>   DW_AT_decl_file   : 10
    <46e>   DW_AT_decl_line   : 352
    <470>   DW_AT_decl_column : 17
    <471>   DW_AT_type        : <0xd0>
    <475>   DW_AT_data_member_location: 64
 <2><476>: Abbrev Number: 1 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x1010c): APB2ENR
    <47b>   DW_AT_decl_file   : 10
    <47c>   DW_AT_decl_line   : 353
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0xd0>
    <483>   DW_AT_data_member_location: 68
 <2><484>: Abbrev Number: 1 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x8451a): RESERVED3
    <489>   DW_AT_decl_file   : 10
    <48a>   DW_AT_decl_line   : 354
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x334>
    <491>   DW_AT_data_member_location: 72
 <2><492>: Abbrev Number: 1 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x448ad): AHB1LPENR
    <497>   DW_AT_decl_file   : 10
    <498>   DW_AT_decl_line   : 355
    <49a>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0xd0>
    <49f>   DW_AT_data_member_location: 80
 <2><4a0>: Abbrev Number: 1 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x1ecb7): AHB2LPENR
    <4a5>   DW_AT_decl_file   : 10
    <4a6>   DW_AT_decl_line   : 356
    <4a8>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0xd0>
    <4ad>   DW_AT_data_member_location: 84
 <2><4ae>: Abbrev Number: 1 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x5da9c): AHB3LPENR
    <4b3>   DW_AT_decl_file   : 10
    <4b4>   DW_AT_decl_line   : 357
    <4b6>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0xd0>
    <4bb>   DW_AT_data_member_location: 88
 <2><4bc>: Abbrev Number: 1 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x52a7b): RESERVED4
    <4c1>   DW_AT_decl_file   : 10
    <4c2>   DW_AT_decl_line   : 358
    <4c4>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0xc4>
    <4c9>   DW_AT_data_member_location: 92
 <2><4ca>: Abbrev Number: 1 (DW_TAG_member)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x5c341): APB1LPENR
    <4cf>   DW_AT_decl_file   : 10
    <4d0>   DW_AT_decl_line   : 359
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0xd0>
    <4d7>   DW_AT_data_member_location: 96
 <2><4d8>: Abbrev Number: 1 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0xa2ca): APB2LPENR
    <4dd>   DW_AT_decl_file   : 10
    <4de>   DW_AT_decl_line   : 360
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0xd0>
    <4e5>   DW_AT_data_member_location: 100
 <2><4e6>: Abbrev Number: 1 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x84537): RESERVED5
    <4eb>   DW_AT_decl_file   : 10
    <4ec>   DW_AT_decl_line   : 361
    <4ee>   DW_AT_decl_column : 17
    <4ef>   DW_AT_type        : <0x334>
    <4f3>   DW_AT_data_member_location: 104
 <2><4f4>: Abbrev Number: 1 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x13440): BDCR
    <4f9>   DW_AT_decl_file   : 10
    <4fa>   DW_AT_decl_line   : 362
    <4fc>   DW_AT_decl_column : 17
    <4fd>   DW_AT_type        : <0xd0>
    <501>   DW_AT_data_member_location: 112
 <2><502>: Abbrev Number: 5 (DW_TAG_member)
    <503>   DW_AT_name        : CSR
    <507>   DW_AT_decl_file   : 10
    <507>   DW_AT_decl_line   : 363
    <509>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xd0>
    <50d>   DW_AT_data_member_location: 116
 <2><50e>: Abbrev Number: 1 (DW_TAG_member)
    <50f>   DW_AT_name        : (indirect string, offset: 0x84541): RESERVED6
    <513>   DW_AT_decl_file   : 10
    <514>   DW_AT_decl_line   : 364
    <516>   DW_AT_decl_column : 17
    <517>   DW_AT_type        : <0x334>
    <51b>   DW_AT_data_member_location: 120
 <2><51c>: Abbrev Number: 1 (DW_TAG_member)
    <51d>   DW_AT_name        : (indirect string, offset: 0x49493): SSCGR
    <521>   DW_AT_decl_file   : 10
    <522>   DW_AT_decl_line   : 365
    <524>   DW_AT_decl_column : 17
    <525>   DW_AT_type        : <0xd0>
    <529>   DW_AT_data_member_location: 128
 <2><52a>: Abbrev Number: 1 (DW_TAG_member)
    <52b>   DW_AT_name        : (indirect string, offset: 0x2d758): PLLI2SCFGR
    <52f>   DW_AT_decl_file   : 10
    <530>   DW_AT_decl_line   : 366
    <532>   DW_AT_decl_column : 17
    <533>   DW_AT_type        : <0xd0>
    <537>   DW_AT_data_member_location: 132
 <2><538>: Abbrev Number: 1 (DW_TAG_member)
    <539>   DW_AT_name        : (indirect string, offset: 0x8454b): RESERVED7
    <53d>   DW_AT_decl_file   : 10
    <53e>   DW_AT_decl_line   : 367
    <540>   DW_AT_decl_column : 17
    <541>   DW_AT_type        : <0x1cc>
    <545>   DW_AT_data_member_location: 136
 <2><546>: Abbrev Number: 1 (DW_TAG_member)
    <547>   DW_AT_name        : (indirect string, offset: 0x3bad2): DCKCFGR
    <54b>   DW_AT_decl_file   : 10
    <54c>   DW_AT_decl_line   : 368
    <54e>   DW_AT_decl_column : 17
    <54f>   DW_AT_type        : <0xd0>
    <553>   DW_AT_data_member_location: 140
 <2><554>: Abbrev Number: 0
 <1><555>: Abbrev Number: 16 (DW_TAG_typedef)
    <556>   DW_AT_name        : (indirect string, offset: 0x3fc1f): RCC_TypeDef
    <55a>   DW_AT_decl_file   : 10
    <55b>   DW_AT_decl_line   : 369
    <55d>   DW_AT_decl_column : 3
    <55d>   DW_AT_type        : <0x392>
 <1><561>: Abbrev Number: 15 (DW_TAG_structure_type)
    <562>   DW_AT_byte_size   : 84
    <563>   DW_AT_decl_file   : 10
    <564>   DW_AT_decl_line   : 469
    <566>   DW_AT_decl_column : 9
    <566>   DW_AT_sibling     : <0x67b>
 <2><56a>: Abbrev Number: 5 (DW_TAG_member)
    <56b>   DW_AT_name        : CR1
    <56f>   DW_AT_decl_file   : 10
    <56f>   DW_AT_decl_line   : 471
    <571>   DW_AT_decl_column : 17
    <571>   DW_AT_type        : <0xd0>
    <575>   DW_AT_data_member_location: 0
 <2><576>: Abbrev Number: 5 (DW_TAG_member)
    <577>   DW_AT_name        : CR2
    <57b>   DW_AT_decl_file   : 10
    <57b>   DW_AT_decl_line   : 472
    <57d>   DW_AT_decl_column : 17
    <57d>   DW_AT_type        : <0xd0>
    <581>   DW_AT_data_member_location: 4
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0x2816c): SMCR
    <587>   DW_AT_decl_file   : 10
    <588>   DW_AT_decl_line   : 473
    <58a>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0xd0>
    <58f>   DW_AT_data_member_location: 8
 <2><590>: Abbrev Number: 1 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0x2c480): DIER
    <595>   DW_AT_decl_file   : 10
    <596>   DW_AT_decl_line   : 474
    <598>   DW_AT_decl_column : 17
    <599>   DW_AT_type        : <0xd0>
    <59d>   DW_AT_data_member_location: 12
 <2><59e>: Abbrev Number: 5 (DW_TAG_member)
    <59f>   DW_AT_name        : SR
    <5a2>   DW_AT_decl_file   : 10
    <5a2>   DW_AT_decl_line   : 475
    <5a4>   DW_AT_decl_column : 17
    <5a4>   DW_AT_type        : <0xd0>
    <5a8>   DW_AT_data_member_location: 16
 <2><5a9>: Abbrev Number: 5 (DW_TAG_member)
    <5aa>   DW_AT_name        : EGR
    <5ae>   DW_AT_decl_file   : 10
    <5ae>   DW_AT_decl_line   : 476
    <5b0>   DW_AT_decl_column : 17
    <5b0>   DW_AT_type        : <0xd0>
    <5b4>   DW_AT_data_member_location: 20
 <2><5b5>: Abbrev Number: 1 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x7ff91): CCMR1
    <5ba>   DW_AT_decl_file   : 10
    <5bb>   DW_AT_decl_line   : 477
    <5bd>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0xd0>
    <5c2>   DW_AT_data_member_location: 24
 <2><5c3>: Abbrev Number: 1 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x36716): CCMR2
    <5c8>   DW_AT_decl_file   : 10
    <5c9>   DW_AT_decl_line   : 478
    <5cb>   DW_AT_decl_column : 17
    <5cc>   DW_AT_type        : <0xd0>
    <5d0>   DW_AT_data_member_location: 28
 <2><5d1>: Abbrev Number: 1 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x1cd1e): CCER
    <5d6>   DW_AT_decl_file   : 10
    <5d7>   DW_AT_decl_line   : 479
    <5d9>   DW_AT_decl_column : 17
    <5da>   DW_AT_type        : <0xd0>
    <5de>   DW_AT_data_member_location: 32
 <2><5df>: Abbrev Number: 5 (DW_TAG_member)
    <5e0>   DW_AT_name        : CNT
    <5e4>   DW_AT_decl_file   : 10
    <5e4>   DW_AT_decl_line   : 480
    <5e6>   DW_AT_decl_column : 17
    <5e6>   DW_AT_type        : <0xd0>
    <5ea>   DW_AT_data_member_location: 36
 <2><5eb>: Abbrev Number: 5 (DW_TAG_member)
    <5ec>   DW_AT_name        : PSC
    <5f0>   DW_AT_decl_file   : 10
    <5f0>   DW_AT_decl_line   : 481
    <5f2>   DW_AT_decl_column : 17
    <5f2>   DW_AT_type        : <0xd0>
    <5f6>   DW_AT_data_member_location: 40
 <2><5f7>: Abbrev Number: 5 (DW_TAG_member)
    <5f8>   DW_AT_name        : ARR
    <5fc>   DW_AT_decl_file   : 10
    <5fc>   DW_AT_decl_line   : 482
    <5fe>   DW_AT_decl_column : 17
    <5fe>   DW_AT_type        : <0xd0>
    <602>   DW_AT_data_member_location: 44
 <2><603>: Abbrev Number: 5 (DW_TAG_member)
    <604>   DW_AT_name        : RCR
    <608>   DW_AT_decl_file   : 10
    <608>   DW_AT_decl_line   : 483
    <60a>   DW_AT_decl_column : 17
    <60a>   DW_AT_type        : <0xd0>
    <60e>   DW_AT_data_member_location: 48
 <2><60f>: Abbrev Number: 1 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x10107): CCR1
    <614>   DW_AT_decl_file   : 10
    <615>   DW_AT_decl_line   : 484
    <617>   DW_AT_decl_column : 17
    <618>   DW_AT_type        : <0xd0>
    <61c>   DW_AT_data_member_location: 52
 <2><61d>: Abbrev Number: 1 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x39354): CCR2
    <622>   DW_AT_decl_file   : 10
    <623>   DW_AT_decl_line   : 485
    <625>   DW_AT_decl_column : 17
    <626>   DW_AT_type        : <0xd0>
    <62a>   DW_AT_data_member_location: 56
 <2><62b>: Abbrev Number: 1 (DW_TAG_member)
    <62c>   DW_AT_name        : (indirect string, offset: 0x6b0be): CCR3
    <630>   DW_AT_decl_file   : 10
    <631>   DW_AT_decl_line   : 486
    <633>   DW_AT_decl_column : 17
    <634>   DW_AT_type        : <0xd0>
    <638>   DW_AT_data_member_location: 60
 <2><639>: Abbrev Number: 1 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x8742): CCR4
    <63e>   DW_AT_decl_file   : 10
    <63f>   DW_AT_decl_line   : 487
    <641>   DW_AT_decl_column : 17
    <642>   DW_AT_type        : <0xd0>
    <646>   DW_AT_data_member_location: 64
 <2><647>: Abbrev Number: 1 (DW_TAG_member)
    <648>   DW_AT_name        : (indirect string, offset: 0x3f607): BDTR
    <64c>   DW_AT_decl_file   : 10
    <64d>   DW_AT_decl_line   : 488
    <64f>   DW_AT_decl_column : 17
    <650>   DW_AT_type        : <0xd0>
    <654>   DW_AT_data_member_location: 68
 <2><655>: Abbrev Number: 5 (DW_TAG_member)
    <656>   DW_AT_name        : DCR
    <65a>   DW_AT_decl_file   : 10
    <65a>   DW_AT_decl_line   : 489
    <65c>   DW_AT_decl_column : 17
    <65c>   DW_AT_type        : <0xd0>
    <660>   DW_AT_data_member_location: 72
 <2><661>: Abbrev Number: 1 (DW_TAG_member)
    <662>   DW_AT_name        : (indirect string, offset: 0x78297): DMAR
    <666>   DW_AT_decl_file   : 10
    <667>   DW_AT_decl_line   : 490
    <669>   DW_AT_decl_column : 17
    <66a>   DW_AT_type        : <0xd0>
    <66e>   DW_AT_data_member_location: 76
 <2><66f>: Abbrev Number: 5 (DW_TAG_member)
    <670>   DW_AT_name        : OR
    <673>   DW_AT_decl_file   : 10
    <673>   DW_AT_decl_line   : 491
    <675>   DW_AT_decl_column : 17
    <675>   DW_AT_type        : <0xd0>
    <679>   DW_AT_data_member_location: 80
 <2><67a>: Abbrev Number: 0
 <1><67b>: Abbrev Number: 16 (DW_TAG_typedef)
    <67c>   DW_AT_name        : (indirect string, offset: 0x4a35): TIM_TypeDef
    <680>   DW_AT_decl_file   : 10
    <681>   DW_AT_decl_line   : 492
    <683>   DW_AT_decl_column : 3
    <683>   DW_AT_type        : <0x561>
 <1><687>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <688>   DW_AT_byte_size   : 4
    <688>   DW_AT_type        : <0x67b>
 <1><68c>: Abbrev Number: 10 (DW_TAG_variable)
    <68d>   DW_AT_name        : (indirect string, offset: 0x6f30b): tstMSTTimerReferenceFromUser
    <691>   DW_AT_decl_file   : 1
    <691>   DW_AT_decl_line   : 12
    <692>   DW_AT_decl_column : 21
    <693>   DW_AT_type        : <0x687>
    <697>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><69d>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <69e>   DW_AT_name        : (indirect string, offset: 0x3427a): taskType_e
    <6a2>   DW_AT_encoding    : 7	(unsigned)
    <6a2>   DW_AT_byte_size   : 1
    <6a2>   DW_AT_type        : <0x59>
    <6a6>   DW_AT_decl_file   : 1
    <6a6>   DW_AT_decl_line   : 69
    <6a7>   DW_AT_decl_column : 6
    <6a7>   DW_AT_sibling     : <0x6b8>
 <2><6ab>: Abbrev Number: 13 (DW_TAG_enumerator)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x46e4c): taskTypePeriodic
    <6b0>   DW_AT_const_value : 0
 <2><6b1>: Abbrev Number: 13 (DW_TAG_enumerator)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x6106): taskTypeSporadic
    <6b6>   DW_AT_const_value : 1
 <2><6b7>: Abbrev Number: 0
 <1><6b8>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x357ab): sporadicTaskNotifyGiver_e
    <6bd>   DW_AT_encoding    : 7	(unsigned)
    <6bd>   DW_AT_byte_size   : 1
    <6bd>   DW_AT_type        : <0x59>
    <6c1>   DW_AT_decl_file   : 1
    <6c1>   DW_AT_decl_line   : 73
    <6c2>   DW_AT_decl_column : 6
    <6c2>   DW_AT_sibling     : <0x6d3>
 <2><6c6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x5b524): interarrivalTimer
    <6cb>   DW_AT_const_value : 1
 <2><6cc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x7dc72): userRequest
    <6d1>   DW_AT_const_value : 2
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 38 (DW_TAG_structure_type)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x14ca7): MSTextendedTCB
    <6d8>   DW_AT_byte_size   : 100
    <6d9>   DW_AT_decl_file   : 1
    <6da>   DW_AT_decl_line   : 82
    <6db>   DW_AT_decl_column : 16
    <6dc>   DW_AT_sibling     : <0x80d>
 <2><6e0>: Abbrev Number: 3 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x3a99a): pvJobCode
    <6e5>   DW_AT_decl_file   : 1
    <6e5>   DW_AT_decl_line   : 84
    <6e6>   DW_AT_decl_column : 17
    <6e7>   DW_AT_type        : <0xda>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 3 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x41440): pcName
    <6f1>   DW_AT_decl_file   : 1
    <6f1>   DW_AT_decl_line   : 85
    <6f2>   DW_AT_decl_column : 14
    <6f3>   DW_AT_type        : <0x13c>
    <6f7>   DW_AT_data_member_location: 4
 <2><6f8>: Abbrev Number: 3 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x69e9): pvParameters
    <6fd>   DW_AT_decl_file   : 1
    <6fd>   DW_AT_decl_line   : 86
    <6fe>   DW_AT_decl_column : 8
    <6ff>   DW_AT_type        : <0xf6>
    <703>   DW_AT_data_member_location: 8
 <2><704>: Abbrev Number: 3 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x2aa9f): uxPriority
    <709>   DW_AT_decl_file   : 1
    <709>   DW_AT_decl_line   : 87
    <70a>   DW_AT_decl_column : 14
    <70b>   DW_AT_type        : <0x10e>
    <70f>   DW_AT_data_member_location: 12
 <2><710>: Abbrev Number: 3 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0x4508f): pxCreatedTask
    <715>   DW_AT_decl_file   : 1
    <715>   DW_AT_decl_line   : 88
    <716>   DW_AT_decl_column : 16
    <717>   DW_AT_type        : <0x80d>
    <71b>   DW_AT_data_member_location: 16
 <2><71c>: Abbrev Number: 3 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x3876): taskType
    <721>   DW_AT_decl_file   : 1
    <721>   DW_AT_decl_line   : 89
    <722>   DW_AT_decl_column : 18
    <723>   DW_AT_type        : <0x69d>
    <727>   DW_AT_data_member_location: 20
 <2><728>: Abbrev Number: 3 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x572f9): xTaskPeriod
    <72d>   DW_AT_decl_file   : 1
    <72d>   DW_AT_decl_line   : 91
    <72e>   DW_AT_decl_column : 13
    <72f>   DW_AT_type        : <0x11f>
    <733>   DW_AT_data_member_location: 24
 <2><734>: Abbrev Number: 3 (DW_TAG_member)
    <735>   DW_AT_name        : (indirect string, offset: 0x6bc18): xTaskDeadline
    <739>   DW_AT_decl_file   : 1
    <739>   DW_AT_decl_line   : 92
    <73a>   DW_AT_decl_column : 13
    <73b>   DW_AT_type        : <0x11f>
    <73f>   DW_AT_data_member_location: 28
 <2><740>: Abbrev Number: 3 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x3ebb8): xTaskPhase
    <745>   DW_AT_decl_file   : 1
    <745>   DW_AT_decl_line   : 93
    <746>   DW_AT_decl_column : 13
    <747>   DW_AT_type        : <0x11f>
    <74b>   DW_AT_data_member_location: 32
 <2><74c>: Abbrev Number: 3 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x26d7c): xTaskWCET
    <751>   DW_AT_decl_file   : 1
    <751>   DW_AT_decl_line   : 94
    <752>   DW_AT_decl_column : 13
    <753>   DW_AT_type        : <0x11f>
    <757>   DW_AT_data_member_location: 36
 <2><758>: Abbrev Number: 3 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0x39f95): xPrevReleaseTime
    <75d>   DW_AT_decl_file   : 1
    <75d>   DW_AT_decl_line   : 96
    <75e>   DW_AT_decl_column : 13
    <75f>   DW_AT_type        : <0x11f>
    <763>   DW_AT_data_member_location: 40
 <2><764>: Abbrev Number: 3 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x4817a): xPrevExecTime
    <769>   DW_AT_decl_file   : 1
    <769>   DW_AT_decl_line   : 97
    <76a>   DW_AT_decl_column : 13
    <76b>   DW_AT_type        : <0x11f>
    <76f>   DW_AT_data_member_location: 44
 <2><770>: Abbrev Number: 3 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0x63ac1): xPrevAbsDeadline
    <775>   DW_AT_decl_file   : 1
    <775>   DW_AT_decl_line   : 98
    <776>   DW_AT_decl_column : 13
    <777>   DW_AT_type        : <0x11f>
    <77b>   DW_AT_data_member_location: 48
 <2><77c>: Abbrev Number: 3 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0xfb): xPrevStartTime
    <781>   DW_AT_decl_file   : 1
    <781>   DW_AT_decl_line   : 99
    <782>   DW_AT_decl_column : 13
    <783>   DW_AT_type        : <0x11f>
    <787>   DW_AT_data_member_location: 52
 <2><788>: Abbrev Number: 3 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x5cdfb): xPrevFinishTime
    <78d>   DW_AT_decl_file   : 1
    <78d>   DW_AT_decl_line   : 100
    <78e>   DW_AT_decl_column : 13
    <78f>   DW_AT_type        : <0x11f>
    <793>   DW_AT_data_member_location: 56
 <2><794>: Abbrev Number: 3 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x15673): uNumOfMissedDeadlines
    <799>   DW_AT_decl_file   : 1
    <799>   DW_AT_decl_line   : 101
    <79a>   DW_AT_decl_column : 14
    <79b>   DW_AT_type        : <0x10e>
    <79f>   DW_AT_data_member_location: 60
 <2><7a0>: Abbrev Number: 3 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x751ae): xNextIdealReleaseTime
    <7a5>   DW_AT_decl_file   : 1
    <7a5>   DW_AT_decl_line   : 102
    <7a6>   DW_AT_decl_column : 13
    <7a7>   DW_AT_type        : <0x11f>
    <7ab>   DW_AT_data_member_location: 64
 <2><7ac>: Abbrev Number: 3 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x4f0b4): xTaskInitDone
    <7b1>   DW_AT_decl_file   : 1
    <7b1>   DW_AT_decl_line   : 106
    <7b2>   DW_AT_decl_column : 13
    <7b3>   DW_AT_type        : <0xfd>
    <7b7>   DW_AT_data_member_location: 68
 <2><7b8>: Abbrev Number: 3 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x2d6f6): xTaskSpecificTimer
    <7bd>   DW_AT_decl_file   : 1
    <7bd>   DW_AT_decl_line   : 111
    <7be>   DW_AT_decl_column : 16
    <7bf>   DW_AT_type        : <0x195>
    <7c3>   DW_AT_data_member_location: 72
 <2><7c4>: Abbrev Number: 3 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x8127c): xUsFromIdealRelease
    <7c9>   DW_AT_decl_file   : 1
    <7c9>   DW_AT_decl_line   : 117
    <7ca>   DW_AT_decl_column : 10
    <7cb>   DW_AT_type        : <0xb8>
    <7cf>   DW_AT_data_member_location: 76
 <2><7d0>: Abbrev Number: 3 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0x2df4d): xNumOfIterations
    <7d5>   DW_AT_decl_file   : 1
    <7d5>   DW_AT_decl_line   : 118
    <7d6>   DW_AT_decl_column : 11
    <7d7>   DW_AT_type        : <0xc4>
    <7db>   DW_AT_data_member_location: 80
 <2><7dc>: Abbrev Number: 3 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x4048f): xUsAverageReleaseGap
    <7e1>   DW_AT_decl_file   : 1
    <7e1>   DW_AT_decl_line   : 119
    <7e2>   DW_AT_decl_column : 10
    <7e3>   DW_AT_type        : <0xb8>
    <7e7>   DW_AT_data_member_location: 84
 <2><7e8>: Abbrev Number: 3 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x7bf4d): xTaskInterarrivalTime
    <7ed>   DW_AT_decl_file   : 1
    <7ed>   DW_AT_decl_line   : 124
    <7ee>   DW_AT_decl_column : 13
    <7ef>   DW_AT_type        : <0x11f>
    <7f3>   DW_AT_data_member_location: 88
 <2><7f4>: Abbrev Number: 3 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x42c08): xInterarrivalTimerRunning
    <7f9>   DW_AT_decl_file   : 1
    <7f9>   DW_AT_decl_line   : 125
    <7fa>   DW_AT_decl_column : 13
    <7fb>   DW_AT_type        : <0xfd>
    <7ff>   DW_AT_data_member_location: 92
 <2><800>: Abbrev Number: 3 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x3c703): xJobCalled
    <805>   DW_AT_decl_file   : 1
    <805>   DW_AT_decl_line   : 126
    <806>   DW_AT_decl_column : 13
    <807>   DW_AT_type        : <0xfd>
    <80b>   DW_AT_data_member_location: 96
 <2><80c>: Abbrev Number: 0
 <1><80d>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <80e>   DW_AT_byte_size   : 4
    <80e>   DW_AT_type        : <0x146>
 <1><812>: Abbrev Number: 9 (DW_TAG_const_type)
    <813>   DW_AT_type        : <0x80d>
 <1><817>: Abbrev Number: 4 (DW_TAG_typedef)
    <818>   DW_AT_name        : (indirect string, offset: 0x89664): extTCB_t
    <81c>   DW_AT_decl_file   : 1
    <81d>   DW_AT_decl_line   : 128
    <81e>   DW_AT_decl_column : 3
    <81f>   DW_AT_type        : <0x6d3>
 <1><823>: Abbrev Number: 39 (DW_TAG_subprogram)
    <824>   DW_AT_external    : 1
    <824>   DW_AT_name        : (indirect string, offset: 0x51f74): vTaskStartScheduler
    <828>   DW_AT_decl_file   : 7
    <829>   DW_AT_decl_line   : 1180
    <82b>   DW_AT_decl_column : 6
    <82c>   DW_AT_prototyped  : 1
    <82c>   DW_AT_declaration : 1
 <1><82c>: Abbrev Number: 25 (DW_TAG_subprogram)
    <82d>   DW_AT_external    : 1
    <82d>   DW_AT_name        : (indirect string, offset: 0x5345f): vPortExitCritical
    <831>   DW_AT_decl_file   : 2
    <831>   DW_AT_decl_line   : 98
    <832>   DW_AT_decl_column : 13
    <832>   DW_AT_prototyped  : 1
    <832>   DW_AT_declaration : 1
 <1><832>: Abbrev Number: 25 (DW_TAG_subprogram)
    <833>   DW_AT_external    : 1
    <833>   DW_AT_name        : (indirect string, offset: 0x85f6c): vPortEnterCritical
    <837>   DW_AT_decl_file   : 2
    <837>   DW_AT_decl_line   : 97
    <838>   DW_AT_decl_column : 13
    <838>   DW_AT_prototyped  : 1
    <838>   DW_AT_declaration : 1
 <1><838>: Abbrev Number: 14 (DW_TAG_subprogram)
    <839>   DW_AT_external    : 1
    <839>   DW_AT_name        : (indirect string, offset: 0x368da): xTaskNotifyWait
    <83d>   DW_AT_decl_file   : 7
    <83e>   DW_AT_decl_line   : 2021
    <840>   DW_AT_decl_column : 12
    <841>   DW_AT_prototyped  : 1
    <841>   DW_AT_type        : <0xfd>
    <845>   DW_AT_declaration : 1
    <845>   DW_AT_sibling     : <0x85e>
 <2><849>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84a>   DW_AT_type        : <0xc4>
 <2><84e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84f>   DW_AT_type        : <0xc4>
 <2><853>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <854>   DW_AT_type        : <0x85e>
 <2><858>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <859>   DW_AT_type        : <0x11f>
 <2><85d>: Abbrev Number: 0
 <1><85e>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <85f>   DW_AT_byte_size   : 4
    <85f>   DW_AT_type        : <0xc4>
 <1><863>: Abbrev Number: 14 (DW_TAG_subprogram)
    <864>   DW_AT_external    : 1
    <864>   DW_AT_name        : (indirect string, offset: 0x43a32): xTaskGenericNotify
    <868>   DW_AT_decl_file   : 7
    <869>   DW_AT_decl_line   : 1853
    <86b>   DW_AT_decl_column : 12
    <86c>   DW_AT_prototyped  : 1
    <86c>   DW_AT_type        : <0xfd>
    <870>   DW_AT_declaration : 1
    <870>   DW_AT_sibling     : <0x889>
 <2><874>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <875>   DW_AT_type        : <0x146>
 <2><879>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <87a>   DW_AT_type        : <0xc4>
 <2><87e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <87f>   DW_AT_type        : <0x189>
 <2><883>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <884>   DW_AT_type        : <0x85e>
 <2><888>: Abbrev Number: 0
 <1><889>: Abbrev Number: 14 (DW_TAG_subprogram)
    <88a>   DW_AT_external    : 1
    <88a>   DW_AT_name        : (indirect string, offset: 0x27aca): pvTimerGetTimerID
    <88e>   DW_AT_decl_file   : 8
    <88f>   DW_AT_decl_line   : 386
    <891>   DW_AT_decl_column : 7
    <892>   DW_AT_prototyped  : 1
    <892>   DW_AT_type        : <0xf6>
    <896>   DW_AT_declaration : 1
    <896>   DW_AT_sibling     : <0x8a0>
 <2><89a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89b>   DW_AT_type        : <0x1a1>
 <2><89f>: Abbrev Number: 0
 <1><8a0>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8a1>   DW_AT_external    : 1
    <8a1>   DW_AT_name        : (indirect string, offset: 0x66528): pvTaskGetThreadLocalStoragePointer
    <8a5>   DW_AT_decl_file   : 7
    <8a6>   DW_AT_decl_line   : 1518
    <8a8>   DW_AT_decl_column : 8
    <8a9>   DW_AT_prototyped  : 1
    <8a9>   DW_AT_type        : <0xf6>
    <8ad>   DW_AT_declaration : 1
    <8ad>   DW_AT_sibling     : <0x8bc>
 <2><8b1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8b2>   DW_AT_type        : <0x146>
 <2><8b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8b7>   DW_AT_type        : <0xfd>
 <2><8bb>: Abbrev Number: 0
 <1><8bc>: Abbrev Number: 18 (DW_TAG_subprogram)
    <8bd>   DW_AT_external    : 1
    <8bd>   DW_AT_name        : (indirect string, offset: 0x64602): xTaskGetCurrentTaskHandle
    <8c1>   DW_AT_decl_file   : 7
    <8c2>   DW_AT_decl_line   : 2438
    <8c4>   DW_AT_decl_column : 14
    <8c5>   DW_AT_prototyped  : 1
    <8c5>   DW_AT_type        : <0x146>
    <8c9>   DW_AT_declaration : 1
 <1><8c9>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8ca>   DW_AT_external    : 1
    <8ca>   DW_AT_name        : (indirect string, offset: 0x8a057): ulTaskNotifyTake
    <8ce>   DW_AT_decl_file   : 7
    <8cf>   DW_AT_decl_line   : 2191
    <8d1>   DW_AT_decl_column : 10
    <8d2>   DW_AT_prototyped  : 1
    <8d2>   DW_AT_type        : <0xc4>
    <8d6>   DW_AT_declaration : 1
    <8d6>   DW_AT_sibling     : <0x8e5>
 <2><8da>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8db>   DW_AT_type        : <0xfd>
 <2><8df>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8e0>   DW_AT_type        : <0x11f>
 <2><8e4>: Abbrev Number: 0
 <1><8e5>: Abbrev Number: 40 (DW_TAG_subprogram)
    <8e6>   DW_AT_external    : 1
    <8e6>   DW_AT_name        : (indirect string, offset: 0x59da8): vTaskSetThreadLocalStoragePointer
    <8ea>   DW_AT_decl_file   : 7
    <8eb>   DW_AT_decl_line   : 1517
    <8ed>   DW_AT_decl_column : 7
    <8ee>   DW_AT_prototyped  : 1
    <8ee>   DW_AT_declaration : 1
    <8ee>   DW_AT_sibling     : <0x902>
 <2><8f2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8f3>   DW_AT_type        : <0x146>
 <2><8f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8f8>   DW_AT_type        : <0xfd>
 <2><8fc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8fd>   DW_AT_type        : <0xf6>
 <2><901>: Abbrev Number: 0
 <1><902>: Abbrev Number: 14 (DW_TAG_subprogram)
    <903>   DW_AT_external    : 1
    <903>   DW_AT_name        : (indirect string, offset: 0x7c86a): xTimerGenericCommand
    <907>   DW_AT_decl_file   : 8
    <908>   DW_AT_decl_line   : 1296
    <90a>   DW_AT_decl_column : 12
    <90b>   DW_AT_prototyped  : 1
    <90b>   DW_AT_type        : <0xfd>
    <90f>   DW_AT_declaration : 1
    <90f>   DW_AT_sibling     : <0x92d>
 <2><913>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <914>   DW_AT_type        : <0x195>
 <2><918>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <919>   DW_AT_type        : <0x109>
 <2><91d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <91e>   DW_AT_type        : <0x12b>
 <2><922>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <923>   DW_AT_type        : <0x932>
 <2><927>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <928>   DW_AT_type        : <0x12b>
 <2><92c>: Abbrev Number: 0
 <1><92d>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <92e>   DW_AT_byte_size   : 4
    <92e>   DW_AT_type        : <0xfd>
 <1><932>: Abbrev Number: 9 (DW_TAG_const_type)
    <933>   DW_AT_type        : <0x92d>
 <1><937>: Abbrev Number: 18 (DW_TAG_subprogram)
    <938>   DW_AT_external    : 1
    <938>   DW_AT_name        : (indirect string, offset: 0x4656): xTaskGetTickCount
    <93c>   DW_AT_decl_file   : 7
    <93d>   DW_AT_decl_line   : 1356
    <93f>   DW_AT_decl_column : 12
    <940>   DW_AT_prototyped  : 1
    <940>   DW_AT_type        : <0x11f>
    <944>   DW_AT_declaration : 1
 <1><944>: Abbrev Number: 26 (DW_TAG_subprogram)
    <945>   DW_AT_external    : 1
    <945>   DW_AT_name        : (indirect string, offset: 0x87ae3): xTimerCreate
    <949>   DW_AT_decl_file   : 8
    <94a>   DW_AT_decl_line   : 228
    <94b>   DW_AT_decl_column : 16
    <94c>   DW_AT_prototyped  : 1
    <94c>   DW_AT_type        : <0x195>
    <950>   DW_AT_declaration : 1
    <950>   DW_AT_sibling     : <0x96e>
 <2><954>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <955>   DW_AT_type        : <0x141>
 <2><959>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <95a>   DW_AT_type        : <0x12b>
 <2><95e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <95f>   DW_AT_type        : <0x11a>
 <2><963>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <964>   DW_AT_type        : <0xf8>
 <2><968>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <969>   DW_AT_type        : <0x1b0>
 <2><96d>: Abbrev Number: 0
 <1><96e>: Abbrev Number: 26 (DW_TAG_subprogram)
    <96f>   DW_AT_external    : 1
    <96f>   DW_AT_name        : (indirect string, offset: 0x8c974): pvPortMalloc
    <973>   DW_AT_decl_file   : 11
    <974>   DW_AT_decl_line   : 163
    <975>   DW_AT_decl_column : 7
    <976>   DW_AT_prototyped  : 1
    <976>   DW_AT_type        : <0xf6>
    <97a>   DW_AT_declaration : 1
    <97a>   DW_AT_sibling     : <0x984>
 <2><97e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <97f>   DW_AT_type        : <0x31>
 <2><983>: Abbrev Number: 0
 <1><984>: Abbrev Number: 14 (DW_TAG_subprogram)
    <985>   DW_AT_external    : 1
    <985>   DW_AT_name        : (indirect string, offset: 0x6a43e): xTaskCreate
    <989>   DW_AT_decl_file   : 7
    <98a>   DW_AT_decl_line   : 330
    <98c>   DW_AT_decl_column : 13
    <98d>   DW_AT_prototyped  : 1
    <98d>   DW_AT_type        : <0xfd>
    <991>   DW_AT_declaration : 1
    <991>   DW_AT_sibling     : <0x9b4>
 <2><995>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <996>   DW_AT_type        : <0xda>
 <2><99a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99b>   DW_AT_type        : <0x141>
 <2><99f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9a0>   DW_AT_type        : <0xb3>
 <2><9a4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9a5>   DW_AT_type        : <0xf8>
 <2><9a9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9aa>   DW_AT_type        : <0x10e>
 <2><9ae>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9af>   DW_AT_type        : <0x812>
 <2><9b3>: Abbrev Number: 0
 <1><9b4>: Abbrev Number: 18 (DW_TAG_subprogram)
    <9b5>   DW_AT_external    : 1
    <9b5>   DW_AT_name        : (indirect string, offset: 0xe076): HAL_RCC_GetPCLK1Freq
    <9b9>   DW_AT_decl_file   : 12
    <9ba>   DW_AT_decl_line   : 1260
    <9bc>   DW_AT_decl_column : 10
    <9bd>   DW_AT_prototyped  : 1
    <9bd>   DW_AT_type        : <0xc4>
    <9c1>   DW_AT_declaration : 1
 <1><9c1>: Abbrev Number: 41 (DW_TAG_subprogram)
    <9c2>   DW_AT_external    : 1
    <9c2>   DW_AT_name        : (indirect string, offset: 0x83e3f): vMSTSchedulerStart
    <9c6>   DW_AT_decl_file   : 1
    <9c7>   DW_AT_decl_line   : 437
    <9c9>   DW_AT_decl_column : 6
    <9ca>   DW_AT_prototyped  : 1
    <9ca>   DW_AT_low_pc      : 0x8000b24
    <9ce>   DW_AT_high_pc     : 0x10
    <9d2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d4>   DW_AT_call_all_tail_calls: 1
 <1><9d4>: Abbrev Number: 27 (DW_TAG_subprogram)
    <9d5>   DW_AT_external    : 1
    <9d5>   DW_AT_name        : (indirect string, offset: 0x81b00): vMSTSporadicTaskRun
    <9d9>   DW_AT_decl_file   : 1
    <9d9>   DW_AT_decl_line   : 418
    <9db>   DW_AT_decl_column : 12
    <9db>   DW_AT_prototyped  : 1
    <9db>   DW_AT_type        : <0xfd>
    <9df>   DW_AT_low_pc      : 0x8000ae8
    <9e3>   DW_AT_high_pc     : 0x3c
    <9e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9e9>   DW_AT_call_all_tail_calls: 1
    <9e9>   DW_AT_sibling     : <0xa1b>
 <2><9ed>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x74f80): pxTaskToRunHandle
    <9f2>   DW_AT_decl_file   : 1
    <9f2>   DW_AT_decl_line   : 418
    <9f4>   DW_AT_decl_column : 46
    <9f5>   DW_AT_type        : <0x80d>
    <9f9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9fc>: Abbrev Number: 12 (DW_TAG_variable)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x13ed7): xCurrExtTCB
    <a01>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 423
    <a03>   DW_AT_decl_column : 12
    <a04>   DW_AT_type        : <0xa1b>
    <a08>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a0b>: Abbrev Number: 12 (DW_TAG_variable)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x306a5): giver
    <a10>   DW_AT_decl_file   : 1
    <a10>   DW_AT_decl_line   : 425
    <a12>   DW_AT_decl_column : 33
    <a13>   DW_AT_type        : <0x6b8>
    <a17>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><a1a>: Abbrev Number: 0
 <1><a1b>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <a1c>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0x817>
 <1><a20>: Abbrev Number: 19 (DW_TAG_subprogram)
    <a21>   DW_AT_name        : (indirect string, offset: 0x8409): prvMSTSporadicGenericJob
    <a25>   DW_AT_decl_file   : 1
    <a25>   DW_AT_decl_line   : 359
    <a27>   DW_AT_decl_column : 13
    <a27>   DW_AT_prototyped  : 1
    <a27>   DW_AT_low_pc      : 0x80009c0
    <a2b>   DW_AT_high_pc     : 0x128
    <a2f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a31>   DW_AT_call_all_tail_calls: 1
    <a31>   DW_AT_sibling     : <0xac1>
 <2><a35>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a36>   DW_AT_name        : (indirect string, offset: 0x69e9): pvParameters
    <a3a>   DW_AT_decl_file   : 1
    <a3a>   DW_AT_decl_line   : 359
    <a3c>   DW_AT_decl_column : 44
    <a3d>   DW_AT_type        : <0xf6>
    <a41>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><a44>: Abbrev Number: 12 (DW_TAG_variable)
    <a45>   DW_AT_name        : (indirect string, offset: 0x551b3): xCurrentHandle
    <a49>   DW_AT_decl_file   : 1
    <a49>   DW_AT_decl_line   : 361
    <a4b>   DW_AT_decl_column : 15
    <a4c>   DW_AT_type        : <0x146>
    <a50>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a53>: Abbrev Number: 12 (DW_TAG_variable)
    <a54>   DW_AT_name        : (indirect string, offset: 0x13ed7): xCurrExtTCB
    <a58>   DW_AT_decl_file   : 1
    <a58>   DW_AT_decl_line   : 362
    <a5a>   DW_AT_decl_column : 12
    <a5b>   DW_AT_type        : <0xa1b>
    <a5f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a62>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <a63>   DW_AT_low_pc      : 0x80009f6
    <a67>   DW_AT_high_pc     : 0xe4
    <a6b>   DW_AT_sibling     : <0xaa7>
 <3><a6f>: Abbrev Number: 12 (DW_TAG_variable)
    <a70>   DW_AT_name        : (indirect string, offset: 0x2c845): notificationGiver
    <a74>   DW_AT_decl_file   : 1
    <a74>   DW_AT_decl_line   : 374
    <a76>   DW_AT_decl_column : 12
    <a77>   DW_AT_type        : <0xc4>
    <a7b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><a7e>: Abbrev Number: 12 (DW_TAG_variable)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x970d0): xTimer
    <a83>   DW_AT_decl_file   : 1
    <a83>   DW_AT_decl_line   : 394
    <a85>   DW_AT_decl_column : 17
    <a86>   DW_AT_type        : <0x195>
    <a8a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><a8d>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <a8e>   DW_AT_abstract_origin: <0xe09>
    <a92>   DW_AT_low_pc      : 0x8000a7e
    <a96>   DW_AT_high_pc     : 0x14
    <a9a>   DW_AT_call_file   : 1
    <a9a>   DW_AT_call_line   : 400
    <a9c>   DW_AT_call_column : 3
 <4><a9d>: Abbrev Number: 17 (DW_TAG_variable)
    <a9e>   DW_AT_abstract_origin: <0xe12>
    <aa2>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><aa5>: Abbrev Number: 0
 <3><aa6>: Abbrev Number: 0
 <2><aa7>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <aa8>   DW_AT_abstract_origin: <0xe09>
    <aac>   DW_AT_low_pc      : 0x80009de
    <ab0>   DW_AT_high_pc     : 0x14
    <ab4>   DW_AT_call_file   : 1
    <ab4>   DW_AT_call_line   : 364
    <ab6>   DW_AT_call_column : 2
 <3><ab7>: Abbrev Number: 17 (DW_TAG_variable)
    <ab8>   DW_AT_abstract_origin: <0xe12>
    <abc>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><abf>: Abbrev Number: 0
 <2><ac0>: Abbrev Number: 0
 <1><ac1>: Abbrev Number: 27 (DW_TAG_subprogram)
    <ac2>   DW_AT_external    : 1
    <ac2>   DW_AT_name        : (indirect string, offset: 0x9d75): vMSTSporadicTaskCreate
    <ac6>   DW_AT_decl_file   : 1
    <ac6>   DW_AT_decl_line   : 317
    <ac8>   DW_AT_decl_column : 12
    <ac8>   DW_AT_prototyped  : 1
    <ac8>   DW_AT_type        : <0xfd>
    <acc>   DW_AT_low_pc      : 0x800092c
    <ad0>   DW_AT_high_pc     : 0x94
    <ad4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ad6>   DW_AT_call_all_tail_calls: 1
    <ad6>   DW_AT_sibling     : <0xb75>
 <2><ada>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <adb>   DW_AT_name        : (indirect string, offset: 0x3a99a): pvJobCode
    <adf>   DW_AT_decl_file   : 1
    <adf>   DW_AT_decl_line   : 317
    <ae1>   DW_AT_decl_column : 50
    <ae2>   DW_AT_type        : <0xda>
    <ae6>   DW_AT_location    : 3 byte block: 91 8c 7f 	(DW_OP_fbreg: -116)
 <2><aea>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x41440): pcName
    <aef>   DW_AT_decl_file   : 1
    <aef>   DW_AT_decl_line   : 317
    <af1>   DW_AT_decl_column : 73
    <af2>   DW_AT_type        : <0x13c>
    <af6>   DW_AT_location    : 3 byte block: 91 88 7f 	(DW_OP_fbreg: -120)
 <2><afa>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <afb>   DW_AT_name        : (indirect string, offset: 0x69cff): usStackDepth
    <aff>   DW_AT_decl_file   : 1
    <aff>   DW_AT_decl_line   : 318
    <b01>   DW_AT_decl_column : 12
    <b02>   DW_AT_type        : <0xa7>
    <b06>   DW_AT_location    : 3 byte block: 91 86 7f 	(DW_OP_fbreg: -122)
 <2><b0a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x69e9): pvParameters
    <b0f>   DW_AT_decl_file   : 1
    <b0f>   DW_AT_decl_line   : 318
    <b11>   DW_AT_decl_column : 32
    <b12>   DW_AT_type        : <0xf6>
    <b16>   DW_AT_location    : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <2><b1a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x2aa9f): uxPriority
    <b1f>   DW_AT_decl_file   : 1
    <b1f>   DW_AT_decl_line   : 318
    <b21>   DW_AT_decl_column : 58
    <b22>   DW_AT_type        : <0x10e>
    <b26>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><b29>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b2a>   DW_AT_name        : (indirect string, offset: 0x4508f): pxCreatedTask
    <b2e>   DW_AT_decl_file   : 1
    <b2e>   DW_AT_decl_line   : 319
    <b30>   DW_AT_decl_column : 17
    <b31>   DW_AT_type        : <0x80d>
    <b35>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><b38>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b39>   DW_AT_name        : (indirect string, offset: 0x7bf4d): xTaskInterarrivalTime
    <b3d>   DW_AT_decl_file   : 1
    <b3d>   DW_AT_decl_line   : 321
    <b3f>   DW_AT_decl_column : 14
    <b40>   DW_AT_type        : <0x11f>
    <b44>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><b47>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b48>   DW_AT_name        : (indirect string, offset: 0x6bc18): xTaskDeadline
    <b4c>   DW_AT_decl_file   : 1
    <b4c>   DW_AT_decl_line   : 321
    <b4e>   DW_AT_decl_column : 48
    <b4f>   DW_AT_type        : <0x11f>
    <b53>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><b56>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b57>   DW_AT_name        : (indirect string, offset: 0x26d7c): xTaskWCET
    <b5b>   DW_AT_decl_file   : 1
    <b5b>   DW_AT_decl_line   : 322
    <b5d>   DW_AT_decl_column : 14
    <b5e>   DW_AT_type        : <0x11f>
    <b62>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
 <2><b65>: Abbrev Number: 12 (DW_TAG_variable)
    <b66>   DW_AT_name        : (indirect string, offset: 0x759f1): xNewExtTCB
    <b6a>   DW_AT_decl_file   : 1
    <b6a>   DW_AT_decl_line   : 324
    <b6c>   DW_AT_decl_column : 12
    <b6d>   DW_AT_type        : <0xa1b>
    <b71>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b74>: Abbrev Number: 0
 <1><b75>: Abbrev Number: 19 (DW_TAG_subprogram)
    <b76>   DW_AT_name        : (indirect string, offset: 0x3a95d): prvMSTSporadicTimerCallback
    <b7a>   DW_AT_decl_file   : 1
    <b7a>   DW_AT_decl_line   : 306
    <b7c>   DW_AT_decl_column : 13
    <b7c>   DW_AT_prototyped  : 1
    <b7c>   DW_AT_low_pc      : 0x8000902
    <b80>   DW_AT_high_pc     : 0x2a
    <b84>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b86>   DW_AT_call_all_tail_calls: 1
    <b86>   DW_AT_sibling     : <0xbb8>
 <2><b8a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x970d0): xTimer
    <b8f>   DW_AT_decl_file   : 1
    <b8f>   DW_AT_decl_line   : 306
    <b91>   DW_AT_decl_column : 55
    <b92>   DW_AT_type        : <0x195>
    <b96>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b99>: Abbrev Number: 12 (DW_TAG_variable)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x7cb17): param
    <b9e>   DW_AT_decl_file   : 1
    <b9e>   DW_AT_decl_line   : 310
    <ba0>   DW_AT_decl_column : 16
    <ba1>   DW_AT_type        : <0x80d>
    <ba5>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ba8>: Abbrev Number: 12 (DW_TAG_variable)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x306a5): giver
    <bad>   DW_AT_decl_file   : 1
    <bad>   DW_AT_decl_line   : 311
    <baf>   DW_AT_decl_column : 33
    <bb0>   DW_AT_type        : <0x6b8>
    <bb4>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><bb7>: Abbrev Number: 0
 <1><bb8>: Abbrev Number: 19 (DW_TAG_subprogram)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x46288): prvMSTPeriodicTimerCallback
    <bbd>   DW_AT_decl_file   : 1
    <bbd>   DW_AT_decl_line   : 296
    <bbf>   DW_AT_decl_column : 13
    <bbf>   DW_AT_prototyped  : 1
    <bbf>   DW_AT_low_pc      : 0x80008dc
    <bc3>   DW_AT_high_pc     : 0x26
    <bc7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc9>   DW_AT_call_all_tail_calls: 1
    <bc9>   DW_AT_sibling     : <0xbec>
 <2><bcd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bce>   DW_AT_name        : (indirect string, offset: 0x970d0): xTimer
    <bd2>   DW_AT_decl_file   : 1
    <bd2>   DW_AT_decl_line   : 296
    <bd4>   DW_AT_decl_column : 55
    <bd5>   DW_AT_type        : <0x195>
    <bd9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><bdc>: Abbrev Number: 12 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x7cb17): param
    <be1>   DW_AT_decl_file   : 1
    <be1>   DW_AT_decl_line   : 301
    <be3>   DW_AT_decl_column : 16
    <be4>   DW_AT_type        : <0x80d>
    <be8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><beb>: Abbrev Number: 0
 <1><bec>: Abbrev Number: 42 (DW_TAG_subprogram)
    <bed>   DW_AT_name        : (indirect string, offset: 0xa256): prvMSTPeriodicGenericJob
    <bf1>   DW_AT_decl_file   : 1
    <bf2>   DW_AT_decl_line   : 189
    <bf3>   DW_AT_decl_column : 13
    <bf4>   DW_AT_prototyped  : 1
    <bf4>   DW_AT_low_pc      : 0x80007a0
    <bf8>   DW_AT_high_pc     : 0x13c
    <bfc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bfe>   DW_AT_call_all_tail_calls: 1
    <bfe>   DW_AT_sibling     : <0xc61>
 <2><c02>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c03>   DW_AT_name        : (indirect string, offset: 0x69e9): pvParameters
    <c07>   DW_AT_decl_file   : 1
    <c07>   DW_AT_decl_line   : 189
    <c08>   DW_AT_decl_column : 44
    <c09>   DW_AT_type        : <0xf6>
    <c0d>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><c10>: Abbrev Number: 10 (DW_TAG_variable)
    <c11>   DW_AT_name        : (indirect string, offset: 0x551b3): xCurrentHandle
    <c15>   DW_AT_decl_file   : 1
    <c15>   DW_AT_decl_line   : 199
    <c16>   DW_AT_decl_column : 15
    <c17>   DW_AT_type        : <0x146>
    <c1b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c1e>: Abbrev Number: 10 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x13ed7): xCurrExtTCB
    <c23>   DW_AT_decl_file   : 1
    <c23>   DW_AT_decl_line   : 200
    <c24>   DW_AT_decl_column : 12
    <c25>   DW_AT_type        : <0xa1b>
    <c29>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c2c>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <c2d>   DW_AT_low_pc      : 0x8000832
    <c31>   DW_AT_high_pc     : 0xa2
    <c35>   DW_AT_sibling     : <0xc48>
 <3><c39>: Abbrev Number: 10 (DW_TAG_variable)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x56a26): perfRelease
    <c3e>   DW_AT_decl_file   : 1
    <c3e>   DW_AT_decl_line   : 241
    <c3f>   DW_AT_decl_column : 14
    <c40>   DW_AT_type        : <0xc4>
    <c44>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><c47>: Abbrev Number: 0
 <2><c48>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <c49>   DW_AT_abstract_origin: <0xe09>
    <c4d>   DW_AT_low_pc      : 0x80007c8
    <c51>   DW_AT_high_pc     : 0x14
    <c55>   DW_AT_call_file   : 1
    <c55>   DW_AT_call_line   : 205
    <c56>   DW_AT_call_column : 2
 <3><c57>: Abbrev Number: 17 (DW_TAG_variable)
    <c58>   DW_AT_abstract_origin: <0xe12>
    <c5c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><c5f>: Abbrev Number: 0
 <2><c60>: Abbrev Number: 0
 <1><c61>: Abbrev Number: 43 (DW_TAG_subprogram)
    <c62>   DW_AT_external    : 1
    <c62>   DW_AT_name        : (indirect string, offset: 0x26e68): vMSTPeriodicTaskCreate
    <c66>   DW_AT_decl_file   : 1
    <c67>   DW_AT_decl_line   : 130
    <c68>   DW_AT_decl_column : 14
    <c69>   DW_AT_prototyped  : 1
    <c69>   DW_AT_type        : <0x146>
    <c6d>   DW_AT_low_pc      : 0x800068c
    <c71>   DW_AT_high_pc     : 0x114
    <c75>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c77>   DW_AT_call_all_tail_calls: 1
    <c77>   DW_AT_sibling     : <0xd4a>
 <2><c7b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x3a99a): pvJobCode
    <c80>   DW_AT_decl_file   : 1
    <c80>   DW_AT_decl_line   : 130
    <c81>   DW_AT_decl_column : 52
    <c82>   DW_AT_type        : <0xda>
    <c86>   DW_AT_location    : 3 byte block: 91 84 7f 	(DW_OP_fbreg: -124)
 <2><c8a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x41440): pcName
    <c8f>   DW_AT_decl_file   : 1
    <c8f>   DW_AT_decl_line   : 131
    <c90>   DW_AT_decl_column : 15
    <c91>   DW_AT_type        : <0x13c>
    <c95>   DW_AT_location    : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <2><c99>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x69cff): usStackDepth
    <c9e>   DW_AT_decl_file   : 1
    <c9e>   DW_AT_decl_line   : 131
    <c9f>   DW_AT_decl_column : 32
    <ca0>   DW_AT_type        : <0xa7>
    <ca4>   DW_AT_location    : 3 byte block: 91 fe 7e 	(DW_OP_fbreg: -130)
 <2><ca8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x69e9): pvParameters
    <cad>   DW_AT_decl_file   : 1
    <cad>   DW_AT_decl_line   : 131
    <cae>   DW_AT_decl_column : 52
    <caf>   DW_AT_type        : <0xf6>
    <cb3>   DW_AT_location    : 3 byte block: 91 f8 7e 	(DW_OP_fbreg: -136)
 <2><cb7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x2aa9f): uxPriority
    <cbc>   DW_AT_decl_file   : 1
    <cbc>   DW_AT_decl_line   : 132
    <cbd>   DW_AT_decl_column : 15
    <cbe>   DW_AT_type        : <0x10e>
    <cc2>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><cc5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x4508f): pxCreatedTask
    <cca>   DW_AT_decl_file   : 1
    <cca>   DW_AT_decl_line   : 132
    <ccb>   DW_AT_decl_column : 41
    <ccc>   DW_AT_type        : <0x80d>
    <cd0>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><cd3>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x572f9): xTaskPeriod
    <cd8>   DW_AT_decl_file   : 1
    <cd8>   DW_AT_decl_line   : 134
    <cd9>   DW_AT_decl_column : 14
    <cda>   DW_AT_type        : <0x11f>
    <cde>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><ce1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x6bc18): xTaskDeadline
    <ce6>   DW_AT_decl_file   : 1
    <ce6>   DW_AT_decl_line   : 134
    <ce7>   DW_AT_decl_column : 38
    <ce8>   DW_AT_type        : <0x11f>
    <cec>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><cef>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x3ebb8): xTaskPhase
    <cf4>   DW_AT_decl_file   : 1
    <cf4>   DW_AT_decl_line   : 134
    <cf5>   DW_AT_decl_column : 64
    <cf6>   DW_AT_type        : <0x11f>
    <cfa>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
 <2><cfd>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x26d7c): xTaskWCET
    <d02>   DW_AT_decl_file   : 1
    <d02>   DW_AT_decl_line   : 135
    <d03>   DW_AT_decl_column : 14
    <d04>   DW_AT_type        : <0x11f>
    <d08>   DW_AT_location    : 2 byte block: 91 14 	(DW_OP_fbreg: 20)
 <2><d0b>: Abbrev Number: 10 (DW_TAG_variable)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x759f1): xNewExtTCB
    <d10>   DW_AT_decl_file   : 1
    <d10>   DW_AT_decl_line   : 137
    <d11>   DW_AT_decl_column : 12
    <d12>   DW_AT_type        : <0xa1b>
    <d16>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d19>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <d1a>   DW_AT_low_pc      : 0x80006ba
    <d1e>   DW_AT_high_pc     : 0xca
 <3><d22>: Abbrev Number: 10 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x970d0): xTimer
    <d27>   DW_AT_decl_file   : 1
    <d27>   DW_AT_decl_line   : 163
    <d28>   DW_AT_decl_column : 21
    <d29>   DW_AT_type        : <0x195>
    <d2d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><d30>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <d31>   DW_AT_abstract_origin: <0xe09>
    <d35>   DW_AT_low_pc      : 0x800075e
    <d39>   DW_AT_high_pc     : 0x14
    <d3d>   DW_AT_call_file   : 1
    <d3d>   DW_AT_call_line   : 170
    <d3e>   DW_AT_call_column : 7
 <4><d3f>: Abbrev Number: 17 (DW_TAG_variable)
    <d40>   DW_AT_abstract_origin: <0xe12>
    <d44>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><d47>: Abbrev Number: 0
 <3><d48>: Abbrev Number: 0
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 32 (DW_TAG_subprogram)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x475cd): prvMSTGetUS
    <d4f>   DW_AT_decl_file   : 1
    <d4f>   DW_AT_decl_line   : 31
    <d50>   DW_AT_decl_column : 17
    <d51>   DW_AT_type        : <0xc4>
    <d55>   DW_AT_low_pc      : 0x800062c
    <d59>   DW_AT_high_pc     : 0x60
    <d5d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5f>   DW_AT_call_all_tail_calls: 1
    <d5f>   DW_AT_sibling     : <0xdab>
 <2><d63>: Abbrev Number: 44 (DW_TAG_variable)
    <d64>   DW_AT_name        : out
    <d68>   DW_AT_decl_file   : 1
    <d69>   DW_AT_decl_line   : 32
    <d6a>   DW_AT_decl_column : 11
    <d6b>   DW_AT_type        : <0xc4>
    <d6f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d72>: Abbrev Number: 10 (DW_TAG_variable)
    <d73>   DW_AT_name        : (indirect string, offset: 0x2dbb0): clckFreq
    <d77>   DW_AT_decl_file   : 1
    <d77>   DW_AT_decl_line   : 33
    <d78>   DW_AT_decl_column : 13
    <d79>   DW_AT_type        : <0xfd>
    <d7d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d80>: Abbrev Number: 10 (DW_TAG_variable)
    <d81>   DW_AT_name        : (indirect string, offset: 0x610b9): countFreq
    <d85>   DW_AT_decl_file   : 1
    <d85>   DW_AT_decl_line   : 34
    <d86>   DW_AT_decl_column : 13
    <d87>   DW_AT_type        : <0xfd>
    <d8b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d8e>: Abbrev Number: 10 (DW_TAG_variable)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x87054): timing
    <d93>   DW_AT_decl_file   : 1
    <d93>   DW_AT_decl_line   : 35
    <d94>   DW_AT_decl_column : 8
    <d95>   DW_AT_type        : <0xdab>
    <d99>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d9c>: Abbrev Number: 10 (DW_TAG_variable)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x6d673): outUS
    <da1>   DW_AT_decl_file   : 1
    <da1>   DW_AT_decl_line   : 36
    <da2>   DW_AT_decl_column : 11
    <da3>   DW_AT_type        : <0xc4>
    <da7>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><daa>: Abbrev Number: 0
 <1><dab>: Abbrev Number: 7 (DW_TAG_base_type)
    <dac>   DW_AT_byte_size   : 4
    <dad>   DW_AT_encoding    : 4	(float)
    <dae>   DW_AT_name        : (indirect string, offset: 0x78083): float
 <1><db2>: Abbrev Number: 32 (DW_TAG_subprogram)
    <db3>   DW_AT_name        : (indirect string, offset: 0x84524): prvMSTSetupUSClock
    <db7>   DW_AT_decl_file   : 1
    <db7>   DW_AT_decl_line   : 18
    <db8>   DW_AT_decl_column : 14
    <db9>   DW_AT_type        : <0xdab>
    <dbd>   DW_AT_low_pc      : 0x8000590
    <dc1>   DW_AT_high_pc     : 0x9c
    <dc5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc7>   DW_AT_call_all_tail_calls: 1
    <dc7>   DW_AT_sibling     : <0xde4>
 <2><dcb>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <dcc>   DW_AT_low_pc      : 0x8000596
    <dd0>   DW_AT_high_pc     : 0x1c
 <3><dd4>: Abbrev Number: 10 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x10f2): tmpreg
    <dd9>   DW_AT_decl_file   : 1
    <dd9>   DW_AT_decl_line   : 20
    <dda>   DW_AT_decl_column : 2
    <ddb>   DW_AT_type        : <0xd0>
    <ddf>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><de2>: Abbrev Number: 0
 <2><de3>: Abbrev Number: 0
 <1><de4>: Abbrev Number: 45 (DW_TAG_subprogram)
    <de5>   DW_AT_external    : 1
    <de5>   DW_AT_name        : (indirect string, offset: 0x29de1): tstMSTGiveTimerReference
    <de9>   DW_AT_decl_file   : 1
    <dea>   DW_AT_decl_line   : 14
    <deb>   DW_AT_decl_column : 6
    <dec>   DW_AT_prototyped  : 1
    <dec>   DW_AT_low_pc      : 0x8000570
    <df0>   DW_AT_high_pc     : 0x20
    <df4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <df6>   DW_AT_call_all_calls: 1
    <df6>   DW_AT_sibling     : <0xe09>
 <2><dfa>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x8220c): fromUser
    <dff>   DW_AT_decl_file   : 1
    <dff>   DW_AT_decl_line   : 14
    <e00>   DW_AT_decl_column : 44
    <e01>   DW_AT_type        : <0x687>
    <e05>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e08>: Abbrev Number: 0
 <1><e09>: Abbrev Number: 46 (DW_TAG_subprogram)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x7360e): vPortRaiseBASEPRI
    <e0e>   DW_AT_decl_file   : 2
    <e0f>   DW_AT_decl_line   : 191
    <e10>   DW_AT_decl_column : 30
    <e11>   DW_AT_prototyped  : 1
    <e11>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><e12>: Abbrev Number: 47 (DW_TAG_variable)
    <e13>   DW_AT_name        : (indirect string, offset: 0x7efb3): ulNewBASEPRI
    <e17>   DW_AT_decl_file   : 2
    <e18>   DW_AT_decl_line   : 193
    <e19>   DW_AT_decl_column : 10
    <e1a>   DW_AT_type        : <0xc4>
 <2><e1e>: Abbrev Number: 0
 <1><e1f>: Abbrev Number: 0
  Compilation Unit @ offset 0xe20:
   Length:        0x6a8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x319
   Pointer Size:  4
 <0><e2c>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <e2d>   DW_AT_producer    : (indirect string, offset: 0x32b03): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e31>   DW_AT_language    : 29	(C11)
    <e32>   DW_AT_name        : (indirect string, offset: 0x8cf06): ../Core/Src/freertos.c
    <e36>   DW_AT_comp_dir    : (indirect string, offset: 0x6d711): /Users/enricoalberti/Desktop/STM/MST-FreeRTOS/Debug
    <e3a>   DW_AT_ranges      : 0x60
    <e3e>   DW_AT_low_pc      : 0
    <e42>   DW_AT_stmt_list   : 0xc28
    <e46>   DW_AT_macros      : 0x151e5
 <1><e4a>: Abbrev Number: 19 (DW_TAG_base_type)
    <e4b>   DW_AT_byte_size   : 4
    <e4c>   DW_AT_encoding    : 5	(signed)
    <e4d>   DW_AT_name        : int
 <1><e51>: Abbrev Number: 4 (DW_TAG_base_type)
    <e52>   DW_AT_byte_size   : 4
    <e53>   DW_AT_encoding    : 7	(unsigned)
    <e54>   DW_AT_name        : (indirect string, offset: 0xb0b5): unsigned int
 <1><e58>: Abbrev Number: 4 (DW_TAG_base_type)
    <e59>   DW_AT_byte_size   : 8
    <e5a>   DW_AT_encoding    : 5	(signed)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x3ea43): long long int
 <1><e5f>: Abbrev Number: 4 (DW_TAG_base_type)
    <e60>   DW_AT_byte_size   : 8
    <e61>   DW_AT_encoding    : 4	(float)
    <e62>   DW_AT_name        : (indirect string, offset: 0x72d48): long double
 <1><e66>: Abbrev Number: 4 (DW_TAG_base_type)
    <e67>   DW_AT_byte_size   : 1
    <e68>   DW_AT_encoding    : 6	(signed char)
    <e69>   DW_AT_name        : (indirect string, offset: 0x455dc): signed char
 <1><e6d>: Abbrev Number: 4 (DW_TAG_base_type)
    <e6e>   DW_AT_byte_size   : 1
    <e6f>   DW_AT_encoding    : 8	(unsigned char)
    <e70>   DW_AT_name        : (indirect string, offset: 0x1bf2f): unsigned char
 <1><e74>: Abbrev Number: 4 (DW_TAG_base_type)
    <e75>   DW_AT_byte_size   : 2
    <e76>   DW_AT_encoding    : 5	(signed)
    <e77>   DW_AT_name        : (indirect string, offset: 0x683fe): short int
 <1><e7b>: Abbrev Number: 4 (DW_TAG_base_type)
    <e7c>   DW_AT_byte_size   : 2
    <e7d>   DW_AT_encoding    : 7	(unsigned)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x86684): short unsigned int
 <1><e82>: Abbrev Number: 4 (DW_TAG_base_type)
    <e83>   DW_AT_byte_size   : 4
    <e84>   DW_AT_encoding    : 5	(signed)
    <e85>   DW_AT_name        : (indirect string, offset: 0xb5f5): long int
 <1><e89>: Abbrev Number: 6 (DW_TAG_typedef)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x5846a): __uint32_t
    <e8e>   DW_AT_decl_file   : 2
    <e8f>   DW_AT_decl_line   : 79
    <e90>   DW_AT_decl_column : 25
    <e91>   DW_AT_type        : <0xe95>
 <1><e95>: Abbrev Number: 4 (DW_TAG_base_type)
    <e96>   DW_AT_byte_size   : 4
    <e97>   DW_AT_encoding    : 7	(unsigned)
    <e98>   DW_AT_name        : (indirect string, offset: 0x2a4b1): long unsigned int
 <1><e9c>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e9d>   DW_AT_type        : <0xe95>
 <1><ea1>: Abbrev Number: 4 (DW_TAG_base_type)
    <ea2>   DW_AT_byte_size   : 8
    <ea3>   DW_AT_encoding    : 7	(unsigned)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x1c885): long long unsigned int
 <1><ea8>: Abbrev Number: 6 (DW_TAG_typedef)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x65308): uint32_t
    <ead>   DW_AT_decl_file   : 3
    <eae>   DW_AT_decl_line   : 48
    <eaf>   DW_AT_decl_column : 20
    <eb0>   DW_AT_type        : <0xe89>
 <1><eb4>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <eb5>   DW_AT_type        : <0xea8>
 <1><eb9>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <eba>   DW_AT_byte_size   : 4
 <1><ebb>: Abbrev Number: 4 (DW_TAG_base_type)
    <ebc>   DW_AT_byte_size   : 1
    <ebd>   DW_AT_encoding    : 8	(unsigned char)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x2c667): char
 <1><ec2>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ec3>   DW_AT_byte_size   : 24
    <ec4>   DW_AT_decl_file   : 4
    <ec5>   DW_AT_decl_line   : 213
    <ec6>   DW_AT_decl_column : 9
    <ec6>   DW_AT_sibling     : <0xf12>
 <2><eca>: Abbrev Number: 12 (DW_TAG_member)
    <ecb>   DW_AT_name        : CR
    <ece>   DW_AT_decl_file   : 4
    <ece>   DW_AT_decl_line   : 215
    <ecf>   DW_AT_decl_column : 17
    <ecf>   DW_AT_type        : <0xeb4>
    <ed3>   DW_AT_data_member_location: 0
 <2><ed4>: Abbrev Number: 1 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x8cc0b): NDTR
    <ed9>   DW_AT_decl_file   : 4
    <eda>   DW_AT_decl_line   : 216
    <edb>   DW_AT_decl_column : 17
    <edc>   DW_AT_type        : <0xeb4>
    <ee0>   DW_AT_data_member_location: 4
 <2><ee1>: Abbrev Number: 12 (DW_TAG_member)
    <ee2>   DW_AT_name        : PAR
    <ee6>   DW_AT_decl_file   : 4
    <ee6>   DW_AT_decl_line   : 217
    <ee7>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0xeb4>
    <eeb>   DW_AT_data_member_location: 8
 <2><eec>: Abbrev Number: 1 (DW_TAG_member)
    <eed>   DW_AT_name        : (indirect string, offset: 0x8cbdd): M0AR
    <ef1>   DW_AT_decl_file   : 4
    <ef2>   DW_AT_decl_line   : 218
    <ef3>   DW_AT_decl_column : 17
    <ef4>   DW_AT_type        : <0xeb4>
    <ef8>   DW_AT_data_member_location: 12
 <2><ef9>: Abbrev Number: 1 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0x8cc6b): M1AR
    <efe>   DW_AT_decl_file   : 4
    <eff>   DW_AT_decl_line   : 219
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0xeb4>
    <f05>   DW_AT_data_member_location: 16
 <2><f06>: Abbrev Number: 12 (DW_TAG_member)
    <f07>   DW_AT_name        : FCR
    <f0b>   DW_AT_decl_file   : 4
    <f0b>   DW_AT_decl_line   : 220
    <f0c>   DW_AT_decl_column : 17
    <f0c>   DW_AT_type        : <0xeb4>
    <f10>   DW_AT_data_member_location: 20
 <2><f11>: Abbrev Number: 0
 <1><f12>: Abbrev Number: 6 (DW_TAG_typedef)
    <f13>   DW_AT_name        : (indirect string, offset: 0x8ce81): DMA_Stream_TypeDef
    <f17>   DW_AT_decl_file   : 4
    <f18>   DW_AT_decl_line   : 221
    <f19>   DW_AT_decl_column : 3
    <f1a>   DW_AT_type        : <0xec2>
 <1><f1e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f1f>   DW_AT_byte_size   : 84
    <f20>   DW_AT_decl_file   : 4
    <f21>   DW_AT_decl_line   : 469
    <f23>   DW_AT_decl_column : 9
    <f23>   DW_AT_sibling     : <0x1038>
 <2><f27>: Abbrev Number: 5 (DW_TAG_member)
    <f28>   DW_AT_name        : CR1
    <f2c>   DW_AT_decl_file   : 4
    <f2c>   DW_AT_decl_line   : 471
    <f2e>   DW_AT_decl_column : 17
    <f2e>   DW_AT_type        : <0xeb4>
    <f32>   DW_AT_data_member_location: 0
 <2><f33>: Abbrev Number: 5 (DW_TAG_member)
    <f34>   DW_AT_name        : CR2
    <f38>   DW_AT_decl_file   : 4
    <f38>   DW_AT_decl_line   : 472
    <f3a>   DW_AT_decl_column : 17
    <f3a>   DW_AT_type        : <0xeb4>
    <f3e>   DW_AT_data_member_location: 4
 <2><f3f>: Abbrev Number: 3 (DW_TAG_member)
    <f40>   DW_AT_name        : (indirect string, offset: 0x2816c): SMCR
    <f44>   DW_AT_decl_file   : 4
    <f45>   DW_AT_decl_line   : 473
    <f47>   DW_AT_decl_column : 17
    <f48>   DW_AT_type        : <0xeb4>
    <f4c>   DW_AT_data_member_location: 8
 <2><f4d>: Abbrev Number: 3 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x2c480): DIER
    <f52>   DW_AT_decl_file   : 4
    <f53>   DW_AT_decl_line   : 474
    <f55>   DW_AT_decl_column : 17
    <f56>   DW_AT_type        : <0xeb4>
    <f5a>   DW_AT_data_member_location: 12
 <2><f5b>: Abbrev Number: 5 (DW_TAG_member)
    <f5c>   DW_AT_name        : SR
    <f5f>   DW_AT_decl_file   : 4
    <f5f>   DW_AT_decl_line   : 475
    <f61>   DW_AT_decl_column : 17
    <f61>   DW_AT_type        : <0xeb4>
    <f65>   DW_AT_data_member_location: 16
 <2><f66>: Abbrev Number: 5 (DW_TAG_member)
    <f67>   DW_AT_name        : EGR
    <f6b>   DW_AT_decl_file   : 4
    <f6b>   DW_AT_decl_line   : 476
    <f6d>   DW_AT_decl_column : 17
    <f6d>   DW_AT_type        : <0xeb4>
    <f71>   DW_AT_data_member_location: 20
 <2><f72>: Abbrev Number: 3 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0x7ff91): CCMR1
    <f77>   DW_AT_decl_file   : 4
    <f78>   DW_AT_decl_line   : 477
    <f7a>   DW_AT_decl_column : 17
    <f7b>   DW_AT_type        : <0xeb4>
    <f7f>   DW_AT_data_member_location: 24
 <2><f80>: Abbrev Number: 3 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0x36716): CCMR2
    <f85>   DW_AT_decl_file   : 4
    <f86>   DW_AT_decl_line   : 478
    <f88>   DW_AT_decl_column : 17
    <f89>   DW_AT_type        : <0xeb4>
    <f8d>   DW_AT_data_member_location: 28
 <2><f8e>: Abbrev Number: 3 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x1cd1e): CCER
    <f93>   DW_AT_decl_file   : 4
    <f94>   DW_AT_decl_line   : 479
    <f96>   DW_AT_decl_column : 17
    <f97>   DW_AT_type        : <0xeb4>
    <f9b>   DW_AT_data_member_location: 32
 <2><f9c>: Abbrev Number: 5 (DW_TAG_member)
    <f9d>   DW_AT_name        : CNT
    <fa1>   DW_AT_decl_file   : 4
    <fa1>   DW_AT_decl_line   : 480
    <fa3>   DW_AT_decl_column : 17
    <fa3>   DW_AT_type        : <0xeb4>
    <fa7>   DW_AT_data_member_location: 36
 <2><fa8>: Abbrev Number: 5 (DW_TAG_member)
    <fa9>   DW_AT_name        : PSC
    <fad>   DW_AT_decl_file   : 4
    <fad>   DW_AT_decl_line   : 481
    <faf>   DW_AT_decl_column : 17
    <faf>   DW_AT_type        : <0xeb4>
    <fb3>   DW_AT_data_member_location: 40
 <2><fb4>: Abbrev Number: 5 (DW_TAG_member)
    <fb5>   DW_AT_name        : ARR
    <fb9>   DW_AT_decl_file   : 4
    <fb9>   DW_AT_decl_line   : 482
    <fbb>   DW_AT_decl_column : 17
    <fbb>   DW_AT_type        : <0xeb4>
    <fbf>   DW_AT_data_member_location: 44
 <2><fc0>: Abbrev Number: 5 (DW_TAG_member)
    <fc1>   DW_AT_name        : RCR
    <fc5>   DW_AT_decl_file   : 4
    <fc5>   DW_AT_decl_line   : 483
    <fc7>   DW_AT_decl_column : 17
    <fc7>   DW_AT_type        : <0xeb4>
    <fcb>   DW_AT_data_member_location: 48
 <2><fcc>: Abbrev Number: 3 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x10107): CCR1
    <fd1>   DW_AT_decl_file   : 4
    <fd2>   DW_AT_decl_line   : 484
    <fd4>   DW_AT_decl_column : 17
    <fd5>   DW_AT_type        : <0xeb4>
    <fd9>   DW_AT_data_member_location: 52
 <2><fda>: Abbrev Number: 3 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x39354): CCR2
    <fdf>   DW_AT_decl_file   : 4
    <fe0>   DW_AT_decl_line   : 485
    <fe2>   DW_AT_decl_column : 17
    <fe3>   DW_AT_type        : <0xeb4>
    <fe7>   DW_AT_data_member_location: 56
 <2><fe8>: Abbrev Number: 3 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x6b0be): CCR3
    <fed>   DW_AT_decl_file   : 4
    <fee>   DW_AT_decl_line   : 486
    <ff0>   DW_AT_decl_column : 17
    <ff1>   DW_AT_type        : <0xeb4>
    <ff5>   DW_AT_data_member_location: 60
 <2><ff6>: Abbrev Number: 3 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x8742): CCR4
    <ffb>   DW_AT_decl_file   : 4
    <ffc>   DW_AT_decl_line   : 487
    <ffe>   DW_AT_decl_column : 17
    <fff>   DW_AT_type        : <0xeb4>
    <1003>   DW_AT_data_member_location: 64
 <2><1004>: Abbrev Number: 3 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0x3f607): BDTR
    <1009>   DW_AT_decl_file   : 4
    <100a>   DW_AT_decl_line   : 488
    <100c>   DW_AT_decl_column : 17
    <100d>   DW_AT_type        : <0xeb4>
    <1011>   DW_AT_data_member_location: 68
 <2><1012>: Abbrev Number: 5 (DW_TAG_member)
    <1013>   DW_AT_name        : DCR
    <1017>   DW_AT_decl_file   : 4
    <1017>   DW_AT_decl_line   : 489
    <1019>   DW_AT_decl_column : 17
    <1019>   DW_AT_type        : <0xeb4>
    <101d>   DW_AT_data_member_location: 72
 <2><101e>: Abbrev Number: 3 (DW_TAG_member)
    <101f>   DW_AT_name        : (indirect string, offset: 0x78297): DMAR
    <1023>   DW_AT_decl_file   : 4
    <1024>   DW_AT_decl_line   : 490
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0xeb4>
    <102b>   DW_AT_data_member_location: 76
 <2><102c>: Abbrev Number: 5 (DW_TAG_member)
    <102d>   DW_AT_name        : OR
    <1030>   DW_AT_decl_file   : 4
    <1030>   DW_AT_decl_line   : 491
    <1032>   DW_AT_decl_column : 17
    <1032>   DW_AT_type        : <0xeb4>
    <1036>   DW_AT_data_member_location: 80
 <2><1037>: Abbrev Number: 0
 <1><1038>: Abbrev Number: 8 (DW_TAG_typedef)
    <1039>   DW_AT_name        : (indirect string, offset: 0x4a35): TIM_TypeDef
    <103d>   DW_AT_decl_file   : 4
    <103e>   DW_AT_decl_line   : 492
    <1040>   DW_AT_decl_column : 3
    <1040>   DW_AT_type        : <0xf1e>
 <1><1044>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1045>   DW_AT_encoding    : 7	(unsigned)
    <1045>   DW_AT_byte_size   : 1
    <1045>   DW_AT_type        : <0xe6d>
    <1049>   DW_AT_decl_file   : 5
    <104a>   DW_AT_decl_line   : 39
    <104b>   DW_AT_decl_column : 1
    <104b>   DW_AT_sibling     : <0x1068>
 <2><104f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1050>   DW_AT_name        : (indirect string, offset: 0x8cb66): HAL_OK
    <1054>   DW_AT_const_value : 0
 <2><1055>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1056>   DW_AT_name        : (indirect string, offset: 0x8ccfd): HAL_ERROR
    <105a>   DW_AT_const_value : 1
 <2><105b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <105c>   DW_AT_name        : (indirect string, offset: 0x8cdec): HAL_BUSY
    <1060>   DW_AT_const_value : 2
 <2><1061>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1062>   DW_AT_name        : (indirect string, offset: 0x8cb41): HAL_TIMEOUT
    <1066>   DW_AT_const_value : 3
 <2><1067>: Abbrev Number: 0
 <1><1068>: Abbrev Number: 6 (DW_TAG_typedef)
    <1069>   DW_AT_name        : (indirect string, offset: 0x8ca47): HAL_StatusTypeDef
    <106d>   DW_AT_decl_file   : 5
    <106e>   DW_AT_decl_line   : 44
    <106f>   DW_AT_decl_column : 3
    <1070>   DW_AT_type        : <0x1044>
 <1><1074>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1075>   DW_AT_encoding    : 7	(unsigned)
    <1075>   DW_AT_byte_size   : 1
    <1075>   DW_AT_type        : <0xe6d>
    <1079>   DW_AT_decl_file   : 5
    <107a>   DW_AT_decl_line   : 50
    <107b>   DW_AT_decl_column : 1
    <107b>   DW_AT_sibling     : <0x108c>
 <2><107f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1080>   DW_AT_name        : (indirect string, offset: 0x8cd71): HAL_UNLOCKED
    <1084>   DW_AT_const_value : 0
 <2><1085>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1086>   DW_AT_name        : (indirect string, offset: 0x8cf2e): HAL_LOCKED
    <108a>   DW_AT_const_value : 1
 <2><108b>: Abbrev Number: 0
 <1><108c>: Abbrev Number: 6 (DW_TAG_typedef)
    <108d>   DW_AT_name        : (indirect string, offset: 0x8ccd9): HAL_LockTypeDef
    <1091>   DW_AT_decl_file   : 5
    <1092>   DW_AT_decl_line   : 53
    <1093>   DW_AT_decl_column : 3
    <1094>   DW_AT_type        : <0x1074>
 <1><1098>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1099>   DW_AT_byte_size   : 48
    <109a>   DW_AT_decl_file   : 6
    <109b>   DW_AT_decl_line   : 48
    <109c>   DW_AT_decl_column : 9
    <109c>   DW_AT_sibling     : <0x113d>
 <2><10a0>: Abbrev Number: 1 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x8cc32): Channel
    <10a5>   DW_AT_decl_file   : 6
    <10a6>   DW_AT_decl_line   : 50
    <10a7>   DW_AT_decl_column : 12
    <10a8>   DW_AT_type        : <0xea8>
    <10ac>   DW_AT_data_member_location: 0
 <2><10ad>: Abbrev Number: 1 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x8cb8b): Direction
    <10b2>   DW_AT_decl_file   : 6
    <10b3>   DW_AT_decl_line   : 53
    <10b4>   DW_AT_decl_column : 12
    <10b5>   DW_AT_type        : <0xea8>
    <10b9>   DW_AT_data_member_location: 4
 <2><10ba>: Abbrev Number: 1 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x8ca87): PeriphInc
    <10bf>   DW_AT_decl_file   : 6
    <10c0>   DW_AT_decl_line   : 57
    <10c1>   DW_AT_decl_column : 12
    <10c2>   DW_AT_type        : <0xea8>
    <10c6>   DW_AT_data_member_location: 8
 <2><10c7>: Abbrev Number: 1 (DW_TAG_member)
    <10c8>   DW_AT_name        : (indirect string, offset: 0x8cac0): MemInc
    <10cc>   DW_AT_decl_file   : 6
    <10cd>   DW_AT_decl_line   : 60
    <10ce>   DW_AT_decl_column : 12
    <10cf>   DW_AT_type        : <0xea8>
    <10d3>   DW_AT_data_member_location: 12
 <2><10d4>: Abbrev Number: 1 (DW_TAG_member)
    <10d5>   DW_AT_name        : (indirect string, offset: 0x8cc10): PeriphDataAlignment
    <10d9>   DW_AT_decl_file   : 6
    <10da>   DW_AT_decl_line   : 63
    <10db>   DW_AT_decl_column : 12
    <10dc>   DW_AT_type        : <0xea8>
    <10e0>   DW_AT_data_member_location: 16
 <2><10e1>: Abbrev Number: 1 (DW_TAG_member)
    <10e2>   DW_AT_name        : (indirect string, offset: 0x8ce70): MemDataAlignment
    <10e6>   DW_AT_decl_file   : 6
    <10e7>   DW_AT_decl_line   : 66
    <10e8>   DW_AT_decl_column : 12
    <10e9>   DW_AT_type        : <0xea8>
    <10ed>   DW_AT_data_member_location: 20
 <2><10ee>: Abbrev Number: 1 (DW_TAG_member)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x91fa0): Mode
    <10f3>   DW_AT_decl_file   : 6
    <10f4>   DW_AT_decl_line   : 69
    <10f5>   DW_AT_decl_column : 12
    <10f6>   DW_AT_type        : <0xea8>
    <10fa>   DW_AT_data_member_location: 24
 <2><10fb>: Abbrev Number: 1 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x91601): Priority
    <1100>   DW_AT_decl_file   : 6
    <1101>   DW_AT_decl_line   : 74
    <1102>   DW_AT_decl_column : 12
    <1103>   DW_AT_type        : <0xea8>
    <1107>   DW_AT_data_member_location: 28
 <2><1108>: Abbrev Number: 1 (DW_TAG_member)
    <1109>   DW_AT_name        : (indirect string, offset: 0x8cbf8): FIFOMode
    <110d>   DW_AT_decl_file   : 6
    <110e>   DW_AT_decl_line   : 77
    <110f>   DW_AT_decl_column : 12
    <1110>   DW_AT_type        : <0xea8>
    <1114>   DW_AT_data_member_location: 32
 <2><1115>: Abbrev Number: 1 (DW_TAG_member)
    <1116>   DW_AT_name        : (indirect string, offset: 0x8cdad): FIFOThreshold
    <111a>   DW_AT_decl_file   : 6
    <111b>   DW_AT_decl_line   : 82
    <111c>   DW_AT_decl_column : 12
    <111d>   DW_AT_type        : <0xea8>
    <1121>   DW_AT_data_member_location: 36
 <2><1122>: Abbrev Number: 1 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0x8cd92): MemBurst
    <1127>   DW_AT_decl_file   : 6
    <1128>   DW_AT_decl_line   : 85
    <1129>   DW_AT_decl_column : 12
    <112a>   DW_AT_type        : <0xea8>
    <112e>   DW_AT_data_member_location: 40
 <2><112f>: Abbrev Number: 1 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0x8cb6d): PeriphBurst
    <1134>   DW_AT_decl_file   : 6
    <1135>   DW_AT_decl_line   : 91
    <1136>   DW_AT_decl_column : 12
    <1137>   DW_AT_type        : <0xea8>
    <113b>   DW_AT_data_member_location: 44
 <2><113c>: Abbrev Number: 0
 <1><113d>: Abbrev Number: 6 (DW_TAG_typedef)
    <113e>   DW_AT_name        : (indirect string, offset: 0x8cb1d): DMA_InitTypeDef
    <1142>   DW_AT_decl_file   : 6
    <1143>   DW_AT_decl_line   : 96
    <1144>   DW_AT_decl_column : 2
    <1145>   DW_AT_type        : <0x1098>
 <1><1149>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <114a>   DW_AT_encoding    : 7	(unsigned)
    <114a>   DW_AT_byte_size   : 1
    <114a>   DW_AT_type        : <0xe6d>
    <114e>   DW_AT_decl_file   : 6
    <114f>   DW_AT_decl_line   : 103
    <1150>   DW_AT_decl_column : 1
    <1150>   DW_AT_sibling     : <0x1179>
 <2><1154>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1155>   DW_AT_name        : (indirect string, offset: 0x8cd7e): HAL_DMA_STATE_RESET
    <1159>   DW_AT_const_value : 0
 <2><115a>: Abbrev Number: 2 (DW_TAG_enumerator)
