Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x14cc (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8cc2f): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x7331): ../Core/Src/MSTScheduler.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x5e514): /Users/enricoalberti/Desktop/FILES/Embedded/FreeRTOS/MST4FreeRTOS/MST-FreeRTOS-Example/Debug
    <1a>   DW_AT_ranges      : 0x18
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 38 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5ea7): size_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 10 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

    <68>   DW_AT_name        : (indirect string, offset: 0x74916): __uint16_t
    <6c>   DW_AT_decl_file   : 4
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 10 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x8907a): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_typedef)
    <7b>   DW_AT_name        : (indirect string, offset: 0x5693a): __int32_t
    <7f>   DW_AT_decl_file   : 4
    <80>   DW_AT_decl_line   : 77
    <81>   DW_AT_decl_column : 24
    <82>   DW_AT_type        : <0x86>
 <1><86>: Abbrev Number: 10 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0xb939): long int
 <1><8d>: Abbrev Number: 6 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x59b9f): __uint32_t
    <92>   DW_AT_decl_file   : 4
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 10 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x2ac9a): long unsigned int
 <1><a0>: Abbrev Number: 10 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1ce7f): long long unsigned int
 <1><a7>: Abbrev Number: 6 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x67566): uint16_t
    <ac>   DW_AT_decl_file   : 5
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 9 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 6 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x5693c): int32_t
    <bd>   DW_AT_decl_file   : 5
    <be>   DW_AT_decl_line   : 44
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x7a>
 <1><c4>: Abbrev Number: 6 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x66dd6): uint32_t
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 48
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x8d>
 <1><d0>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <d1>   DW_AT_type        : <0xc4>
 <1><d5>: Abbrev Number: 9 (DW_TAG_const_type)
    <d6>   DW_AT_type        : <0xd0>
 <1><da>: Abbrev Number: 6 (DW_TAG_typedef)
    <db>   DW_AT_name        : (indirect string, offset: 0x426d2): TaskFunction_t
    <df>   DW_AT_decl_file   : 6
    <e0>   DW_AT_decl_line   : 35
    <e1>   DW_AT_decl_column : 16
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <ec>   DW_AT_prototyped  : 1
    <ec>   DW_AT_sibling     : <0xf6>
 <2><f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f1>   DW_AT_type        : <0xf6>
 <2><f5>: Abbrev Number: 0
 <1><f6>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 9 (DW_TAG_const_type)
    <f9>   DW_AT_type        : <0xf6>
 <1><fd>: Abbrev Number: 6 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x678bc): StackType_t
    <102>   DW_AT_decl_file   : 2
    <103>   DW_AT_decl_line   : 55
    <104>   DW_AT_decl_column : 24
    <105>   DW_AT_type        : <0xc4>
 <1><109>: Abbrev Number: 6 (DW_TAG_typedef)
    <10a>   DW_AT_name        : (indirect string, offset: 0x83c7b): BaseType_t
    <10e>   DW_AT_decl_file   : 2
    <10f>   DW_AT_decl_line   : 56
    <110>   DW_AT_decl_column : 14
    <111>   DW_AT_type        : <0x86>
 <1><115>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <116>   DW_AT_type        : <0x109>
 <1><11a>: Abbrev Number: 9 (DW_TAG_const_type)
    <11b>   DW_AT_type        : <0x109>
 <1><11f>: Abbrev Number: 6 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0x83c7a): UBaseType_t
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 57
    <126>   DW_AT_decl_column : 23
    <127>   DW_AT_type        : <0x99>
 <1><12b>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <12c>   DW_AT_type        : <0x11f>
 <1><130>: Abbrev Number: 9 (DW_TAG_const_type)
    <131>   DW_AT_type        : <0x11f>
 <1><135>: Abbrev Number: 6 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x4da36): TickType_t
    <13a>   DW_AT_decl_file   : 2
    <13b>   DW_AT_decl_line   : 63
    <13c>   DW_AT_decl_column : 19
    <13d>   DW_AT_type        : <0xc4>
 <1><141>: Abbrev Number: 9 (DW_TAG_const_type)
    <142>   DW_AT_type        : <0x135>
 <1><146>: Abbrev Number: 10 (DW_TAG_base_type)
    <147>   DW_AT_byte_size   : 1
    <148>   DW_AT_encoding    : 8	(unsigned char)
    <149>   DW_AT_name        : (indirect string, offset: 0x2cebc): char
 <1><14d>: Abbrev Number: 9 (DW_TAG_const_type)
    <14e>   DW_AT_type        : <0x146>
 <1><152>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <153>   DW_AT_byte_size   : 4
    <153>   DW_AT_type        : <0x14d>
 <1><157>: Abbrev Number: 9 (DW_TAG_const_type)
    <158>   DW_AT_type        : <0x152>
 <1><15c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <15d>   DW_AT_name        : (indirect string, offset: 0x3e8de): xLIST_ITEM
    <161>   DW_AT_byte_size   : 20
    <162>   DW_AT_decl_file   : 7
    <163>   DW_AT_decl_line   : 140
    <164>   DW_AT_decl_column : 8
    <165>   DW_AT_sibling     : <0x1ab>
 <2><169>: Abbrev Number: 3 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0x6babf): xItemValue
    <16e>   DW_AT_decl_file   : 7
    <16f>   DW_AT_decl_line   : 143
    <170>   DW_AT_decl_column : 33
    <171>   DW_AT_type        : <0x135>
    <175>   DW_AT_data_member_location: 0
 <2><176>: Abbrev Number: 3 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x6d327): pxNext
    <17b>   DW_AT_decl_file   : 7
    <17c>   DW_AT_decl_line   : 144
    <17d>   DW_AT_decl_column : 42
    <17e>   DW_AT_type        : <0x1ab>
    <182>   DW_AT_data_member_location: 4
 <2><183>: Abbrev Number: 3 (DW_TAG_member)
    <184>   DW_AT_name        : (indirect string, offset: 0xc213): pxPrevious
    <188>   DW_AT_decl_file   : 7
    <189>   DW_AT_decl_line   : 145
    <18a>   DW_AT_decl_column : 42
    <18b>   DW_AT_type        : <0x1ab>
    <18f>   DW_AT_data_member_location: 8
 <2><190>: Abbrev Number: 3 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x52367): pvOwner
    <195>   DW_AT_decl_file   : 7
    <196>   DW_AT_decl_line   : 146
    <197>   DW_AT_decl_column : 9
    <198>   DW_AT_type        : <0xf6>
    <19c>   DW_AT_data_member_location: 12
 <2><19d>: Abbrev Number: 3 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0x6629d): pvContainer
    <1a2>   DW_AT_decl_file   : 7
    <1a3>   DW_AT_decl_line   : 147
    <1a4>   DW_AT_decl_column : 37
    <1a5>   DW_AT_type        : <0x1e5>
    <1a9>   DW_AT_data_member_location: 16
 <2><1aa>: Abbrev Number: 0
 <1><1ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ac>   DW_AT_type        : <0x15c>
 <1><1b0>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x80312): xLIST
    <1b5>   DW_AT_byte_size   : 20
    <1b6>   DW_AT_decl_file   : 7
    <1b7>   DW_AT_decl_line   : 164
    <1b8>   DW_AT_decl_column : 16
    <1b9>   DW_AT_sibling     : <0x1e5>
 <2><1bd>: Abbrev Number: 3 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x6a5d0): uxNumberOfItems
    <1c2>   DW_AT_decl_file   : 7
    <1c3>   DW_AT_decl_line   : 167
    <1c4>   DW_AT_decl_column : 23
    <1c5>   DW_AT_type        : <0x12b>
    <1c9>   DW_AT_data_member_location: 0
 <2><1ca>: Abbrev Number: 3 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x4c161): pxIndex
    <1cf>   DW_AT_decl_file   : 7
    <1d0>   DW_AT_decl_line   : 168
    <1d1>   DW_AT_decl_column : 35
    <1d2>   DW_AT_type        : <0x237>
    <1d6>   DW_AT_data_member_location: 4
 <2><1d7>: Abbrev Number: 3 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x8b63): xListEnd
    <1dc>   DW_AT_decl_file   : 7
    <1dd>   DW_AT_decl_line   : 169
    <1de>   DW_AT_decl_column : 17
    <1df>   DW_AT_type        : <0x22b>
    <1e3>   DW_AT_data_member_location: 8
 <2><1e4>: Abbrev Number: 0
 <1><1e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1e6>   DW_AT_byte_size   : 4
    <1e6>   DW_AT_type        : <0x1b0>
 <1><1ea>: Abbrev Number: 6 (DW_TAG_typedef)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x7363f): ListItem_t
    <1ef>   DW_AT_decl_file   : 7
    <1f0>   DW_AT_decl_line   : 150
    <1f1>   DW_AT_decl_column : 27
    <1f2>   DW_AT_type        : <0x15c>
 <1><1f6>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x59ff9): xMINI_LIST_ITEM
    <1fb>   DW_AT_byte_size   : 12
    <1fc>   DW_AT_decl_file   : 7
    <1fd>   DW_AT_decl_line   : 152
    <1fe>   DW_AT_decl_column : 8
    <1ff>   DW_AT_sibling     : <0x22b>
 <2><203>: Abbrev Number: 3 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x6babf): xItemValue
    <208>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 155
    <20a>   DW_AT_decl_column : 33
    <20b>   DW_AT_type        : <0x135>
    <20f>   DW_AT_data_member_location: 0
 <2><210>: Abbrev Number: 3 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x6d327): pxNext
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 156
    <217>   DW_AT_decl_column : 42
    <218>   DW_AT_type        : <0x1ab>
    <21c>   DW_AT_data_member_location: 4
 <2><21d>: Abbrev Number: 3 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0xc213): pxPrevious
    <222>   DW_AT_decl_file   : 7
    <223>   DW_AT_decl_line   : 157
    <224>   DW_AT_decl_column : 42
    <225>   DW_AT_type        : <0x1ab>
    <229>   DW_AT_data_member_location: 8
 <2><22a>: Abbrev Number: 0
 <1><22b>: Abbrev Number: 6 (DW_TAG_typedef)
    <22c>   DW_AT_name        : (indirect string, offset: 0x9674a): MiniListItem_t
    <230>   DW_AT_decl_file   : 7
    <231>   DW_AT_decl_line   : 159
    <232>   DW_AT_decl_column : 32
    <233>   DW_AT_type        : <0x1f6>
 <1><237>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <238>   DW_AT_byte_size   : 4
    <238>   DW_AT_type        : <0x1ea>
 <1><23c>: Abbrev Number: 9 (DW_TAG_const_type)
    <23d>   DW_AT_type        : <0x237>
 <1><241>: Abbrev Number: 6 (DW_TAG_typedef)
    <242>   DW_AT_name        : (indirect string, offset: 0x3be05): List_t
    <246>   DW_AT_decl_file   : 7
    <247>   DW_AT_decl_line   : 171
    <248>   DW_AT_decl_column : 3
    <249>   DW_AT_type        : <0x1b0>
 <1><24d>: Abbrev Number: 6 (DW_TAG_typedef)
    <24e>   DW_AT_name        : (indirect string, offset: 0x7c32b): TaskHandle_t
    <252>   DW_AT_decl_file   : 8
    <253>   DW_AT_decl_line   : 70
    <254>   DW_AT_decl_column : 37
    <255>   DW_AT_type        : <0x259>
 <1><259>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <25a>   DW_AT_byte_size   : 4
    <25a>   DW_AT_type        : <0x25e>
 <1><25e>: Abbrev Number: 26 (DW_TAG_structure_type)
    <25f>   DW_AT_name        : (indirect string, offset: 0x79563): tskTaskControlBlock
    <263>   DW_AT_declaration : 1
 <1><263>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <264>   DW_AT_encoding    : 7	(unsigned)
    <264>   DW_AT_byte_size   : 1
    <264>   DW_AT_type        : <0x59>
    <268>   DW_AT_decl_file   : 8
    <268>   DW_AT_decl_line   : 80
    <269>   DW_AT_decl_column : 1
    <269>   DW_AT_sibling     : <0x292>
 <2><26d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <26e>   DW_AT_name        : (indirect string, offset: 0x3f31c): eRunning
    <272>   DW_AT_const_value : 0
 <2><273>: Abbrev Number: 11 (DW_TAG_enumerator)
    <274>   DW_AT_name        : (indirect string, offset: 0x35d8f): eReady
    <278>   DW_AT_const_value : 1
 <2><279>: Abbrev Number: 11 (DW_TAG_enumerator)
    <27a>   DW_AT_name        : (indirect string, offset: 0x2f084): eBlocked
    <27e>   DW_AT_const_value : 2
 <2><27f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <280>   DW_AT_name        : (indirect string, offset: 0x5207b): eSuspended
    <284>   DW_AT_const_value : 3
 <2><285>: Abbrev Number: 11 (DW_TAG_enumerator)
    <286>   DW_AT_name        : (indirect string, offset: 0x68ce5): eDeleted
    <28a>   DW_AT_const_value : 4
 <2><28b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <28c>   DW_AT_name        : (indirect string, offset: 0x16794): eInvalid
    <290>   DW_AT_const_value : 5
 <2><291>: Abbrev Number: 0
 <1><292>: Abbrev Number: 6 (DW_TAG_typedef)
    <293>   DW_AT_name        : (indirect string, offset: 0x30f0): eTaskState
    <297>   DW_AT_decl_file   : 8
    <298>   DW_AT_decl_line   : 87
    <299>   DW_AT_decl_column : 3
    <29a>   DW_AT_type        : <0x263>
 <1><29e>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <29f>   DW_AT_encoding    : 7	(unsigned)
    <29f>   DW_AT_byte_size   : 1
    <29f>   DW_AT_type        : <0x59>
    <2a3>   DW_AT_decl_file   : 8
    <2a3>   DW_AT_decl_line   : 91
    <2a4>   DW_AT_decl_column : 1
    <2a4>   DW_AT_sibling     : <0x2c7>
 <2><2a8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x39971): eNoAction
    <2ad>   DW_AT_const_value : 0
 <2><2ae>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x61a4f): eSetBits
    <2b3>   DW_AT_const_value : 1
 <2><2b4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x9845e): eIncrement
    <2b9>   DW_AT_const_value : 2
 <2><2ba>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x64532): eSetValueWithOverwrite
    <2bf>   DW_AT_const_value : 3
 <2><2c0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x276d5): eSetValueWithoutOverwrite
    <2c5>   DW_AT_const_value : 4
 <2><2c6>: Abbrev Number: 0
 <1><2c7>: Abbrev Number: 6 (DW_TAG_typedef)
    <2c8>   DW_AT_name        : (indirect string, offset: 0x4d535): eNotifyAction
    <2cc>   DW_AT_decl_file   : 8
    <2cd>   DW_AT_decl_line   : 97
    <2ce>   DW_AT_decl_column : 3
    <2cf>   DW_AT_type        : <0x29e>
 <1><2d3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2d4>   DW_AT_byte_size   : 4
    <2d4>   DW_AT_type        : <0xfd>
 <1><2d8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x88216): xTASK_STATUS
    <2dd>   DW_AT_byte_size   : 36
    <2de>   DW_AT_decl_file   : 8
    <2df>   DW_AT_decl_line   : 137
    <2e0>   DW_AT_decl_column : 16
    <2e1>   DW_AT_sibling     : <0x35b>
 <2><2e5>: Abbrev Number: 3 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x9841d): xHandle
    <2ea>   DW_AT_decl_file   : 8
    <2eb>   DW_AT_decl_line   : 139
    <2ec>   DW_AT_decl_column : 15
    <2ed>   DW_AT_type        : <0x24d>
    <2f1>   DW_AT_data_member_location: 0
 <2><2f2>: Abbrev Number: 3 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x2f678): pcTaskName
    <2f7>   DW_AT_decl_file   : 8
    <2f8>   DW_AT_decl_line   : 140
    <2f9>   DW_AT_decl_column : 14
    <2fa>   DW_AT_type        : <0x152>
    <2fe>   DW_AT_data_member_location: 4
 <2><2ff>: Abbrev Number: 3 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x97e4f): xTaskNumber
    <304>   DW_AT_decl_file   : 8
    <305>   DW_AT_decl_line   : 141
    <306>   DW_AT_decl_column : 14
    <307>   DW_AT_type        : <0x11f>
    <30b>   DW_AT_data_member_location: 8
 <2><30c>: Abbrev Number: 3 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x5406d): eCurrentState
    <311>   DW_AT_decl_file   : 8
    <312>   DW_AT_decl_line   : 142
    <313>   DW_AT_decl_column : 13
    <314>   DW_AT_type        : <0x292>
    <318>   DW_AT_data_member_location: 12
 <2><319>: Abbrev Number: 3 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x3ad13): uxCurrentPriority
    <31e>   DW_AT_decl_file   : 8
    <31f>   DW_AT_decl_line   : 143
    <320>   DW_AT_decl_column : 14
    <321>   DW_AT_type        : <0x11f>
    <325>   DW_AT_data_member_location: 16
 <2><326>: Abbrev Number: 3 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x57362): uxBasePriority
    <32b>   DW_AT_decl_file   : 8
    <32c>   DW_AT_decl_line   : 144
    <32d>   DW_AT_decl_column : 14
    <32e>   DW_AT_type        : <0x11f>
    <332>   DW_AT_data_member_location: 20
 <2><333>: Abbrev Number: 3 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x610a2): ulRunTimeCounter
    <338>   DW_AT_decl_file   : 8
    <339>   DW_AT_decl_line   : 145
    <33a>   DW_AT_decl_column : 11
    <33b>   DW_AT_type        : <0xc4>
    <33f>   DW_AT_data_member_location: 24
 <2><340>: Abbrev Number: 3 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x43c25): pxStackBase
    <345>   DW_AT_decl_file   : 8
    <346>   DW_AT_decl_line   : 146
    <347>   DW_AT_decl_column : 15
    <348>   DW_AT_type        : <0x2d3>
    <34c>   DW_AT_data_member_location: 28
 <2><34d>: Abbrev Number: 3 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x3ff5a): usStackHighWaterMark
    <352>   DW_AT_decl_file   : 8
    <353>   DW_AT_decl_line   : 147
    <354>   DW_AT_decl_column : 25
    <355>   DW_AT_type        : <0xa7>
    <359>   DW_AT_data_member_location: 32
 <2><35a>: Abbrev Number: 0
 <1><35b>: Abbrev Number: 6 (DW_TAG_typedef)
    <35c>   DW_AT_name        : (indirect string, offset: 0x1c2c5): TaskStatus_t
    <360>   DW_AT_decl_file   : 8
    <361>   DW_AT_decl_line   : 148
    <362>   DW_AT_decl_column : 3
    <363>   DW_AT_type        : <0x2d8>
 <1><367>: Abbrev Number: 6 (DW_TAG_typedef)
    <368>   DW_AT_name        : (indirect string, offset: 0x3566): TimerHandle_t
    <36c>   DW_AT_decl_file   : 9
    <36d>   DW_AT_decl_line   : 77
    <36e>   DW_AT_decl_column : 34
    <36f>   DW_AT_type        : <0x378>
 <1><373>: Abbrev Number: 9 (DW_TAG_const_type)
    <374>   DW_AT_type        : <0x367>
 <1><378>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <379>   DW_AT_byte_size   : 4
    <379>   DW_AT_type        : <0x37d>
 <1><37d>: Abbrev Number: 26 (DW_TAG_structure_type)
    <37e>   DW_AT_name        : (indirect string, offset: 0x16e20): tmrTimerControl
    <382>   DW_AT_declaration : 1
 <1><382>: Abbrev Number: 6 (DW_TAG_typedef)
    <383>   DW_AT_name        : (indirect string, offset: 0x49f01): TimerCallbackFunction_t
    <387>   DW_AT_decl_file   : 9
    <388>   DW_AT_decl_line   : 82
    <389>   DW_AT_decl_column : 16
    <38a>   DW_AT_type        : <0x38e>
 <1><38e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <38f>   DW_AT_byte_size   : 4
    <38f>   DW_AT_type        : <0x393>
 <1><393>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <394>   DW_AT_prototyped  : 1
    <394>   DW_AT_sibling     : <0x39e>
 <2><398>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <399>   DW_AT_type        : <0x367>
 <2><39d>: Abbrev Number: 0
 <1><39e>: Abbrev Number: 10 (DW_TAG_base_type)
    <39f>   DW_AT_byte_size   : 4
    <3a0>   DW_AT_encoding    : 4	(float)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x7a7e7): float
 <1><3a5>: Abbrev Number: 10 (DW_TAG_base_type)
    <3a6>   DW_AT_byte_size   : 8
    <3a7>   DW_AT_encoding    : 4	(float)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x10b68): double
 <1><3ac>: Abbrev Number: 28 (DW_TAG_array_type)
    <3ad>   DW_AT_type        : <0xc4>
    <3b1>   DW_AT_sibling     : <0x3bc>
 <2><3b5>: Abbrev Number: 40 (DW_TAG_subrange_type)
    <3b6>   DW_AT_type        : <0x3d>
    <3ba>   DW_AT_upper_bound : 0
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 29 (DW_TAG_structure_type)
    <3bd>   DW_AT_byte_size   : 92
    <3be>   DW_AT_decl_file   : 10
    <3be>   DW_AT_decl_line   : 904
    <3c0>   DW_AT_decl_column : 9
    <3c0>   DW_AT_sibling     : <0x4d9>
 <2><3c4>: Abbrev Number: 5 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x4d323): CTRL
    <3c9>   DW_AT_decl_file   : 10
    <3c9>   DW_AT_decl_line   : 906
    <3cb>   DW_AT_decl_column : 18
    <3cb>   DW_AT_type        : <0xd0>
    <3cf>   DW_AT_data_member_location: 0
 <2><3d0>: Abbrev Number: 5 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x2a571): CYCCNT
    <3d5>   DW_AT_decl_file   : 10
    <3d5>   DW_AT_decl_line   : 907
    <3d7>   DW_AT_decl_column : 18
    <3d7>   DW_AT_type        : <0xd0>
    <3db>   DW_AT_data_member_location: 4
 <2><3dc>: Abbrev Number: 5 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x4a168): CPICNT
    <3e1>   DW_AT_decl_file   : 10
    <3e1>   DW_AT_decl_line   : 908
    <3e3>   DW_AT_decl_column : 18
    <3e3>   DW_AT_type        : <0xd0>
    <3e7>   DW_AT_data_member_location: 8
 <2><3e8>: Abbrev Number: 5 (DW_TAG_member)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x791c7): EXCCNT
    <3ed>   DW_AT_decl_file   : 10
    <3ed>   DW_AT_decl_line   : 909
    <3ef>   DW_AT_decl_column : 18
    <3ef>   DW_AT_type        : <0xd0>
    <3f3>   DW_AT_data_member_location: 12
 <2><3f4>: Abbrev Number: 5 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x2f307): SLEEPCNT
    <3f9>   DW_AT_decl_file   : 10
    <3f9>   DW_AT_decl_line   : 910
    <3fb>   DW_AT_decl_column : 18
    <3fb>   DW_AT_type        : <0xd0>
    <3ff>   DW_AT_data_member_location: 16
 <2><400>: Abbrev Number: 5 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0xc3f1): LSUCNT
    <405>   DW_AT_decl_file   : 10
    <405>   DW_AT_decl_line   : 911
    <407>   DW_AT_decl_column : 18
    <407>   DW_AT_type        : <0xd0>
    <40b>   DW_AT_data_member_location: 20
 <2><40c>: Abbrev Number: 5 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x5acc9): FOLDCNT
    <411>   DW_AT_decl_file   : 10
    <411>   DW_AT_decl_line   : 912
    <413>   DW_AT_decl_column : 18
    <413>   DW_AT_type        : <0xd0>
    <417>   DW_AT_data_member_location: 24
 <2><418>: Abbrev Number: 5 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0x55dab): PCSR
    <41d>   DW_AT_decl_file   : 10
    <41d>   DW_AT_decl_line   : 913
    <41f>   DW_AT_decl_column : 18
    <41f>   DW_AT_type        : <0xd5>
    <423>   DW_AT_data_member_location: 28
 <2><424>: Abbrev Number: 5 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x815a): COMP0
    <429>   DW_AT_decl_file   : 10
    <429>   DW_AT_decl_line   : 914
    <42b>   DW_AT_decl_column : 18
    <42b>   DW_AT_type        : <0xd0>
    <42f>   DW_AT_data_member_location: 32
 <2><430>: Abbrev Number: 5 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0x46216): MASK0
    <435>   DW_AT_decl_file   : 10
    <435>   DW_AT_decl_line   : 915
    <437>   DW_AT_decl_column : 18
    <437>   DW_AT_type        : <0xd0>
    <43b>   DW_AT_data_member_location: 36
 <2><43c>: Abbrev Number: 5 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x1d62): FUNCTION0
    <441>   DW_AT_decl_file   : 10
    <441>   DW_AT_decl_line   : 916
    <443>   DW_AT_decl_column : 18
    <443>   DW_AT_type        : <0xd0>
    <447>   DW_AT_data_member_location: 40
 <2><448>: Abbrev Number: 5 (DW_TAG_member)
    <449>   DW_AT_name        : (indirect string, offset: 0x86eb0): RESERVED0
    <44d>   DW_AT_decl_file   : 10
    <44d>   DW_AT_decl_line   : 917
    <44f>   DW_AT_decl_column : 18
    <44f>   DW_AT_type        : <0x3ac>
    <453>   DW_AT_data_member_location: 44
 <2><454>: Abbrev Number: 5 (DW_TAG_member)
    <455>   DW_AT_name        : (indirect string, offset: 0x4905d): COMP1
    <459>   DW_AT_decl_file   : 10
    <459>   DW_AT_decl_line   : 918
    <45b>   DW_AT_decl_column : 18
    <45b>   DW_AT_type        : <0xd0>
    <45f>   DW_AT_data_member_location: 48
 <2><460>: Abbrev Number: 5 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0x4621c): MASK1
    <465>   DW_AT_decl_file   : 10
    <465>   DW_AT_decl_line   : 919
    <467>   DW_AT_decl_column : 18
    <467>   DW_AT_type        : <0xd0>
    <46b>   DW_AT_data_member_location: 52
 <2><46c>: Abbrev Number: 5 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0x1d6c): FUNCTION1
    <471>   DW_AT_decl_file   : 10
    <471>   DW_AT_decl_line   : 920
    <473>   DW_AT_decl_column : 18
    <473>   DW_AT_type        : <0xd0>
    <477>   DW_AT_data_member_location: 56
 <2><478>: Abbrev Number: 5 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x86eba): RESERVED1
    <47d>   DW_AT_decl_file   : 10
    <47d>   DW_AT_decl_line   : 921
    <47f>   DW_AT_decl_column : 18
    <47f>   DW_AT_type        : <0x3ac>
    <483>   DW_AT_data_member_location: 60
 <2><484>: Abbrev Number: 5 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x11188): COMP2
    <489>   DW_AT_decl_file   : 10
    <489>   DW_AT_decl_line   : 922
    <48b>   DW_AT_decl_column : 18
    <48b>   DW_AT_type        : <0xd0>
    <48f>   DW_AT_data_member_location: 64
 <2><490>: Abbrev Number: 5 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x589a6): MASK2
    <495>   DW_AT_decl_file   : 10
    <495>   DW_AT_decl_line   : 923
    <497>   DW_AT_decl_column : 18
    <497>   DW_AT_type        : <0xd0>
    <49b>   DW_AT_data_member_location: 68
 <2><49c>: Abbrev Number: 5 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x1d76): FUNCTION2
    <4a1>   DW_AT_decl_file   : 10
    <4a1>   DW_AT_decl_line   : 924
    <4a3>   DW_AT_decl_column : 18
    <4a3>   DW_AT_type        : <0xd0>
    <4a7>   DW_AT_data_member_location: 72
 <2><4a8>: Abbrev Number: 5 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x86ec4): RESERVED2
    <4ad>   DW_AT_decl_file   : 10
    <4ad>   DW_AT_decl_line   : 925
    <4af>   DW_AT_decl_column : 18
    <4af>   DW_AT_type        : <0x3ac>
    <4b3>   DW_AT_data_member_location: 76
 <2><4b4>: Abbrev Number: 5 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x61132): COMP3
    <4b9>   DW_AT_decl_file   : 10
    <4b9>   DW_AT_decl_line   : 926
    <4bb>   DW_AT_decl_column : 18
    <4bb>   DW_AT_type        : <0xd0>
    <4bf>   DW_AT_data_member_location: 80
 <2><4c0>: Abbrev Number: 5 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x46275): MASK3
    <4c5>   DW_AT_decl_file   : 10
    <4c5>   DW_AT_decl_line   : 927
    <4c7>   DW_AT_decl_column : 18
    <4c7>   DW_AT_type        : <0xd0>
    <4cb>   DW_AT_data_member_location: 84
 <2><4cc>: Abbrev Number: 5 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x1d80): FUNCTION3
    <4d1>   DW_AT_decl_file   : 10
    <4d1>   DW_AT_decl_line   : 928
    <4d3>   DW_AT_decl_column : 18
    <4d3>   DW_AT_type        : <0xd0>
    <4d7>   DW_AT_data_member_location: 88
 <2><4d8>: Abbrev Number: 0
 <1><4d9>: Abbrev Number: 30 (DW_TAG_typedef)
    <4da>   DW_AT_name        : (indirect string, offset: 0x2569c): DWT_Type
    <4de>   DW_AT_decl_file   : 10
    <4de>   DW_AT_decl_line   : 929
    <4e0>   DW_AT_decl_column : 3
    <4e0>   DW_AT_type        : <0x3bc>
 <1><4e4>: Abbrev Number: 29 (DW_TAG_structure_type)
    <4e5>   DW_AT_byte_size   : 16
    <4e6>   DW_AT_decl_file   : 10
    <4e6>   DW_AT_decl_line   : 1421
    <4e8>   DW_AT_decl_column : 9
    <4e8>   DW_AT_sibling     : <0x51d>
 <2><4ec>: Abbrev Number: 5 (DW_TAG_member)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x67787): DHCSR
    <4f1>   DW_AT_decl_file   : 10
    <4f1>   DW_AT_decl_line   : 1423
    <4f3>   DW_AT_decl_column : 18
    <4f3>   DW_AT_type        : <0xd0>
    <4f7>   DW_AT_data_member_location: 0
 <2><4f8>: Abbrev Number: 5 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x7bdb4): DCRSR
    <4fd>   DW_AT_decl_file   : 10
    <4fd>   DW_AT_decl_line   : 1424
    <4ff>   DW_AT_decl_column : 18
    <4ff>   DW_AT_type        : <0xd0>
    <503>   DW_AT_data_member_location: 4
 <2><504>: Abbrev Number: 5 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x77606): DCRDR
    <509>   DW_AT_decl_file   : 10
    <509>   DW_AT_decl_line   : 1425
    <50b>   DW_AT_decl_column : 18
    <50b>   DW_AT_type        : <0xd0>
    <50f>   DW_AT_data_member_location: 8
 <2><510>: Abbrev Number: 5 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x4871e): DEMCR
    <515>   DW_AT_decl_file   : 10
    <515>   DW_AT_decl_line   : 1426
    <517>   DW_AT_decl_column : 18
    <517>   DW_AT_type        : <0xd0>
    <51b>   DW_AT_data_member_location: 12
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 30 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x3b547): CoreDebug_Type
    <522>   DW_AT_decl_file   : 10
    <522>   DW_AT_decl_line   : 1427
    <524>   DW_AT_decl_column : 3
    <524>   DW_AT_type        : <0x4e4>
 <1><528>: Abbrev Number: 6 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x5db2a): __compar_fn_t
    <52d>   DW_AT_decl_file   : 11
    <52e>   DW_AT_decl_line   : 57
    <52f>   DW_AT_decl_column : 15
    <530>   DW_AT_type        : <0x534>
 <1><534>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <535>   DW_AT_byte_size   : 4
    <535>   DW_AT_type        : <0x539>
 <1><539>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <53a>   DW_AT_prototyped  : 1
    <53a>   DW_AT_type        : <0x2a>
    <53e>   DW_AT_sibling     : <0x54d>
 <2><542>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <543>   DW_AT_type        : <0x54d>
 <2><547>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <548>   DW_AT_type        : <0x54d>
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <54e>   DW_AT_byte_size   : 4
    <54e>   DW_AT_type        : <0x552>
 <1><552>: Abbrev Number: 42 (DW_TAG_const_type)
 <1><553>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <554>   DW_AT_name        : (indirect string, offset: 0x34da1): taskType_e
    <558>   DW_AT_encoding    : 7	(unsigned)
    <559>   DW_AT_byte_size   : 1
    <55a>   DW_AT_type        : <0x59>
    <55e>   DW_AT_decl_file   : 1
    <55f>   DW_AT_decl_line   : 29
    <560>   DW_AT_decl_column : 14
    <561>   DW_AT_sibling     : <0x572>
 <2><565>: Abbrev Number: 11 (DW_TAG_enumerator)
    <566>   DW_AT_name        : (indirect string, offset: 0x47dd6): taskTypePeriodic
    <56a>   DW_AT_const_value : 0
 <2><56b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <56c>   DW_AT_name        : (indirect string, offset: 0x623c): taskTypeSporadic
    <570>   DW_AT_const_value : 1
 <2><571>: Abbrev Number: 0
 <1><572>: Abbrev Number: 6 (DW_TAG_typedef)
    <573>   DW_AT_name        : (indirect string, offset: 0x34da1): taskType_e
    <577>   DW_AT_decl_file   : 1
    <578>   DW_AT_decl_line   : 31
    <579>   DW_AT_decl_column : 3
    <57a>   DW_AT_type        : <0x553>
 <1><57e>: Abbrev Number: 17 (DW_TAG_variable)
    <57f>   DW_AT_name        : (indirect string, offset: 0x5b280): vTasksListInit
    <583>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 44
    <584>   DW_AT_decl_column : 19
    <585>   DW_AT_type        : <0x109>
    <589>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><58f>: Abbrev Number: 17 (DW_TAG_variable)
    <590>   DW_AT_name        : (indirect string, offset: 0x7071a): xTasksList
    <594>   DW_AT_decl_file   : 1
    <594>   DW_AT_decl_line   : 45
    <595>   DW_AT_decl_column : 15
    <596>   DW_AT_type        : <0x241>
    <59a>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><5a0>: Abbrev Number: 17 (DW_TAG_variable)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x6570a): xListTasksNumber
    <5a5>   DW_AT_decl_file   : 1
    <5a5>   DW_AT_decl_line   : 46
    <5a6>   DW_AT_decl_column : 19
    <5a7>   DW_AT_type        : <0x109>
    <5ab>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><5b1>: Abbrev Number: 17 (DW_TAG_variable)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x192ad): SporadicServerHandle
    <5b6>   DW_AT_decl_file   : 1
    <5b6>   DW_AT_decl_line   : 74
    <5b7>   DW_AT_decl_column : 21
    <5b8>   DW_AT_type        : <0x24d>
    <5bc>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><5c2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x14ec9): MSTextendedTCB
    <5c7>   DW_AT_byte_size   : 124
    <5c8>   DW_AT_decl_file   : 1
    <5c9>   DW_AT_decl_line   : 88
    <5ca>   DW_AT_decl_column : 16
    <5cb>   DW_AT_sibling     : <0x72f>
 <2><5cf>: Abbrev Number: 3 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x3d9e4): pxTaskTCBListItem
    <5d4>   DW_AT_decl_file   : 1
    <5d5>   DW_AT_decl_line   : 91
    <5d6>   DW_AT_decl_column : 13
    <5d7>   DW_AT_type        : <0x1ea>
    <5db>   DW_AT_data_member_location: 0
 <2><5dc>: Abbrev Number: 3 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x3b7c6): pvJobCode
    <5e1>   DW_AT_decl_file   : 1
    <5e2>   DW_AT_decl_line   : 93
    <5e3>   DW_AT_decl_column : 17
    <5e4>   DW_AT_type        : <0xda>
    <5e8>   DW_AT_data_member_location: 20
 <2><5e9>: Abbrev Number: 3 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x4239d): pcName
    <5ee>   DW_AT_decl_file   : 1
    <5ef>   DW_AT_decl_line   : 94
    <5f0>   DW_AT_decl_column : 14
    <5f1>   DW_AT_type        : <0x152>
    <5f5>   DW_AT_data_member_location: 24
 <2><5f6>: Abbrev Number: 3 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x6b801): usStackDepth
    <5fb>   DW_AT_decl_file   : 1
    <5fc>   DW_AT_decl_line   : 95
    <5fd>   DW_AT_decl_column : 25
    <5fe>   DW_AT_type        : <0xa7>
    <602>   DW_AT_data_member_location: 28
 <2><603>: Abbrev Number: 3 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x6bba): pvParameters
    <608>   DW_AT_decl_file   : 1
    <609>   DW_AT_decl_line   : 96
    <60a>   DW_AT_decl_column : 8
    <60b>   DW_AT_type        : <0xf6>
    <60f>   DW_AT_data_member_location: 32
 <2><610>: Abbrev Number: 3 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x2b288): uxPriority
    <615>   DW_AT_decl_file   : 1
    <616>   DW_AT_decl_line   : 97
    <617>   DW_AT_decl_column : 14
    <618>   DW_AT_type        : <0x11f>
    <61c>   DW_AT_data_member_location: 36
 <2><61d>: Abbrev Number: 3 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x45fba): pxCreatedTask
    <622>   DW_AT_decl_file   : 1
    <623>   DW_AT_decl_line   : 98
    <624>   DW_AT_decl_column : 16
    <625>   DW_AT_type        : <0x72f>
    <629>   DW_AT_data_member_location: 40
 <2><62a>: Abbrev Number: 3 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x78d56): taskType
    <62f>   DW_AT_decl_file   : 1
    <630>   DW_AT_decl_line   : 99
    <631>   DW_AT_decl_column : 18
    <632>   DW_AT_type        : <0x553>
    <636>   DW_AT_data_member_location: 44
 <2><637>: Abbrev Number: 3 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0x5899a): xTaskPeriod
    <63c>   DW_AT_decl_file   : 1
    <63d>   DW_AT_decl_line   : 101
    <63e>   DW_AT_decl_column : 13
    <63f>   DW_AT_type        : <0x135>
    <643>   DW_AT_data_member_location: 48
 <2><644>: Abbrev Number: 3 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x6daee): xTaskDeadline
    <649>   DW_AT_decl_file   : 1
    <64a>   DW_AT_decl_line   : 102
    <64b>   DW_AT_decl_column : 13
    <64c>   DW_AT_type        : <0x135>
    <650>   DW_AT_data_member_location: 52
 <2><651>: Abbrev Number: 3 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x3fadd): xTaskPhase
    <656>   DW_AT_decl_file   : 1
    <657>   DW_AT_decl_line   : 103
    <658>   DW_AT_decl_column : 13
    <659>   DW_AT_type        : <0x135>
    <65d>   DW_AT_data_member_location: 56
 <2><65e>: Abbrev Number: 3 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x2765e): xTaskWCET
    <663>   DW_AT_decl_file   : 1
    <664>   DW_AT_decl_line   : 104
    <665>   DW_AT_decl_column : 13
    <666>   DW_AT_type        : <0x135>
    <66a>   DW_AT_data_member_location: 60
 <2><66b>: Abbrev Number: 3 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x3ad73): xPrevReleaseTime
    <670>   DW_AT_decl_file   : 1
    <671>   DW_AT_decl_line   : 106
    <672>   DW_AT_decl_column : 13
    <673>   DW_AT_type        : <0x135>
    <677>   DW_AT_data_member_location: 64
 <2><678>: Abbrev Number: 3 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x491ee): xPrevExecTime
    <67d>   DW_AT_decl_file   : 1
    <67e>   DW_AT_decl_line   : 107
    <67f>   DW_AT_decl_column : 13
    <680>   DW_AT_type        : <0x135>
    <684>   DW_AT_data_member_location: 68
 <2><685>: Abbrev Number: 3 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0x655ef): xPrevAbsDeadline
    <68a>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 108
    <68c>   DW_AT_decl_column : 13
    <68d>   DW_AT_type        : <0x135>
    <691>   DW_AT_data_member_location: 72
 <2><692>: Abbrev Number: 3 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0xfb): xPrevStartTime
    <697>   DW_AT_decl_file   : 1
    <698>   DW_AT_decl_line   : 109
    <699>   DW_AT_decl_column : 13
    <69a>   DW_AT_type        : <0x135>
    <69e>   DW_AT_data_member_location: 76
 <2><69f>: Abbrev Number: 3 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x5e6e9): xPrevFinishTime
    <6a4>   DW_AT_decl_file   : 1
    <6a5>   DW_AT_decl_line   : 110
    <6a6>   DW_AT_decl_column : 13
    <6a7>   DW_AT_type        : <0x135>
    <6ab>   DW_AT_data_member_location: 80
 <2><6ac>: Abbrev Number: 3 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x158eb): uNumOfMissedDeadlines
    <6b1>   DW_AT_decl_file   : 1
    <6b2>   DW_AT_decl_line   : 111
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x11f>
    <6b8>   DW_AT_data_member_location: 84
 <2><6b9>: Abbrev Number: 3 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x777ee): xNextIdealReleaseTime
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 112
    <6c0>   DW_AT_decl_column : 13
    <6c1>   DW_AT_type        : <0x135>
    <6c5>   DW_AT_data_member_location: 88
 <2><6c6>: Abbrev Number: 3 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x503b5): xTaskInitDone
    <6cb>   DW_AT_decl_file   : 1
    <6cc>   DW_AT_decl_line   : 116
    <6cd>   DW_AT_decl_column : 13
    <6ce>   DW_AT_type        : <0x109>
    <6d2>   DW_AT_data_member_location: 92
 <2><6d3>: Abbrev Number: 3 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x2df30): xTaskSpecificTimer
    <6d8>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 121
    <6da>   DW_AT_decl_column : 16
    <6db>   DW_AT_type        : <0x367>
    <6df>   DW_AT_data_member_location: 96
 <2><6e0>: Abbrev Number: 3 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x83b31): xUsFromIdealRelease
    <6e5>   DW_AT_decl_file   : 1
    <6e6>   DW_AT_decl_line   : 127
    <6e7>   DW_AT_decl_column : 10
    <6e8>   DW_AT_type        : <0xb8>
    <6ec>   DW_AT_data_member_location: 100
 <2><6ed>: Abbrev Number: 3 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x2e7a7): xNumOfIterations
    <6f2>   DW_AT_decl_file   : 1
    <6f3>   DW_AT_decl_line   : 128
    <6f4>   DW_AT_decl_column : 11
    <6f5>   DW_AT_type        : <0xc4>
    <6f9>   DW_AT_data_member_location: 104
 <2><6fa>: Abbrev Number: 3 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x413a5): xUsAverageReleaseGap
    <6ff>   DW_AT_decl_file   : 1
    <700>   DW_AT_decl_line   : 129
    <701>   DW_AT_decl_column : 10
    <702>   DW_AT_type        : <0xb8>
    <706>   DW_AT_data_member_location: 108
 <2><707>: Abbrev Number: 3 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x7e93c): xTaskInterarrivalTime
    <70c>   DW_AT_decl_file   : 1
    <70d>   DW_AT_decl_line   : 134
    <70e>   DW_AT_decl_column : 13
    <70f>   DW_AT_type        : <0x135>
    <713>   DW_AT_data_member_location: 112
 <2><714>: Abbrev Number: 3 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x43bcd): xInterarrivalTimerRunning
    <719>   DW_AT_decl_file   : 1
    <71a>   DW_AT_decl_line   : 135
    <71b>   DW_AT_decl_column : 13
    <71c>   DW_AT_type        : <0x109>
    <720>   DW_AT_data_member_location: 116
 <2><721>: Abbrev Number: 3 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0x3d613): xJobCalled
    <726>   DW_AT_decl_file   : 1
    <727>   DW_AT_decl_line   : 136
    <728>   DW_AT_decl_column : 13
    <729>   DW_AT_type        : <0x109>
    <72d>   DW_AT_data_member_location: 120
 <2><72e>: Abbrev Number: 0
 <1><72f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <730>   DW_AT_byte_size   : 4
    <730>   DW_AT_type        : <0x24d>
 <1><734>: Abbrev Number: 9 (DW_TAG_const_type)
    <735>   DW_AT_type        : <0x72f>
 <1><739>: Abbrev Number: 6 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x8c25b): extTCB_t
    <73e>   DW_AT_decl_file   : 1
    <73f>   DW_AT_decl_line   : 145
    <740>   DW_AT_decl_column : 3
    <741>   DW_AT_type        : <0x5c2>
 <1><745>: Abbrev Number: 2 (DW_TAG_variable)
    <746>   DW_AT_name        : (indirect string, offset: 0x7b045): prvXMaxInterrarrivalTime
    <74a>   DW_AT_decl_file   : 1
    <74a>   DW_AT_decl_line   : 422
    <74c>   DW_AT_decl_column : 19
    <74d>   DW_AT_type        : <0x135>
    <751>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><757>: Abbrev Number: 24 (DW_TAG_variable)
    <758>   DW_AT_name        : (indirect string, offset: 0x9585): SporadicServerBudget
    <75c>   DW_AT_decl_file   : 1
    <75c>   DW_AT_decl_line   : 735
    <75e>   DW_AT_decl_column : 21
    <75e>   DW_AT_type        : <0x115>
    <762>   DW_AT_external    : 1
    <762>   DW_AT_location    : 5 byte block: 3 a4 0 0 20 	(DW_OP_addr: 200000a4)
 <1><768>: Abbrev Number: 24 (DW_TAG_variable)
    <769>   DW_AT_name        : (indirect string, offset: 0x5eb73): isSSJobSuspended
    <76d>   DW_AT_decl_file   : 1
    <76d>   DW_AT_decl_line   : 737
    <76f>   DW_AT_decl_column : 21
    <76f>   DW_AT_type        : <0x115>
    <773>   DW_AT_external    : 1
    <773>   DW_AT_location    : 5 byte block: 3 a8 0 0 20 	(DW_OP_addr: 200000a8)
 <1><779>: Abbrev Number: 24 (DW_TAG_variable)
    <77a>   DW_AT_name        : (indirect string, offset: 0x817ce): isNextTaskAvailable
    <77e>   DW_AT_decl_file   : 1
    <77e>   DW_AT_decl_line   : 782
    <780>   DW_AT_decl_column : 21
    <780>   DW_AT_type        : <0x115>
    <784>   DW_AT_external    : 1
    <784>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><78a>: Abbrev Number: 44 (DW_TAG_subprogram)
    <78b>   DW_AT_external    : 1
    <78b>   DW_AT_name        : (indirect string, offset: 0x729f2): vTaskStartScheduler
    <78f>   DW_AT_decl_file   : 8
    <790>   DW_AT_decl_line   : 1180
    <792>   DW_AT_decl_column : 6
    <793>   DW_AT_prototyped  : 1
    <793>   DW_AT_declaration : 1
 <1><793>: Abbrev Number: 45 (DW_TAG_subprogram)
    <794>   DW_AT_external    : 1
    <794>   DW_AT_name        : (indirect string, offset: 0xd15a): qsort
    <798>   DW_AT_decl_file   : 11
    <799>   DW_AT_decl_line   : 143
    <79a>   DW_AT_decl_column : 6
    <79b>   DW_AT_prototyped  : 1
    <79b>   DW_AT_declaration : 1
    <79b>   DW_AT_sibling     : <0x7b4>
 <2><79f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a0>   DW_AT_type        : <0xf6>
 <2><7a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7a5>   DW_AT_type        : <0x31>
 <2><7a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7aa>   DW_AT_type        : <0x31>
 <2><7ae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7af>   DW_AT_type        : <0x528>
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 18 (DW_TAG_subprogram)
    <7b5>   DW_AT_external    : 1
    <7b5>   DW_AT_name        : (indirect string, offset: 0x3b7f6): vTaskResume
    <7b9>   DW_AT_decl_file   : 8
    <7ba>   DW_AT_decl_line   : 1118
    <7bc>   DW_AT_decl_column : 6
    <7bd>   DW_AT_prototyped  : 1
    <7bd>   DW_AT_declaration : 1
    <7bd>   DW_AT_sibling     : <0x7c7>
 <2><7c1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7c2>   DW_AT_type        : <0x24d>
 <2><7c6>: Abbrev Number: 0
 <1><7c7>: Abbrev Number: 18 (DW_TAG_subprogram)
    <7c8>   DW_AT_external    : 1
    <7c8>   DW_AT_name        : (indirect string, offset: 0x16de1): vTimerSetTimerID
    <7cc>   DW_AT_decl_file   : 9
    <7cd>   DW_AT_decl_line   : 407
    <7cf>   DW_AT_decl_column : 6
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_declaration : 1
    <7d0>   DW_AT_sibling     : <0x7df>
 <2><7d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_type        : <0x367>
 <2><7d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7da>   DW_AT_type        : <0xf6>
 <2><7de>: Abbrev Number: 0
 <1><7df>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7e0>   DW_AT_external    : 1
    <7e0>   DW_AT_name        : (indirect string, offset: 0x5ffc5): uxListRemove
    <7e4>   DW_AT_decl_file   : 7
    <7e5>   DW_AT_decl_line   : 405
    <7e7>   DW_AT_decl_column : 13
    <7e8>   DW_AT_prototyped  : 1
    <7e8>   DW_AT_type        : <0x11f>
    <7ec>   DW_AT_declaration : 1
    <7ec>   DW_AT_sibling     : <0x7f6>
 <2><7f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f1>   DW_AT_type        : <0x23c>
 <2><7f5>: Abbrev Number: 0
 <1><7f6>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7f7>   DW_AT_external    : 1
    <7f7>   DW_AT_name        : (indirect string, offset: 0x549d2): vPortExitCritical
    <7fb>   DW_AT_decl_file   : 2
    <7fb>   DW_AT_decl_line   : 98
    <7fc>   DW_AT_decl_column : 13
    <7fc>   DW_AT_prototyped  : 1
    <7fc>   DW_AT_declaration : 1
 <1><7fc>: Abbrev Number: 18 (DW_TAG_subprogram)
    <7fd>   DW_AT_external    : 1
    <7fd>   DW_AT_name        : (indirect string, offset: 0x19aa6): vTaskSuspend
    <801>   DW_AT_decl_file   : 8
    <802>   DW_AT_decl_line   : 1069
    <804>   DW_AT_decl_column : 6
    <805>   DW_AT_prototyped  : 1
    <805>   DW_AT_declaration : 1
    <805>   DW_AT_sibling     : <0x80f>
 <2><809>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <80a>   DW_AT_type        : <0x24d>
 <2><80e>: Abbrev Number: 0
 <1><80f>: Abbrev Number: 31 (DW_TAG_subprogram)
    <810>   DW_AT_external    : 1
    <810>   DW_AT_name        : (indirect string, offset: 0x8891d): vPortEnterCritical
    <814>   DW_AT_decl_file   : 2
    <814>   DW_AT_decl_line   : 97
    <815>   DW_AT_decl_column : 13
    <815>   DW_AT_prototyped  : 1
    <815>   DW_AT_declaration : 1
 <1><815>: Abbrev Number: 46 (DW_TAG_subprogram)
    <816>   DW_AT_external    : 1
    <816>   DW_AT_name        : pow
    <81a>   DW_AT_decl_file   : 13
    <81b>   DW_AT_decl_line   : 111
    <81c>   DW_AT_decl_column : 15
    <81d>   DW_AT_prototyped  : 1
    <81d>   DW_AT_type        : <0x3a5>
    <821>   DW_AT_declaration : 1
    <821>   DW_AT_sibling     : <0x830>
 <2><825>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <826>   DW_AT_type        : <0x3a5>
 <2><82a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <82b>   DW_AT_type        : <0x3a5>
 <2><82f>: Abbrev Number: 0
 <1><830>: Abbrev Number: 14 (DW_TAG_subprogram)
    <831>   DW_AT_external    : 1
    <831>   DW_AT_name        : (indirect string, offset: 0x44920): xTaskGenericNotify
    <835>   DW_AT_decl_file   : 8
    <836>   DW_AT_decl_line   : 1853
    <838>   DW_AT_decl_column : 12
    <839>   DW_AT_prototyped  : 1
    <839>   DW_AT_type        : <0x109>
    <83d>   DW_AT_declaration : 1
    <83d>   DW_AT_sibling     : <0x856>
 <2><841>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <842>   DW_AT_type        : <0x24d>
 <2><846>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <847>   DW_AT_type        : <0xc4>
 <2><84b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <84c>   DW_AT_type        : <0x2c7>
 <2><850>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <851>   DW_AT_type        : <0x856>
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
    <857>   DW_AT_type        : <0xc4>
 <1><85b>: Abbrev Number: 9 (DW_TAG_const_type)
    <85c>   DW_AT_type        : <0x856>
 <1><860>: Abbrev Number: 14 (DW_TAG_subprogram)
    <861>   DW_AT_external    : 1
    <861>   DW_AT_name        : (indirect string, offset: 0x374c5): xTaskNotifyWait
    <865>   DW_AT_decl_file   : 8
    <866>   DW_AT_decl_line   : 2021
    <868>   DW_AT_decl_column : 12
    <869>   DW_AT_prototyped  : 1
    <869>   DW_AT_type        : <0x109>
    <86d>   DW_AT_declaration : 1
    <86d>   DW_AT_sibling     : <0x886>
 <2><871>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <872>   DW_AT_type        : <0xc4>
 <2><876>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <877>   DW_AT_type        : <0xc4>
 <2><87b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <87c>   DW_AT_type        : <0x856>
 <2><880>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <881>   DW_AT_type        : <0x135>
 <2><885>: Abbrev Number: 0
 <1><886>: Abbrev Number: 14 (DW_TAG_subprogram)
    <887>   DW_AT_external    : 1
    <887>   DW_AT_name        : (indirect string, offset: 0x316ff): uxTaskGetSystemState
    <88b>   DW_AT_decl_file   : 8
    <88c>   DW_AT_decl_line   : 1641
    <88e>   DW_AT_decl_column : 13
    <88f>   DW_AT_prototyped  : 1
    <88f>   DW_AT_type        : <0x11f>
    <893>   DW_AT_declaration : 1
    <893>   DW_AT_sibling     : <0x8a7>
 <2><897>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <898>   DW_AT_type        : <0x8ac>
 <2><89c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <89d>   DW_AT_type        : <0x130>
 <2><8a1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8a2>   DW_AT_type        : <0x85b>
 <2><8a6>: Abbrev Number: 0
 <1><8a7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8a8>   DW_AT_byte_size   : 4
    <8a8>   DW_AT_type        : <0x35b>
 <1><8ac>: Abbrev Number: 9 (DW_TAG_const_type)
    <8ad>   DW_AT_type        : <0x8a7>
 <1><8b1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8b2>   DW_AT_external    : 1
    <8b2>   DW_AT_name        : (indirect string, offset: 0x2841e): pvTimerGetTimerID
    <8b6>   DW_AT_decl_file   : 9
    <8b7>   DW_AT_decl_line   : 386
    <8b9>   DW_AT_decl_column : 7
    <8ba>   DW_AT_prototyped  : 1
    <8ba>   DW_AT_type        : <0xf6>
    <8be>   DW_AT_declaration : 1
    <8be>   DW_AT_sibling     : <0x8c8>
 <2><8c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8c3>   DW_AT_type        : <0x373>
 <2><8c7>: Abbrev Number: 0
 <1><8c8>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8c9>   DW_AT_external    : 1
    <8c9>   DW_AT_name        : (indirect string, offset: 0x67fee): pvTaskGetThreadLocalStoragePointer
    <8cd>   DW_AT_decl_file   : 8
    <8ce>   DW_AT_decl_line   : 1518
    <8d0>   DW_AT_decl_column : 8
    <8d1>   DW_AT_prototyped  : 1
    <8d1>   DW_AT_type        : <0xf6>
    <8d5>   DW_AT_declaration : 1
    <8d5>   DW_AT_sibling     : <0x8e4>
 <2><8d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8da>   DW_AT_type        : <0x24d>
 <2><8de>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8df>   DW_AT_type        : <0x109>
 <2><8e3>: Abbrev Number: 0
 <1><8e4>: Abbrev Number: 32 (DW_TAG_subprogram)
    <8e5>   DW_AT_external    : 1
    <8e5>   DW_AT_name        : (indirect string, offset: 0x660b8): xTaskGetCurrentTaskHandle
    <8e9>   DW_AT_decl_file   : 8
    <8e9>   DW_AT_decl_line   : 2438
    <8eb>   DW_AT_decl_column : 14
    <8ec>   DW_AT_prototyped  : 1
    <8ec>   DW_AT_type        : <0x24d>
    <8f0>   DW_AT_declaration : 1
 <1><8f0>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8f1>   DW_AT_external    : 1
    <8f1>   DW_AT_name        : (indirect string, offset: 0x8cdb8): ulTaskNotifyTake
    <8f5>   DW_AT_decl_file   : 8
    <8f6>   DW_AT_decl_line   : 2191
    <8f8>   DW_AT_decl_column : 10
    <8f9>   DW_AT_prototyped  : 1
    <8f9>   DW_AT_type        : <0xc4>
    <8fd>   DW_AT_declaration : 1
    <8fd>   DW_AT_sibling     : <0x90c>
 <2><901>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <902>   DW_AT_type        : <0x109>
 <2><906>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <907>   DW_AT_type        : <0x135>
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 33 (DW_TAG_subprogram)
    <90d>   DW_AT_external    : 1
    <90d>   DW_AT_name        : (indirect string, offset: 0x8f7e9): pvPortMalloc
    <911>   DW_AT_decl_file   : 12
    <912>   DW_AT_decl_line   : 163
    <913>   DW_AT_decl_column : 7
    <914>   DW_AT_prototyped  : 1
    <914>   DW_AT_type        : <0xf6>
    <918>   DW_AT_declaration : 1
    <918>   DW_AT_sibling     : <0x922>
 <2><91c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91d>   DW_AT_type        : <0x31>
 <2><921>: Abbrev Number: 0
 <1><922>: Abbrev Number: 18 (DW_TAG_subprogram)
    <923>   DW_AT_external    : 1
    <923>   DW_AT_name        : (indirect string, offset: 0x54dd9): vListInsertEnd
    <927>   DW_AT_decl_file   : 7
    <928>   DW_AT_decl_line   : 390
    <92a>   DW_AT_decl_column : 6
    <92b>   DW_AT_prototyped  : 1
    <92b>   DW_AT_declaration : 1
    <92b>   DW_AT_sibling     : <0x93a>
 <2><92f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <930>   DW_AT_type        : <0x93f>
 <2><934>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <935>   DW_AT_type        : <0x23c>
 <2><939>: Abbrev Number: 0
 <1><93a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <93b>   DW_AT_byte_size   : 4
    <93b>   DW_AT_type        : <0x241>
 <1><93f>: Abbrev Number: 9 (DW_TAG_const_type)
    <940>   DW_AT_type        : <0x93a>
 <1><944>: Abbrev Number: 18 (DW_TAG_subprogram)
    <945>   DW_AT_external    : 1
    <945>   DW_AT_name        : (indirect string, offset: 0x51335): vListInitialiseItem
    <949>   DW_AT_decl_file   : 7
    <94a>   DW_AT_decl_line   : 356
    <94c>   DW_AT_decl_column : 6
    <94d>   DW_AT_prototyped  : 1
    <94d>   DW_AT_declaration : 1
    <94d>   DW_AT_sibling     : <0x957>
 <2><951>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <952>   DW_AT_type        : <0x23c>
 <2><956>: Abbrev Number: 0
 <1><957>: Abbrev Number: 18 (DW_TAG_subprogram)
    <958>   DW_AT_external    : 1
    <958>   DW_AT_name        : (indirect string, offset: 0x53ad6): vListInitialise
    <95c>   DW_AT_decl_file   : 7
    <95d>   DW_AT_decl_line   : 345
    <95f>   DW_AT_decl_column : 6
    <960>   DW_AT_prototyped  : 1
    <960>   DW_AT_declaration : 1
    <960>   DW_AT_sibling     : <0x96a>
 <2><964>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <965>   DW_AT_type        : <0x93f>
 <2><969>: Abbrev Number: 0
 <1><96a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <96b>   DW_AT_external    : 1
    <96b>   DW_AT_name        : (indirect string, offset: 0x7f2e3): xTimerGenericCommand
    <96f>   DW_AT_decl_file   : 9
    <970>   DW_AT_decl_line   : 1296
    <972>   DW_AT_decl_column : 12
    <973>   DW_AT_prototyped  : 1
    <973>   DW_AT_type        : <0x109>
    <977>   DW_AT_declaration : 1
    <977>   DW_AT_sibling     : <0x995>
 <2><97b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <97c>   DW_AT_type        : <0x367>
 <2><980>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <981>   DW_AT_type        : <0x11a>
 <2><985>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <986>   DW_AT_type        : <0x141>
 <2><98a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <98b>   DW_AT_type        : <0x99a>
 <2><98f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <990>   DW_AT_type        : <0x141>
 <2><994>: Abbrev Number: 0
 <1><995>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <996>   DW_AT_type        : <0x109>
 <1><99a>: Abbrev Number: 9 (DW_TAG_const_type)
    <99b>   DW_AT_type        : <0x995>
 <1><99f>: Abbrev Number: 32 (DW_TAG_subprogram)
    <9a0>   DW_AT_external    : 1
    <9a0>   DW_AT_name        : (indirect string, offset: 0x4730): xTaskGetTickCount
    <9a4>   DW_AT_decl_file   : 8
    <9a4>   DW_AT_decl_line   : 1356
    <9a6>   DW_AT_decl_column : 12
    <9a7>   DW_AT_prototyped  : 1
    <9a7>   DW_AT_type        : <0x135>
    <9ab>   DW_AT_declaration : 1
 <1><9ab>: Abbrev Number: 33 (DW_TAG_subprogram)
    <9ac>   DW_AT_external    : 1
    <9ac>   DW_AT_name        : (indirect string, offset: 0x8a571): xTimerCreate
    <9b0>   DW_AT_decl_file   : 9
    <9b1>   DW_AT_decl_line   : 228
    <9b2>   DW_AT_decl_column : 16
    <9b3>   DW_AT_prototyped  : 1
    <9b3>   DW_AT_type        : <0x367>
    <9b7>   DW_AT_declaration : 1
    <9b7>   DW_AT_sibling     : <0x9d5>
 <2><9bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9bc>   DW_AT_type        : <0x157>
 <2><9c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9c1>   DW_AT_type        : <0x141>
 <2><9c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9c6>   DW_AT_type        : <0x130>
 <2><9ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9cb>   DW_AT_type        : <0xf8>
 <2><9cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9d0>   DW_AT_type        : <0x382>
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 18 (DW_TAG_subprogram)
    <9d6>   DW_AT_external    : 1
    <9d6>   DW_AT_name        : (indirect string, offset: 0x5b578): vTaskSetThreadLocalStoragePointer
    <9da>   DW_AT_decl_file   : 8
    <9db>   DW_AT_decl_line   : 1517
    <9dd>   DW_AT_decl_column : 7
    <9de>   DW_AT_prototyped  : 1
    <9de>   DW_AT_declaration : 1
    <9de>   DW_AT_sibling     : <0x9f2>
 <2><9e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9e3>   DW_AT_type        : <0x24d>
 <2><9e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9e8>   DW_AT_type        : <0x109>
 <2><9ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ed>   DW_AT_type        : <0xf6>
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 14 (DW_TAG_subprogram)
    <9f3>   DW_AT_external    : 1
    <9f3>   DW_AT_name        : (indirect string, offset: 0x6bf12): xTaskCreate
    <9f7>   DW_AT_decl_file   : 8
    <9f8>   DW_AT_decl_line   : 330
    <9fa>   DW_AT_decl_column : 13
    <9fb>   DW_AT_prototyped  : 1
    <9fb>   DW_AT_type        : <0x109>
    <9ff>   DW_AT_declaration : 1
    <9ff>   DW_AT_sibling     : <0xa22>
 <2><a03>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a04>   DW_AT_type        : <0xda>
 <2><a08>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a09>   DW_AT_type        : <0x157>
 <2><a0d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a0e>   DW_AT_type        : <0xb3>
 <2><a12>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a13>   DW_AT_type        : <0xf8>
 <2><a17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a18>   DW_AT_type        : <0x11f>
 <2><a1c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a1d>   DW_AT_type        : <0x734>
 <2><a21>: Abbrev Number: 0
 <1><a22>: Abbrev Number: 15 (DW_TAG_subprogram)
    <a23>   DW_AT_name        : (indirect string, offset: 0x5b3fb): prvMSTDispatch
    <a27>   DW_AT_decl_file   : 1
    <a27>   DW_AT_decl_line   : 1126
    <a29>   DW_AT_decl_column : 13
    <a29>   DW_AT_prototyped  : 1
    <a29>   DW_AT_low_pc      : 0x8001d64
    <a2d>   DW_AT_high_pc     : 0xa4
    <a31>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a33>   DW_AT_call_all_tail_calls: 1
    <a33>   DW_AT_sibling     : <0xac3>
 <2><a37>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a38>   DW_AT_name        : (indirect string, offset: 0x31358): forTask
    <a3c>   DW_AT_decl_file   : 1
    <a3c>   DW_AT_decl_line   : 1126
    <a3e>   DW_AT_decl_column : 42
    <a3f>   DW_AT_type        : <0x72f>
    <a43>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a46>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a47>   DW_AT_name        : (indirect string, offset: 0x20b22): xAsCallee
    <a4b>   DW_AT_decl_file   : 1
    <a4b>   DW_AT_decl_line   : 1126
    <a4d>   DW_AT_decl_column : 62
    <a4e>   DW_AT_type        : <0x109>
    <a52>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><a55>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a56>   DW_AT_name        : (indirect string, offset: 0x8d3d8): xOfTaskType
    <a5a>   DW_AT_decl_file   : 1
    <a5a>   DW_AT_decl_line   : 1127
    <a5c>   DW_AT_decl_column : 14
    <a5d>   DW_AT_type        : <0x572>
    <a61>   DW_AT_location    : 2 byte block: 91 5f 	(DW_OP_fbreg: -33)
 <2><a64>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a65>   DW_AT_name        : (indirect string, offset: 0x8a182): xFromUserRequest
    <a69>   DW_AT_decl_file   : 1
    <a69>   DW_AT_decl_line   : 1127
    <a6b>   DW_AT_decl_column : 38
    <a6c>   DW_AT_type        : <0x109>
    <a70>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><a73>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <a74>   DW_AT_low_pc      : 0x8001d7a
    <a78>   DW_AT_high_pc     : 0x80
 <3><a7c>: Abbrev Number: 2 (DW_TAG_variable)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x140ac): xCurrExtTCB
    <a81>   DW_AT_decl_file   : 1
    <a81>   DW_AT_decl_line   : 1133
    <a83>   DW_AT_decl_column : 13
    <a84>   DW_AT_type        : <0xac3>
    <a88>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a8b>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <a8c>   DW_AT_abstract_origin: <0x14b9>
    <a90>   DW_AT_low_pc      : 0x8001dba
    <a94>   DW_AT_high_pc     : 0x14
    <a98>   DW_AT_call_file   : 1
    <a98>   DW_AT_call_line   : 1169
    <a9a>   DW_AT_call_column : 4
    <a9b>   DW_AT_sibling     : <0xaa8>
 <4><a9f>: Abbrev Number: 8 (DW_TAG_variable)
    <aa0>   DW_AT_abstract_origin: <0x14c2>
    <aa4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <4><aa7>: Abbrev Number: 0
 <3><aa8>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <aa9>   DW_AT_abstract_origin: <0x14b9>
    <aad>   DW_AT_low_pc      : 0x8001de2
    <ab1>   DW_AT_high_pc     : 0x14
    <ab5>   DW_AT_call_file   : 1
    <ab5>   DW_AT_call_line   : 1182
    <ab7>   DW_AT_call_column : 4
 <4><ab8>: Abbrev Number: 8 (DW_TAG_variable)
    <ab9>   DW_AT_abstract_origin: <0x14c2>
    <abd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><ac0>: Abbrev Number: 0
 <3><ac1>: Abbrev Number: 0
 <2><ac2>: Abbrev Number: 0
 <1><ac3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ac4>   DW_AT_byte_size   : 4
    <ac4>   DW_AT_type        : <0x739>
 <1><ac8>: Abbrev Number: 47 (DW_TAG_subprogram)
    <ac9>   DW_AT_external    : 1
    <ac9>   DW_AT_name        : (indirect string, offset: 0x867b8): vMSTSchedulerStart
    <acd>   DW_AT_decl_file   : 1
    <ace>   DW_AT_decl_line   : 981
    <ad0>   DW_AT_decl_column : 6
    <ad1>   DW_AT_prototyped  : 1
    <ad1>   DW_AT_low_pc      : 0x8001cec
    <ad5>   DW_AT_high_pc     : 0x78
    <ad9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <adb>   DW_AT_call_all_tail_calls: 1
    <adb>   DW_AT_sibling     : <0xb17>
 <2><adf>: Abbrev Number: 2 (DW_TAG_variable)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x42426): tSS_Period
    <ae4>   DW_AT_decl_file   : 1
    <ae4>   DW_AT_decl_line   : 996
    <ae6>   DW_AT_decl_column : 13
    <ae7>   DW_AT_type        : <0x135>
    <aeb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><aee>: Abbrev Number: 2 (DW_TAG_variable)
    <aef>   DW_AT_name        : (indirect string, offset: 0x3095b): tSS_WCET
    <af3>   DW_AT_decl_file   : 1
    <af3>   DW_AT_decl_line   : 997
    <af5>   DW_AT_decl_column : 13
    <af6>   DW_AT_type        : <0x135>
    <afa>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><afd>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <afe>   DW_AT_abstract_origin: <0x14b9>
    <b02>   DW_AT_low_pc      : 0x8001d32
    <b06>   DW_AT_high_pc     : 0x14
    <b0a>   DW_AT_call_file   : 1
    <b0a>   DW_AT_call_line   : 1006
    <b0c>   DW_AT_call_column : 2
 <3><b0d>: Abbrev Number: 8 (DW_TAG_variable)
    <b0e>   DW_AT_abstract_origin: <0x14c2>
    <b12>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><b15>: Abbrev Number: 0
 <2><b16>: Abbrev Number: 0
 <1><b17>: Abbrev Number: 48 (DW_TAG_subprogram)
    <b18>   DW_AT_name        : (indirect string, offset: 0x20fcb): prvComputeOrderedPriorities
    <b1c>   DW_AT_decl_file   : 1
    <b1d>   DW_AT_decl_line   : 911
    <b1f>   DW_AT_decl_column : 19
    <b20>   DW_AT_type        : <0x109>
    <b24>   DW_AT_low_pc      : 0x8001b68
    <b28>   DW_AT_high_pc     : 0x184
    <b2c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b2e>   DW_AT_call_all_tail_calls: 1
    <b2e>   DW_AT_sibling     : <0xc5f>
 <2><b32>: Abbrev Number: 2 (DW_TAG_variable)
    <b33>   DW_AT_name        : (indirect string, offset: 0x374b3): initialEvaluation
    <b37>   DW_AT_decl_file   : 1
    <b37>   DW_AT_decl_line   : 912
    <b39>   DW_AT_decl_column : 20
    <b3a>   DW_AT_type        : <0x109>
    <b3e>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <2><b44>: Abbrev Number: 2 (DW_TAG_variable)
    <b45>   DW_AT_name        : (indirect string, offset: 0x35c49): listArray
    <b49>   DW_AT_decl_file   : 1
    <b49>   DW_AT_decl_line   : 913
    <b4b>   DW_AT_decl_column : 12
    <b4c>   DW_AT_type        : <0xc5f>
    <b50>   DW_AT_location    : 3 byte block: 91 50 6 	(DW_OP_fbreg: -48; DW_OP_deref)
 <2><b54>: Abbrev Number: 2 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0x73e9b): xItm
    <b59>   DW_AT_decl_file   : 1
    <b59>   DW_AT_decl_line   : 916
    <b5b>   DW_AT_decl_column : 14
    <b5c>   DW_AT_type        : <0x237>
    <b60>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b63>: Abbrev Number: 2 (DW_TAG_variable)
    <b64>   DW_AT_name        : (indirect string, offset: 0x6e30d): uxUsedPriority
    <b68>   DW_AT_decl_file   : 1
    <b68>   DW_AT_decl_line   : 939
    <b6a>   DW_AT_decl_column : 14
    <b6b>   DW_AT_type        : <0x11f>
    <b6f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b72>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <b73>   DW_AT_low_pc      : 0x8001bca
    <b77>   DW_AT_high_pc     : 0x4a
    <b7b>   DW_AT_sibling     : <0xbc1>
 <3><b7f>: Abbrev Number: 19 (DW_TAG_variable)
    <b80>   DW_AT_name        : i
    <b82>   DW_AT_decl_file   : 1
    <b82>   DW_AT_decl_line   : 917
    <b84>   DW_AT_decl_column : 11
    <b85>   DW_AT_type        : <0x2a>
    <b89>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><b8c>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b8d>   DW_AT_low_pc      : 0x8001bd0
    <b91>   DW_AT_high_pc     : 0x34
 <4><b95>: Abbrev Number: 2 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x7ed52): xTCB
    <b9a>   DW_AT_decl_file   : 1
    <b9a>   DW_AT_decl_line   : 918
    <b9c>   DW_AT_decl_column : 13
    <b9d>   DW_AT_type        : <0xac3>
    <ba1>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <4><ba5>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <ba6>   DW_AT_abstract_origin: <0x14b9>
    <baa>   DW_AT_low_pc      : 0x8001bdc
    <bae>   DW_AT_high_pc     : 0x14
    <bb2>   DW_AT_call_file   : 1
    <bb2>   DW_AT_call_line   : 920
    <bb4>   DW_AT_call_column : 3
 <5><bb5>: Abbrev Number: 8 (DW_TAG_variable)
    <bb6>   DW_AT_abstract_origin: <0x14c2>
    <bba>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <5><bbe>: Abbrev Number: 0
 <4><bbf>: Abbrev Number: 0
 <3><bc0>: Abbrev Number: 0
 <2><bc1>: Abbrev Number: 49 (DW_TAG_lexical_block)
    <bc2>   DW_AT_ranges      : 0xc
    <bc6>   DW_AT_sibling     : <0xc1c>
 <3><bca>: Abbrev Number: 2 (DW_TAG_variable)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x68a6): xCurrInx
    <bcf>   DW_AT_decl_file   : 1
    <bcf>   DW_AT_decl_line   : 941
    <bd1>   DW_AT_decl_column : 19
    <bd2>   DW_AT_type        : <0x11f>
    <bd6>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><bd9>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <bda>   DW_AT_low_pc      : 0x8001c40
    <bde>   DW_AT_high_pc     : 0x3c
 <4><be2>: Abbrev Number: 2 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0x4b7dd): xTCB_Reference
    <be7>   DW_AT_decl_file   : 1
    <be7>   DW_AT_decl_line   : 942
    <be9>   DW_AT_decl_column : 13
    <bea>   DW_AT_type        : <0xac3>
    <bee>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><bf1>: Abbrev Number: 2 (DW_TAG_variable)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x36fed): bNewPriority
    <bf6>   DW_AT_decl_file   : 1
    <bf6>   DW_AT_decl_line   : 943
    <bf8>   DW_AT_decl_column : 15
    <bf9>   DW_AT_type        : <0x11f>
    <bfd>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><c00>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <c01>   DW_AT_abstract_origin: <0x14b9>
    <c05>   DW_AT_low_pc      : 0x8001c64
    <c09>   DW_AT_high_pc     : 0x14
    <c0d>   DW_AT_call_file   : 1
    <c0d>   DW_AT_call_line   : 951
    <c0f>   DW_AT_call_column : 3
 <5><c10>: Abbrev Number: 8 (DW_TAG_variable)
    <c11>   DW_AT_abstract_origin: <0x14c2>
    <c15>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <5><c19>: Abbrev Number: 0
 <4><c1a>: Abbrev Number: 0
 <3><c1b>: Abbrev Number: 0
 <2><c1c>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <c1d>   DW_AT_low_pc      : 0x8001c90
    <c21>   DW_AT_high_pc     : 0x30
 <3><c25>: Abbrev Number: 2 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0x7b9e3): pxItem
    <c2a>   DW_AT_decl_file   : 1
    <c2a>   DW_AT_decl_line   : 968
    <c2c>   DW_AT_decl_column : 15
    <c2d>   DW_AT_type        : <0x237>
    <c31>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><c34>: Abbrev Number: 2 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0x7ed52): xTCB
    <c39>   DW_AT_decl_file   : 1
    <c39>   DW_AT_decl_line   : 969
    <c3b>   DW_AT_decl_column : 13
    <c3c>   DW_AT_type        : <0xac3>
    <c40>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <3><c43>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <c44>   DW_AT_abstract_origin: <0x14b9>
    <c48>   DW_AT_low_pc      : 0x8001ca2
    <c4c>   DW_AT_high_pc     : 0x14
    <c50>   DW_AT_call_file   : 1
    <c50>   DW_AT_call_line   : 970
    <c52>   DW_AT_call_column : 3
 <4><c53>: Abbrev Number: 8 (DW_TAG_variable)
    <c54>   DW_AT_abstract_origin: <0x14c2>
    <c58>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <4><c5c>: Abbrev Number: 0
 <3><c5d>: Abbrev Number: 0
 <2><c5e>: Abbrev Number: 0
 <1><c5f>: Abbrev Number: 28 (DW_TAG_array_type)
    <c60>   DW_AT_type        : <0xac3>
    <c64>   DW_AT_sibling     : <0xc72>
 <2><c68>: Abbrev Number: 50 (DW_TAG_subrange_type)
    <c69>   DW_AT_type        : <0x3d>
    <c6d>   DW_AT_upper_bound : 3 byte block: 91 54 6 	(DW_OP_fbreg: -44; DW_OP_deref)
 <2><c71>: Abbrev Number: 0
 <1><c72>: Abbrev Number: 15 (DW_TAG_subprogram)
    <c73>   DW_AT_name        : (indirect string, offset: 0x338b7): prvMSTSporadicServerJob
    <c77>   DW_AT_decl_file   : 1
    <c77>   DW_AT_decl_line   : 784
    <c79>   DW_AT_decl_column : 13
    <c79>   DW_AT_prototyped  : 1
    <c79>   DW_AT_low_pc      : 0x80018d4
    <c7d>   DW_AT_high_pc     : 0x294
    <c81>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c83>   DW_AT_call_all_tail_calls: 1
    <c83>   DW_AT_sibling     : <0xe04>
 <2><c87>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c88>   DW_AT_name        : (indirect string, offset: 0x6bba): pvParameters
    <c8c>   DW_AT_decl_file   : 1
    <c8c>   DW_AT_decl_line   : 784
    <c8e>   DW_AT_decl_column : 43
    <c8f>   DW_AT_type        : <0xf6>
    <c93>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><c97>: Abbrev Number: 2 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x56782): xCurrentHandle
    <c9c>   DW_AT_decl_file   : 1
    <c9c>   DW_AT_decl_line   : 786
    <c9e>   DW_AT_decl_column : 15
    <c9f>   DW_AT_type        : <0x24d>
    <ca3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ca6>: Abbrev Number: 2 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x140ac): xCurrExtTCB
    <cab>   DW_AT_decl_file   : 1
    <cab>   DW_AT_decl_line   : 787
    <cad>   DW_AT_decl_column : 12
    <cae>   DW_AT_type        : <0xac3>
    <cb2>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><cb5>: Abbrev Number: 2 (DW_TAG_variable)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x80605): xReplenishmentTimer
    <cba>   DW_AT_decl_file   : 1
    <cba>   DW_AT_decl_line   : 792
    <cbc>   DW_AT_decl_column : 16
    <cbd>   DW_AT_type        : <0x367>
    <cc1>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cc4>: Abbrev Number: 2 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x6af26): xBudgetWatchdogTimer
    <cc9>   DW_AT_decl_file   : 1
    <cc9>   DW_AT_decl_line   : 798
    <ccb>   DW_AT_decl_column : 16
    <ccc>   DW_AT_type        : <0x367>
    <cd0>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cd3>: Abbrev Number: 2 (DW_TAG_variable)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x23216): xCurrentRunningSporadicTCB
    <cd8>   DW_AT_decl_file   : 1
    <cd8>   DW_AT_decl_line   : 803
    <cda>   DW_AT_decl_column : 12
    <cdb>   DW_AT_type        : <0xac3>
    <cdf>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ce2>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <ce3>   DW_AT_low_pc      : 0x8001950
    <ce7>   DW_AT_high_pc     : 0x1f6
    <ceb>   DW_AT_sibling     : <0xdea>
 <3><cef>: Abbrev Number: 2 (DW_TAG_variable)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x6ce56): ulNotifyVal
    <cf4>   DW_AT_decl_file   : 1
    <cf4>   DW_AT_decl_line   : 805
    <cf6>   DW_AT_decl_column : 12
    <cf7>   DW_AT_type        : <0xc4>
    <cfb>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><cff>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <d00>   DW_AT_low_pc      : 0x800198e
    <d04>   DW_AT_high_pc     : 0x1b6
 <4><d08>: Abbrev Number: 2 (DW_TAG_variable)
    <d09>   DW_AT_name        : (indirect string, offset: 0x73e9b): xItm
    <d0d>   DW_AT_decl_file   : 1
    <d0d>   DW_AT_decl_line   : 823
    <d0f>   DW_AT_decl_column : 16
    <d10>   DW_AT_type        : <0x237>
    <d14>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><d17>: Abbrev Number: 2 (DW_TAG_variable)
    <d18>   DW_AT_name        : (indirect string, offset: 0x7ed52): xTCB
    <d1c>   DW_AT_decl_file   : 1
    <d1c>   DW_AT_decl_line   : 824
    <d1e>   DW_AT_decl_column : 14
    <d1f>   DW_AT_type        : <0xac3>
    <d23>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <4><d26>: Abbrev Number: 2 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0x2d0c0): notificationGiver
    <d2b>   DW_AT_decl_file   : 1
    <d2b>   DW_AT_decl_line   : 852
    <d2d>   DW_AT_decl_column : 13
    <d2e>   DW_AT_type        : <0xc4>
    <d32>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <4><d36>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <d37>   DW_AT_low_pc      : 0x80019da
    <d3b>   DW_AT_high_pc     : 0x74
    <d3f>   DW_AT_sibling     : <0xd89>
 <5><d43>: Abbrev Number: 2 (DW_TAG_variable)
    <d44>   DW_AT_name        : (indirect string, offset: 0x79e81): xResult
    <d48>   DW_AT_decl_file   : 1
    <d48>   DW_AT_decl_line   : 845
    <d4a>   DW_AT_decl_column : 16
    <d4b>   DW_AT_type        : <0x109>
    <d4f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <5><d52>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <d53>   DW_AT_abstract_origin: <0x14b9>
    <d57>   DW_AT_low_pc      : 0x8001a18
    <d5b>   DW_AT_high_pc     : 0x14
    <d5f>   DW_AT_call_file   : 1
    <d5f>   DW_AT_call_line   : 847
    <d61>   DW_AT_call_column : 5
    <d62>   DW_AT_sibling     : <0xd6f>
 <6><d66>: Abbrev Number: 8 (DW_TAG_variable)
    <d67>   DW_AT_abstract_origin: <0x14c2>
    <d6b>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <6><d6e>: Abbrev Number: 0
 <5><d6f>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <d70>   DW_AT_abstract_origin: <0x14b9>
    <d74>   DW_AT_low_pc      : 0x8001a36
    <d78>   DW_AT_high_pc     : 0x14
    <d7c>   DW_AT_call_file   : 1
    <d7c>   DW_AT_call_line   : 848
    <d7e>   DW_AT_call_column : 5
 <6><d7f>: Abbrev Number: 8 (DW_TAG_variable)
    <d80>   DW_AT_abstract_origin: <0x14c2>
    <d84>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <6><d87>: Abbrev Number: 0
 <5><d88>: Abbrev Number: 0
 <4><d89>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <d8a>   DW_AT_low_pc      : 0x8001ab4
    <d8e>   DW_AT_high_pc     : 0x8a
 <5><d92>: Abbrev Number: 2 (DW_TAG_variable)
    <d93>   DW_AT_name        : (indirect string, offset: 0x1cd1e): xNewPeriod
    <d97>   DW_AT_decl_file   : 1
    <d97>   DW_AT_decl_line   : 880
    <d99>   DW_AT_decl_column : 18
    <d9a>   DW_AT_type        : <0x135>
    <d9e>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <5><da1>: Abbrev Number: 2 (DW_TAG_variable)
    <da2>   DW_AT_name        : (indirect string, offset: 0x79e81): xResult
    <da6>   DW_AT_decl_file   : 1
    <da6>   DW_AT_decl_line   : 884
    <da8>   DW_AT_decl_column : 18
    <da9>   DW_AT_type        : <0x109>
    <dad>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <5><db0>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <db1>   DW_AT_abstract_origin: <0x14b9>
    <db5>   DW_AT_low_pc      : 0x8001af4
    <db9>   DW_AT_high_pc     : 0x14
    <dbd>   DW_AT_call_file   : 1
    <dbd>   DW_AT_call_line   : 888
    <dbf>   DW_AT_call_column : 7
    <dc0>   DW_AT_sibling     : <0xdcd>
 <6><dc4>: Abbrev Number: 8 (DW_TAG_variable)
    <dc5>   DW_AT_abstract_origin: <0x14c2>
    <dc9>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <6><dcc>: Abbrev Number: 0
 <5><dcd>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <dce>   DW_AT_abstract_origin: <0x14b9>
    <dd2>   DW_AT_low_pc      : 0x8001b26
    <dd6>   DW_AT_high_pc     : 0x14
    <dda>   DW_AT_call_file   : 1
    <dda>   DW_AT_call_line   : 889
    <ddc>   DW_AT_call_column : 7
 <6><ddd>: Abbrev Number: 8 (DW_TAG_variable)
    <dde>   DW_AT_abstract_origin: <0x14c2>
    <de2>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <6><de6>: Abbrev Number: 0
 <5><de7>: Abbrev Number: 0
 <4><de8>: Abbrev Number: 0
 <3><de9>: Abbrev Number: 0
 <2><dea>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <deb>   DW_AT_abstract_origin: <0x14b9>
    <def>   DW_AT_low_pc      : 0x80018f2
    <df3>   DW_AT_high_pc     : 0x14
    <df7>   DW_AT_call_file   : 1
    <df7>   DW_AT_call_line   : 789
    <df9>   DW_AT_call_column : 2
 <3><dfa>: Abbrev Number: 8 (DW_TAG_variable)
    <dfb>   DW_AT_abstract_origin: <0x14c2>
    <dff>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><e02>: Abbrev Number: 0
 <2><e03>: Abbrev Number: 0
 <1><e04>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e05>   DW_AT_name        : (indirect string, offset: 0x23d6e): prvRemoveSSItemFromList
    <e09>   DW_AT_decl_file   : 1
    <e09>   DW_AT_decl_line   : 771
    <e0b>   DW_AT_decl_column : 13
    <e0b>   DW_AT_prototyped  : 1
    <e0b>   DW_AT_low_pc      : 0x800187c
    <e0f>   DW_AT_high_pc     : 0x58
    <e13>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e15>   DW_AT_call_all_tail_calls: 1
    <e15>   DW_AT_sibling     : <0xe42>
 <2><e19>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x422fb): forTCB
    <e1e>   DW_AT_decl_file   : 1
    <e1e>   DW_AT_decl_line   : 771
    <e20>   DW_AT_decl_column : 47
    <e21>   DW_AT_type        : <0xac3>
    <e25>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e28>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <e29>   DW_AT_abstract_origin: <0x14b9>
    <e2d>   DW_AT_low_pc      : 0x80018a6
    <e31>   DW_AT_high_pc     : 0x14
    <e35>   DW_AT_call_file   : 1
    <e35>   DW_AT_call_line   : 777
    <e37>   DW_AT_call_column : 3
 <3><e38>: Abbrev Number: 8 (DW_TAG_variable)
    <e39>   DW_AT_abstract_origin: <0x14c2>
    <e3d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><e40>: Abbrev Number: 0
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e43>   DW_AT_name        : (indirect string, offset: 0x55481): prvMSTGenericReplenishmentTimerCallback
    <e47>   DW_AT_decl_file   : 1
    <e47>   DW_AT_decl_line   : 760
    <e49>   DW_AT_decl_column : 13
    <e49>   DW_AT_prototyped  : 1
    <e49>   DW_AT_low_pc      : 0x8001838
    <e4d>   DW_AT_high_pc     : 0x44
    <e51>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e53>   DW_AT_call_all_tail_calls: 1
    <e53>   DW_AT_sibling     : <0xe76>
 <2><e57>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e58>   DW_AT_name        : (indirect string, offset: 0x98822): xTimer
    <e5c>   DW_AT_decl_file   : 1
    <e5c>   DW_AT_decl_line   : 760
    <e5e>   DW_AT_decl_column : 67
    <e5f>   DW_AT_type        : <0x367>
    <e63>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e66>: Abbrev Number: 2 (DW_TAG_variable)
    <e67>   DW_AT_name        : (indirect string, offset: 0x7f5af): param
    <e6b>   DW_AT_decl_file   : 1
    <e6b>   DW_AT_decl_line   : 765
    <e6d>   DW_AT_decl_column : 13
    <e6e>   DW_AT_type        : <0x109>
    <e72>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e75>: Abbrev Number: 0
 <1><e76>: Abbrev Number: 15 (DW_TAG_subprogram)
    <e77>   DW_AT_name        : (indirect string, offset: 0x9233): prvMSTBudgetWatchdogCallback
    <e7b>   DW_AT_decl_file   : 1
    <e7b>   DW_AT_decl_line   : 739
    <e7d>   DW_AT_decl_column : 13
    <e7d>   DW_AT_prototyped  : 1
    <e7d>   DW_AT_low_pc      : 0x80017dc
    <e81>   DW_AT_high_pc     : 0x5c
    <e85>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e87>   DW_AT_call_all_tail_calls: 1
    <e87>   DW_AT_sibling     : <0xeaa>
 <2><e8b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x98822): xTimer
    <e90>   DW_AT_decl_file   : 1
    <e90>   DW_AT_decl_line   : 739
    <e92>   DW_AT_decl_column : 56
    <e93>   DW_AT_type        : <0x367>
    <e97>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e9a>: Abbrev Number: 2 (DW_TAG_variable)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x7ed52): xTCB
    <e9f>   DW_AT_decl_file   : 1
    <e9f>   DW_AT_decl_line   : 744
    <ea1>   DW_AT_decl_column : 12
    <ea2>   DW_AT_type        : <0xac3>
    <ea6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ea9>: Abbrev Number: 0
 <1><eaa>: Abbrev Number: 34 (DW_TAG_subprogram)
    <eab>   DW_AT_name        : (indirect string, offset: 0x25c02): prvAsmissionControlSporadicServer
    <eaf>   DW_AT_decl_file   : 1
    <eaf>   DW_AT_decl_line   : 693
    <eb1>   DW_AT_decl_column : 19
    <eb2>   DW_AT_prototyped  : 1
    <eb2>   DW_AT_type        : <0x109>
    <eb6>   DW_AT_low_pc      : 0x8001768
    <eba>   DW_AT_high_pc     : 0x72
    <ebe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ec0>   DW_AT_call_all_calls: 1
    <ec0>   DW_AT_sibling     : <0xf10>
 <2><ec4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x422fb): forTCB
    <ec9>   DW_AT_decl_file   : 1
    <ec9>   DW_AT_decl_line   : 693
    <ecb>   DW_AT_decl_column : 63
    <ecc>   DW_AT_type        : <0xac3>
    <ed0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ed3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x851e9): withSSTCB
    <ed8>   DW_AT_decl_file   : 1
    <ed8>   DW_AT_decl_line   : 694
    <eda>   DW_AT_decl_column : 13
    <edb>   DW_AT_type        : <0xac3>
    <edf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><ee2>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x6f698): atArrivalTime
    <ee7>   DW_AT_decl_file   : 1
    <ee7>   DW_AT_decl_line   : 694
    <ee9>   DW_AT_decl_column : 35
    <eea>   DW_AT_type        : <0x135>
    <eee>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><ef1>: Abbrev Number: 2 (DW_TAG_variable)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x2eaf5): xSlack
    <ef6>   DW_AT_decl_file   : 1
    <ef6>   DW_AT_decl_line   : 695
    <ef8>   DW_AT_decl_column : 13
    <ef9>   DW_AT_type        : <0x109>
    <efd>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f00>: Abbrev Number: 2 (DW_TAG_variable)
    <f01>   DW_AT_name        : (indirect string, offset: 0x867cb): guaranteedExecTime
    <f05>   DW_AT_decl_file   : 1
    <f05>   DW_AT_decl_line   : 696
    <f07>   DW_AT_decl_column : 8
    <f08>   DW_AT_type        : <0x39e>
    <f0c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f0f>: Abbrev Number: 0
 <1><f10>: Abbrev Number: 15 (DW_TAG_subprogram)
    <f11>   DW_AT_name        : (indirect string, offset: 0x72dc6): prvComputeSporadicServerProprierties
    <f15>   DW_AT_decl_file   : 1
    <f15>   DW_AT_decl_line   : 610
    <f17>   DW_AT_decl_column : 13
    <f17>   DW_AT_prototyped  : 1
    <f17>   DW_AT_low_pc      : 0x8001558
    <f1b>   DW_AT_high_pc     : 0x210
    <f1f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f21>   DW_AT_call_all_tail_calls: 1
    <f21>   DW_AT_sibling     : <0x106e>
 <2><f25>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <f26>   DW_AT_name        : (indirect string, offset: 0x42426): tSS_Period
    <f2a>   DW_AT_decl_file   : 1
    <f2a>   DW_AT_decl_line   : 610
    <f2c>   DW_AT_decl_column : 62
    <f2d>   DW_AT_type        : <0x106e>
    <f31>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><f35>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <f36>   DW_AT_name        : (indirect string, offset: 0x3095b): tSS_WCET
    <f3a>   DW_AT_decl_file   : 1
    <f3a>   DW_AT_decl_line   : 611
    <f3c>   DW_AT_decl_column : 15
    <f3d>   DW_AT_type        : <0x106e>
    <f41>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><f45>: Abbrev Number: 19 (DW_TAG_variable)
    <f46>   DW_AT_name        : m
    <f48>   DW_AT_decl_file   : 1
    <f48>   DW_AT_decl_line   : 638
    <f4a>   DW_AT_decl_column : 8
    <f4b>   DW_AT_type        : <0x39e>
    <f4f>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><f52>: Abbrev Number: 19 (DW_TAG_variable)
    <f53>   DW_AT_name        : U
    <f55>   DW_AT_decl_file   : 1
    <f55>   DW_AT_decl_line   : 639
    <f57>   DW_AT_decl_column : 8
    <f58>   DW_AT_type        : <0x39e>
    <f5c>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><f5f>: Abbrev Number: 2 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0xa9b0): min_css
    <f64>   DW_AT_decl_file   : 1
    <f64>   DW_AT_decl_line   : 640
    <f66>   DW_AT_decl_column : 13
    <f67>   DW_AT_type        : <0x135>
    <f6b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f6e>: Abbrev Number: 2 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x30bdd): max_css
    <f73>   DW_AT_decl_file   : 1
    <f73>   DW_AT_decl_line   : 641
    <f75>   DW_AT_decl_column : 13
    <f76>   DW_AT_type        : <0x135>
    <f7a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f7d>: Abbrev Number: 2 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x177c9): sum_up
    <f82>   DW_AT_decl_file   : 1
    <f82>   DW_AT_decl_line   : 642
    <f84>   DW_AT_decl_column : 8
    <f85>   DW_AT_type        : <0x39e>
    <f89>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f8c>: Abbrev Number: 2 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x73e9b): xItm
    <f91>   DW_AT_decl_file   : 1
    <f91>   DW_AT_decl_line   : 643
    <f93>   DW_AT_decl_column : 14
    <f94>   DW_AT_type        : <0x237>
    <f98>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><f9b>: Abbrev Number: 19 (DW_TAG_variable)
    <f9c>   DW_AT_name        : Css
    <fa0>   DW_AT_decl_file   : 1
    <fa0>   DW_AT_decl_line   : 657
    <fa2>   DW_AT_decl_column : 8
    <fa3>   DW_AT_type        : <0x39e>
    <fa7>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><faa>: Abbrev Number: 19 (DW_TAG_variable)
    <fab>   DW_AT_name        : Uss
    <faf>   DW_AT_decl_file   : 1
    <faf>   DW_AT_decl_line   : 658
    <fb1>   DW_AT_decl_column : 8
    <fb2>   DW_AT_type        : <0x39e>
    <fb6>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><fb9>: Abbrev Number: 19 (DW_TAG_variable)
    <fba>   DW_AT_name        : Tss
    <fbe>   DW_AT_decl_file   : 1
    <fbe>   DW_AT_decl_line   : 659
    <fc0>   DW_AT_decl_column : 13
    <fc1>   DW_AT_type        : <0x135>
    <fc5>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><fc8>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <fc9>   DW_AT_low_pc      : 0x80015e8
    <fcd>   DW_AT_high_pc     : 0xa2
    <fd1>   DW_AT_sibling     : <0x1053>
 <3><fd5>: Abbrev Number: 19 (DW_TAG_variable)
    <fd6>   DW_AT_name        : i
    <fd8>   DW_AT_decl_file   : 1
    <fd8>   DW_AT_decl_line   : 644
    <fda>   DW_AT_decl_column : 11
    <fdb>   DW_AT_type        : <0x2a>
    <fdf>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><fe2>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <fe3>   DW_AT_low_pc      : 0x80015ee
    <fe7>   DW_AT_high_pc     : 0x8c
 <4><feb>: Abbrev Number: 2 (DW_TAG_variable)
    <fec>   DW_AT_name        : (indirect string, offset: 0x7ed52): xTCB
    <ff0>   DW_AT_decl_file   : 1
    <ff0>   DW_AT_decl_line   : 645
    <ff2>   DW_AT_decl_column : 13
    <ff3>   DW_AT_type        : <0xac3>
    <ff7>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><ffa>: Abbrev Number: 2 (DW_TAG_variable)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x6b967): t_wcet
    <fff>   DW_AT_decl_file   : 1
    <fff>   DW_AT_decl_line   : 647
    <1001>   DW_AT_decl_column : 14
    <1002>   DW_AT_type        : <0x135>
    <1006>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><1009>: Abbrev Number: 2 (DW_TAG_variable)
    <100a>   DW_AT_name        : (indirect string, offset: 0x44bac): t_per
    <100e>   DW_AT_decl_file   : 1
    <100e>   DW_AT_decl_line   : 648
    <1010>   DW_AT_decl_column : 14
    <1011>   DW_AT_type        : <0x135>
    <1015>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <4><1019>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <101a>   DW_AT_abstract_origin: <0x14b9>
    <101e>   DW_AT_low_pc      : 0x80015fa
    <1022>   DW_AT_high_pc     : 0x14
    <1026>   DW_AT_call_file   : 1
    <1026>   DW_AT_call_line   : 646
    <1028>   DW_AT_call_column : 3
    <1029>   DW_AT_sibling     : <0x1037>
 <5><102d>: Abbrev Number: 8 (DW_TAG_variable)
    <102e>   DW_AT_abstract_origin: <0x14c2>
    <1032>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <5><1036>: Abbrev Number: 0
 <4><1037>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <1038>   DW_AT_abstract_origin: <0x14b9>
    <103c>   DW_AT_low_pc      : 0x8001638
    <1040>   DW_AT_high_pc     : 0x14
    <1044>   DW_AT_call_file   : 1
    <1044>   DW_AT_call_line   : 653
    <1046>   DW_AT_call_column : 3
 <5><1047>: Abbrev Number: 8 (DW_TAG_variable)
    <1048>   DW_AT_abstract_origin: <0x14c2>
    <104c>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <5><1050>: Abbrev Number: 0
 <4><1051>: Abbrev Number: 0
 <3><1052>: Abbrev Number: 0
 <2><1053>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <1054>   DW_AT_abstract_origin: <0x14b9>
    <1058>   DW_AT_low_pc      : 0x80016cc
    <105c>   DW_AT_high_pc     : 0x14
    <1060>   DW_AT_call_file   : 1
    <1060>   DW_AT_call_line   : 661
    <1062>   DW_AT_call_column : 3
 <3><1063>: Abbrev Number: 8 (DW_TAG_variable)
    <1064>   DW_AT_abstract_origin: <0x14c2>
    <1068>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><106c>: Abbrev Number: 0
 <2><106d>: Abbrev Number: 0
 <1><106e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <106f>   DW_AT_byte_size   : 4
    <106f>   DW_AT_type        : <0x135>
 <1><1073>: Abbrev Number: 34 (DW_TAG_subprogram)
    <1074>   DW_AT_name        : (indirect string, offset: 0x2db5e): prv_compare
    <1078>   DW_AT_decl_file   : 1
    <1078>   DW_AT_decl_line   : 589
    <107a>   DW_AT_decl_column : 12
    <107b>   DW_AT_prototyped  : 1
    <107b>   DW_AT_type        : <0x2a>
    <107f>   DW_AT_low_pc      : 0x800150e
    <1083>   DW_AT_high_pc     : 0x46
    <1087>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1089>   DW_AT_call_all_calls: 1
    <1089>   DW_AT_sibling     : <0x10ca>
 <2><108d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <108e>   DW_AT_name        : (indirect string, offset: 0x1e362): arg1
    <1092>   DW_AT_decl_file   : 1
    <1092>   DW_AT_decl_line   : 589
    <1094>   DW_AT_decl_column : 36
    <1095>   DW_AT_type        : <0x54d>
    <1099>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><109c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <109d>   DW_AT_name        : (indirect string, offset: 0x1e367): arg2
    <10a1>   DW_AT_decl_file   : 1
    <10a1>   DW_AT_decl_line   : 589
    <10a3>   DW_AT_decl_column : 54
    <10a4>   DW_AT_type        : <0x54d>
    <10a8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><10ab>: Abbrev Number: 2 (DW_TAG_variable)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x8becb): itm1
    <10b0>   DW_AT_decl_file   : 1
    <10b0>   DW_AT_decl_line   : 590
    <10b2>   DW_AT_decl_column : 12
    <10b3>   DW_AT_type        : <0xac3>
    <10b7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><10ba>: Abbrev Number: 2 (DW_TAG_variable)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x8bed0): itm2
    <10bf>   DW_AT_decl_file   : 1
    <10bf>   DW_AT_decl_line   : 591
    <10c1>   DW_AT_decl_column : 12
    <10c2>   DW_AT_type        : <0xac3>
    <10c6>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><10c9>: Abbrev Number: 0
 <1><10ca>: Abbrev Number: 35 (DW_TAG_subprogram)
    <10cb>   DW_AT_external    : 1
    <10cb>   DW_AT_name        : (indirect string, offset: 0x84402): vMSTSporadicTaskRun
    <10cf>   DW_AT_decl_file   : 1
    <10cf>   DW_AT_decl_line   : 573
    <10d1>   DW_AT_decl_column : 12
    <10d1>   DW_AT_prototyped  : 1
    <10d1>   DW_AT_type        : <0x109>
    <10d5>   DW_AT_low_pc      : 0x80014d8
    <10d9>   DW_AT_high_pc     : 0x36
    <10dd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10df>   DW_AT_call_all_tail_calls: 1
    <10df>   DW_AT_sibling     : <0x1102>
 <2><10e3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x775c0): pxTaskToRunHandle
    <10e8>   DW_AT_decl_file   : 1
    <10e8>   DW_AT_decl_line   : 573
    <10ea>   DW_AT_decl_column : 46
    <10eb>   DW_AT_type        : <0x72f>
    <10ef>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><10f2>: Abbrev Number: 2 (DW_TAG_variable)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x140ac): xCurrExtTCB
    <10f7>   DW_AT_decl_file   : 1
    <10f7>   DW_AT_decl_line   : 577
    <10f9>   DW_AT_decl_column : 12
    <10fa>   DW_AT_type        : <0xac3>
    <10fe>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1101>: Abbrev Number: 0
 <1><1102>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1103>   DW_AT_name        : (indirect string, offset: 0x85c2): prvMSTSporadicGenericJob
    <1107>   DW_AT_decl_file   : 1
    <1107>   DW_AT_decl_line   : 479
    <1109>   DW_AT_decl_column : 13
    <1109>   DW_AT_prototyped  : 1
    <1109>   DW_AT_low_pc      : 0x8001430
    <110d>   DW_AT_high_pc     : 0xa8
    <1111>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1113>   DW_AT_call_all_tail_calls: 1
    <1113>   DW_AT_sibling     : <0x118a>
 <2><1117>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1118>   DW_AT_name        : (indirect string, offset: 0x6bba): pvParameters
    <111c>   DW_AT_decl_file   : 1
    <111c>   DW_AT_decl_line   : 479
    <111e>   DW_AT_decl_column : 44
    <111f>   DW_AT_type        : <0xf6>
    <1123>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1126>: Abbrev Number: 2 (DW_TAG_variable)
    <1127>   DW_AT_name        : (indirect string, offset: 0x56782): xCurrentHandle
    <112b>   DW_AT_decl_file   : 1
    <112b>   DW_AT_decl_line   : 481
    <112d>   DW_AT_decl_column : 15
    <112e>   DW_AT_type        : <0x24d>
    <1132>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1135>: Abbrev Number: 2 (DW_TAG_variable)
    <1136>   DW_AT_name        : (indirect string, offset: 0x140ac): xCurrExtTCB
