Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xf26 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 34 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8c03b): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x72f3): ../Core/Src/MSTScheduler.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x5ddde): /Users/enricoalberti/Desktop/FILES/Embedded/FreeRTOS/MST4FreeRTOS/MST-FreeRTOS-Example/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 35 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5e11): size_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1c1b5): unsigned char
 <1><60>: Abbrev Number: 9 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x697c4): short int
 <1><67>: Abbrev Number: 4 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x74049): __uint16_t
    <6c>   DW_AT_decl_file   : 4
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 9 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x88593): short unsigned int
 <1><7a>: Abbrev Number: 4 (DW_TAG_typedef)
    <7b>   DW_AT_name        : (indirect string, offset: 0x562cb): __int32_t
    <7f>   DW_AT_decl_file   : 4
    <80>   DW_AT_decl_line   : 77
    <81>   DW_AT_decl_column : 24
    <82>   DW_AT_type        : <0x86>
 <1><86>: Abbrev Number: 9 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0xb87a): long int
 <1><8d>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x59469): __uint32_t
    <92>   DW_AT_decl_file   : 4
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 9 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x2a9f4): long unsigned int
 <1><a0>: Abbrev Number: 9 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x1cc06): long long unsigned int
 <1><a7>: Abbrev Number: 4 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x66eff): uint16_t
    <ac>   DW_AT_decl_file   : 5
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 8 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 4 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x562cd): int32_t
    <bd>   DW_AT_decl_file   : 5
    <be>   DW_AT_decl_line   : 44
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x7a>
 <1><c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x66775): uint32_t
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 48
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x8d>
 <1><d0>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <d1>   DW_AT_type        : <0xc4>
 <1><d5>: Abbrev Number: 8 (DW_TAG_const_type)
    <d6>   DW_AT_type        : <0xd0>
 <1><da>: Abbrev Number: 4 (DW_TAG_typedef)
    <db>   DW_AT_name        : (indirect string, offset: 0x4226c): TaskFunction_t
    <df>   DW_AT_decl_file   : 6
    <e0>   DW_AT_decl_line   : 35
    <e1>   DW_AT_decl_column : 16
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e7>   DW_AT_byte_size   : 4
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <ec>   DW_AT_prototyped  : 1
    <ec>   DW_AT_sibling     : <0xf6>
 <2><f0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f1>   DW_AT_type        : <0xf6>
 <2><f5>: Abbrev Number: 0
 <1><f6>: Abbrev Number: 36 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 8 (DW_TAG_const_type)
    <f9>   DW_AT_type        : <0xf6>
 <1><fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x83263): BaseType_t
    <102>   DW_AT_decl_file   : 2
    <103>   DW_AT_decl_line   : 56
    <104>   DW_AT_decl_column : 14
    <105>   DW_AT_type        : <0x86>
 <1><109>: Abbrev Number: 8 (DW_TAG_const_type)
    <10a>   DW_AT_type        : <0xfd>
 <1><10e>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f>   DW_AT_name        : (indirect string, offset: 0x83262): UBaseType_t
    <113>   DW_AT_decl_file   : 2
    <114>   DW_AT_decl_line   : 57
    <115>   DW_AT_decl_column : 23
    <116>   DW_AT_type        : <0x99>
 <1><11a>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <11b>   DW_AT_type        : <0x10e>
 <1><11f>: Abbrev Number: 8 (DW_TAG_const_type)
    <120>   DW_AT_type        : <0x10e>
 <1><124>: Abbrev Number: 4 (DW_TAG_typedef)
    <125>   DW_AT_name        : (indirect string, offset: 0x4d593): TickType_t
    <129>   DW_AT_decl_file   : 2
    <12a>   DW_AT_decl_line   : 63
    <12b>   DW_AT_decl_column : 19
    <12c>   DW_AT_type        : <0xc4>
 <1><130>: Abbrev Number: 8 (DW_TAG_const_type)
    <131>   DW_AT_type        : <0x124>
 <1><135>: Abbrev Number: 9 (DW_TAG_base_type)
    <136>   DW_AT_byte_size   : 1
    <137>   DW_AT_encoding    : 8	(unsigned char)
    <138>   DW_AT_name        : (indirect string, offset: 0x2cc1e): char
 <1><13c>: Abbrev Number: 8 (DW_TAG_const_type)
    <13d>   DW_AT_type        : <0x135>
 <1><141>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <142>   DW_AT_byte_size   : 4
    <142>   DW_AT_type        : <0x13c>
 <1><146>: Abbrev Number: 8 (DW_TAG_const_type)
    <147>   DW_AT_type        : <0x141>
 <1><14b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <14c>   DW_AT_name        : (indirect string, offset: 0x3e43b): xLIST_ITEM
    <150>   DW_AT_byte_size   : 20
    <151>   DW_AT_decl_file   : 7
    <152>   DW_AT_decl_line   : 140
    <153>   DW_AT_decl_column : 8
    <154>   DW_AT_sibling     : <0x19a>
 <2><158>: Abbrev Number: 2 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x6b3e7): xItemValue
    <15d>   DW_AT_decl_file   : 7
    <15e>   DW_AT_decl_line   : 143
    <15f>   DW_AT_decl_column : 33
    <160>   DW_AT_type        : <0x124>
    <164>   DW_AT_data_member_location: 0
 <2><165>: Abbrev Number: 2 (DW_TAG_member)
    <166>   DW_AT_name        : (indirect string, offset: 0x6cbfd): pxNext
    <16a>   DW_AT_decl_file   : 7
    <16b>   DW_AT_decl_line   : 144
    <16c>   DW_AT_decl_column : 42
    <16d>   DW_AT_type        : <0x19a>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 2 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0xc0f5): pxPrevious
    <177>   DW_AT_decl_file   : 7
    <178>   DW_AT_decl_line   : 145
    <179>   DW_AT_decl_column : 42
    <17a>   DW_AT_type        : <0x19a>
    <17e>   DW_AT_data_member_location: 8
 <2><17f>: Abbrev Number: 2 (DW_TAG_member)
    <180>   DW_AT_name        : (indirect string, offset: 0x51de1): pvOwner
    <184>   DW_AT_decl_file   : 7
    <185>   DW_AT_decl_line   : 146
    <186>   DW_AT_decl_column : 9
    <187>   DW_AT_type        : <0xf6>
    <18b>   DW_AT_data_member_location: 12
 <2><18c>: Abbrev Number: 2 (DW_TAG_member)
    <18d>   DW_AT_name        : (indirect string, offset: 0x65c3c): pvContainer
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 147
    <193>   DW_AT_decl_column : 37
    <194>   DW_AT_type        : <0x1d4>
    <198>   DW_AT_data_member_location: 16
 <2><199>: Abbrev Number: 0
 <1><19a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <19b>   DW_AT_byte_size   : 4
    <19b>   DW_AT_type        : <0x14b>
 <1><19f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x7f935): xLIST
    <1a4>   DW_AT_byte_size   : 20
    <1a5>   DW_AT_decl_file   : 7
    <1a6>   DW_AT_decl_line   : 164
    <1a7>   DW_AT_decl_column : 16
    <1a8>   DW_AT_sibling     : <0x1d4>
 <2><1ac>: Abbrev Number: 2 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x69f24): uxNumberOfItems
    <1b1>   DW_AT_decl_file   : 7
    <1b2>   DW_AT_decl_line   : 167
    <1b3>   DW_AT_decl_column : 23
    <1b4>   DW_AT_type        : <0x11a>
    <1b8>   DW_AT_data_member_location: 0
 <2><1b9>: Abbrev Number: 2 (DW_TAG_member)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x4bcd9): pxIndex
    <1be>   DW_AT_decl_file   : 7
    <1bf>   DW_AT_decl_line   : 168
    <1c0>   DW_AT_decl_column : 35
    <1c1>   DW_AT_type        : <0x226>
    <1c5>   DW_AT_data_member_location: 4
 <2><1c6>: Abbrev Number: 2 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x8afc): xListEnd
    <1cb>   DW_AT_decl_file   : 7
    <1cc>   DW_AT_decl_line   : 169
    <1cd>   DW_AT_decl_column : 17
    <1ce>   DW_AT_type        : <0x21a>
    <1d2>   DW_AT_data_member_location: 8
 <2><1d3>: Abbrev Number: 0
 <1><1d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1d5>   DW_AT_byte_size   : 4
    <1d5>   DW_AT_type        : <0x19f>
 <1><1d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <1da>   DW_AT_name        : (indirect string, offset: 0x72d9c): ListItem_t
    <1de>   DW_AT_decl_file   : 7
    <1df>   DW_AT_decl_line   : 150
    <1e0>   DW_AT_decl_column : 27
    <1e1>   DW_AT_type        : <0x14b>
 <1><1e5>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x5989c): xMINI_LIST_ITEM
    <1ea>   DW_AT_byte_size   : 12
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 152
    <1ed>   DW_AT_decl_column : 8
    <1ee>   DW_AT_sibling     : <0x21a>
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x6b3e7): xItemValue
    <1f7>   DW_AT_decl_file   : 7
    <1f8>   DW_AT_decl_line   : 155
    <1f9>   DW_AT_decl_column : 33
    <1fa>   DW_AT_type        : <0x124>
    <1fe>   DW_AT_data_member_location: 0
 <2><1ff>: Abbrev Number: 2 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x6cbfd): pxNext
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 156
    <206>   DW_AT_decl_column : 42
    <207>   DW_AT_type        : <0x19a>
    <20b>   DW_AT_data_member_location: 4
 <2><20c>: Abbrev Number: 2 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0xc0f5): pxPrevious
    <211>   DW_AT_decl_file   : 7
    <212>   DW_AT_decl_line   : 157
    <213>   DW_AT_decl_column : 42
    <214>   DW_AT_type        : <0x19a>
    <218>   DW_AT_data_member_location: 8
 <2><219>: Abbrev Number: 0
 <1><21a>: Abbrev Number: 4 (DW_TAG_typedef)
    <21b>   DW_AT_name        : (indirect string, offset: 0x95c15): MiniListItem_t
    <21f>   DW_AT_decl_file   : 7
    <220>   DW_AT_decl_line   : 159
    <221>   DW_AT_decl_column : 32
    <222>   DW_AT_type        : <0x1e5>
 <1><226>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <227>   DW_AT_byte_size   : 4
    <227>   DW_AT_type        : <0x1d9>
 <1><22b>: Abbrev Number: 8 (DW_TAG_const_type)
    <22c>   DW_AT_type        : <0x226>
 <1><230>: Abbrev Number: 4 (DW_TAG_typedef)
    <231>   DW_AT_name        : (indirect string, offset: 0x3b93c): List_t
    <235>   DW_AT_decl_file   : 7
    <236>   DW_AT_decl_line   : 171
    <237>   DW_AT_decl_column : 3
    <238>   DW_AT_type        : <0x19f>
 <1><23c>: Abbrev Number: 4 (DW_TAG_typedef)
    <23d>   DW_AT_name        : (indirect string, offset: 0x7b998): TaskHandle_t
    <241>   DW_AT_decl_file   : 8
    <242>   DW_AT_decl_line   : 70
    <243>   DW_AT_decl_column : 37
    <244>   DW_AT_type        : <0x248>
 <1><248>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <249>   DW_AT_byte_size   : 4
    <249>   DW_AT_type        : <0x24d>
 <1><24d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <24e>   DW_AT_name        : (indirect string, offset: 0x78c69): tskTaskControlBlock
    <252>   DW_AT_declaration : 1
 <1><252>: Abbrev Number: 37 (DW_TAG_enumeration_type)
    <253>   DW_AT_encoding    : 7	(unsigned)
    <254>   DW_AT_byte_size   : 1
    <255>   DW_AT_type        : <0x59>
    <259>   DW_AT_decl_file   : 8
    <25a>   DW_AT_decl_line   : 91
    <25b>   DW_AT_decl_column : 1
    <25c>   DW_AT_sibling     : <0x27f>
 <2><260>: Abbrev Number: 14 (DW_TAG_enumerator)
    <261>   DW_AT_name        : (indirect string, offset: 0x394a3): eNoAction
    <265>   DW_AT_const_value : 0
 <2><266>: Abbrev Number: 14 (DW_TAG_enumerator)
    <267>   DW_AT_name        : (indirect string, offset: 0x612d8): eSetBits
    <26b>   DW_AT_const_value : 1
 <2><26c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <26d>   DW_AT_name        : (indirect string, offset: 0x9792c): eIncrement
    <271>   DW_AT_const_value : 2
 <2><272>: Abbrev Number: 14 (DW_TAG_enumerator)
    <273>   DW_AT_name        : (indirect string, offset: 0x63dfc): eSetValueWithOverwrite
    <277>   DW_AT_const_value : 3
 <2><278>: Abbrev Number: 14 (DW_TAG_enumerator)
    <279>   DW_AT_name        : (indirect string, offset: 0x27295): eSetValueWithoutOverwrite
    <27d>   DW_AT_const_value : 4
 <2><27e>: Abbrev Number: 0
 <1><27f>: Abbrev Number: 4 (DW_TAG_typedef)
    <280>   DW_AT_name        : (indirect string, offset: 0x4d0b4): eNotifyAction
    <284>   DW_AT_decl_file   : 8
    <285>   DW_AT_decl_line   : 97
    <286>   DW_AT_decl_column : 3
    <287>   DW_AT_type        : <0x252>
 <1><28b>: Abbrev Number: 4 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x352f): TimerHandle_t
    <290>   DW_AT_decl_file   : 9
    <291>   DW_AT_decl_line   : 77
    <292>   DW_AT_decl_column : 34
    <293>   DW_AT_type        : <0x29c>
 <1><297>: Abbrev Number: 8 (DW_TAG_const_type)
    <298>   DW_AT_type        : <0x28b>
 <1><29c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <29d>   DW_AT_byte_size   : 4
    <29d>   DW_AT_type        : <0x2a1>
 <1><2a1>: Abbrev Number: 25 (DW_TAG_structure_type)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x16cad): tmrTimerControl
    <2a6>   DW_AT_declaration : 1
 <1><2a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x49b0c): TimerCallbackFunction_t
    <2ab>   DW_AT_decl_file   : 9
    <2ac>   DW_AT_decl_line   : 82
    <2ad>   DW_AT_decl_column : 16
    <2ae>   DW_AT_type        : <0x2b2>
 <1><2b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2b3>   DW_AT_byte_size   : 4
    <2b3>   DW_AT_type        : <0x2b7>
 <1><2b7>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <2b8>   DW_AT_prototyped  : 1
    <2b8>   DW_AT_sibling     : <0x2c2>
 <2><2bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <2bd>   DW_AT_type        : <0x28b>
 <2><2c1>: Abbrev Number: 0
 <1><2c2>: Abbrev Number: 26 (DW_TAG_array_type)
    <2c3>   DW_AT_type        : <0xc4>
    <2c7>   DW_AT_sibling     : <0x2d2>
 <2><2cb>: Abbrev Number: 38 (DW_TAG_subrange_type)
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_upper_bound : 0
 <2><2d1>: Abbrev Number: 0
 <1><2d2>: Abbrev Number: 27 (DW_TAG_structure_type)
    <2d3>   DW_AT_byte_size   : 92
    <2d4>   DW_AT_decl_file   : 10
    <2d4>   DW_AT_decl_line   : 904
    <2d6>   DW_AT_decl_column : 9
    <2d6>   DW_AT_sibling     : <0x3ef>
 <2><2da>: Abbrev Number: 3 (DW_TAG_member)
    <2db>   DW_AT_name        : (indirect string, offset: 0x4cea2): CTRL
    <2df>   DW_AT_decl_file   : 10
    <2df>   DW_AT_decl_line   : 906
    <2e1>   DW_AT_decl_column : 18
    <2e1>   DW_AT_type        : <0xd0>
    <2e5>   DW_AT_data_member_location: 0
 <2><2e6>: Abbrev Number: 3 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x2a2cb): CYCCNT
    <2eb>   DW_AT_decl_file   : 10
    <2eb>   DW_AT_decl_line   : 907
    <2ed>   DW_AT_decl_column : 18
    <2ed>   DW_AT_type        : <0xd0>
    <2f1>   DW_AT_data_member_location: 4
 <2><2f2>: Abbrev Number: 3 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x49d07): CPICNT
    <2f7>   DW_AT_decl_file   : 10
    <2f7>   DW_AT_decl_line   : 908
    <2f9>   DW_AT_decl_column : 18
    <2f9>   DW_AT_type        : <0xd0>
    <2fd>   DW_AT_data_member_location: 8
 <2><2fe>: Abbrev Number: 3 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x788cd): EXCCNT
    <303>   DW_AT_decl_file   : 10
    <303>   DW_AT_decl_line   : 909
    <305>   DW_AT_decl_column : 18
    <305>   DW_AT_type        : <0xd0>
    <309>   DW_AT_data_member_location: 12
 <2><30a>: Abbrev Number: 3 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x2f024): SLEEPCNT
    <30f>   DW_AT_decl_file   : 10
    <30f>   DW_AT_decl_line   : 910
    <311>   DW_AT_decl_column : 18
    <311>   DW_AT_type        : <0xd0>
    <315>   DW_AT_data_member_location: 16
 <2><316>: Abbrev Number: 3 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0xc2d3): LSUCNT
    <31b>   DW_AT_decl_file   : 10
    <31b>   DW_AT_decl_line   : 911
    <31d>   DW_AT_decl_column : 18
    <31d>   DW_AT_type        : <0xd0>
    <321>   DW_AT_data_member_location: 20
 <2><322>: Abbrev Number: 3 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x5a54a): FOLDCNT
    <327>   DW_AT_decl_file   : 10
    <327>   DW_AT_decl_line   : 912
    <329>   DW_AT_decl_column : 18
    <329>   DW_AT_type        : <0xd0>
    <32d>   DW_AT_data_member_location: 24
 <2><32e>: Abbrev Number: 3 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x55747): PCSR
    <333>   DW_AT_decl_file   : 10
    <333>   DW_AT_decl_line   : 913
    <335>   DW_AT_decl_column : 18
    <335>   DW_AT_type        : <0xd5>
    <339>   DW_AT_data_member_location: 28
 <2><33a>: Abbrev Number: 3 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x8119): COMP0
    <33f>   DW_AT_decl_file   : 10
    <33f>   DW_AT_decl_line   : 914
    <341>   DW_AT_decl_column : 18
    <341>   DW_AT_type        : <0xd0>
    <345>   DW_AT_data_member_location: 32
 <2><346>: Abbrev Number: 3 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x45e25): MASK0
    <34b>   DW_AT_decl_file   : 10
    <34b>   DW_AT_decl_line   : 915
    <34d>   DW_AT_decl_column : 18
    <34d>   DW_AT_type        : <0xd0>
    <351>   DW_AT_data_member_location: 36
 <2><352>: Abbrev Number: 3 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x1d74): FUNCTION0
    <357>   DW_AT_decl_file   : 10
    <357>   DW_AT_decl_line   : 916
    <359>   DW_AT_decl_column : 18
    <359>   DW_AT_type        : <0xd0>
    <35d>   DW_AT_data_member_location: 40
 <2><35e>: Abbrev Number: 3 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x863d4): RESERVED0
    <363>   DW_AT_decl_file   : 10
    <363>   DW_AT_decl_line   : 917
    <365>   DW_AT_decl_column : 18
    <365>   DW_AT_type        : <0x2c2>
    <369>   DW_AT_data_member_location: 44
 <2><36a>: Abbrev Number: 3 (DW_TAG_member)
    <36b>   DW_AT_name        : (indirect string, offset: 0x48c9b): COMP1
    <36f>   DW_AT_decl_file   : 10
    <36f>   DW_AT_decl_line   : 918
    <371>   DW_AT_decl_column : 18
    <371>   DW_AT_type        : <0xd0>
    <375>   DW_AT_data_member_location: 48
 <2><376>: Abbrev Number: 3 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x45e2b): MASK1
    <37b>   DW_AT_decl_file   : 10
    <37b>   DW_AT_decl_line   : 919
    <37d>   DW_AT_decl_column : 18
    <37d>   DW_AT_type        : <0xd0>
    <381>   DW_AT_data_member_location: 52
 <2><382>: Abbrev Number: 3 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x1d7e): FUNCTION1
    <387>   DW_AT_decl_file   : 10
    <387>   DW_AT_decl_line   : 920
    <389>   DW_AT_decl_column : 18
    <389>   DW_AT_type        : <0xd0>
    <38d>   DW_AT_data_member_location: 56
 <2><38e>: Abbrev Number: 3 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x863de): RESERVED1
    <393>   DW_AT_decl_file   : 10
    <393>   DW_AT_decl_line   : 921
    <395>   DW_AT_decl_column : 18
    <395>   DW_AT_type        : <0x2c2>
    <399>   DW_AT_data_member_location: 60
 <2><39a>: Abbrev Number: 3 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x1107f): COMP2
    <39f>   DW_AT_decl_file   : 10
    <39f>   DW_AT_decl_line   : 922
    <3a1>   DW_AT_decl_column : 18
    <3a1>   DW_AT_type        : <0xd0>
    <3a5>   DW_AT_data_member_location: 64
 <2><3a6>: Abbrev Number: 3 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x58282): MASK2
    <3ab>   DW_AT_decl_file   : 10
    <3ab>   DW_AT_decl_line   : 923
    <3ad>   DW_AT_decl_column : 18
    <3ad>   DW_AT_type        : <0xd0>
    <3b1>   DW_AT_data_member_location: 68
 <2><3b2>: Abbrev Number: 3 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x1d88): FUNCTION2
    <3b7>   DW_AT_decl_file   : 10
    <3b7>   DW_AT_decl_line   : 924
    <3b9>   DW_AT_decl_column : 18
    <3b9>   DW_AT_type        : <0xd0>
    <3bd>   DW_AT_data_member_location: 72
 <2><3be>: Abbrev Number: 3 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x863e8): RESERVED2
    <3c3>   DW_AT_decl_file   : 10
    <3c3>   DW_AT_decl_line   : 925
    <3c5>   DW_AT_decl_column : 18
    <3c5>   DW_AT_type        : <0x2c2>
    <3c9>   DW_AT_data_member_location: 76
 <2><3ca>: Abbrev Number: 3 (DW_TAG_member)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x609d6): COMP3
    <3cf>   DW_AT_decl_file   : 10
    <3cf>   DW_AT_decl_line   : 926
    <3d1>   DW_AT_decl_column : 18
    <3d1>   DW_AT_type        : <0xd0>
    <3d5>   DW_AT_data_member_location: 80
 <2><3d6>: Abbrev Number: 3 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x45e84): MASK3
    <3db>   DW_AT_decl_file   : 10
    <3db>   DW_AT_decl_line   : 927
    <3dd>   DW_AT_decl_column : 18
    <3dd>   DW_AT_type        : <0xd0>
    <3e1>   DW_AT_data_member_location: 84
 <2><3e2>: Abbrev Number: 3 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x1d92): FUNCTION3
    <3e7>   DW_AT_decl_file   : 10
    <3e7>   DW_AT_decl_line   : 928
    <3e9>   DW_AT_decl_column : 18
    <3e9>   DW_AT_type        : <0xd0>
    <3ed>   DW_AT_data_member_location: 88
 <2><3ee>: Abbrev Number: 0
 <1><3ef>: Abbrev Number: 28 (DW_TAG_typedef)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x251e0): DWT_Type
    <3f4>   DW_AT_decl_file   : 10
    <3f4>   DW_AT_decl_line   : 929
    <3f6>   DW_AT_decl_column : 3
    <3f6>   DW_AT_type        : <0x2d2>
 <1><3fa>: Abbrev Number: 27 (DW_TAG_structure_type)
    <3fb>   DW_AT_byte_size   : 16
    <3fc>   DW_AT_decl_file   : 10
    <3fc>   DW_AT_decl_line   : 1421
    <3fe>   DW_AT_decl_column : 9
    <3fe>   DW_AT_sibling     : <0x433>
 <2><402>: Abbrev Number: 3 (DW_TAG_member)
    <403>   DW_AT_name        : (indirect string, offset: 0x67120): DHCSR
    <407>   DW_AT_decl_file   : 10
    <407>   DW_AT_decl_line   : 1423
    <409>   DW_AT_decl_column : 18
    <409>   DW_AT_type        : <0xd0>
    <40d>   DW_AT_data_member_location: 0
 <2><40e>: Abbrev Number: 3 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0x7b4a3): DCRSR
    <413>   DW_AT_decl_file   : 10
    <413>   DW_AT_decl_line   : 1424
    <415>   DW_AT_decl_column : 18
    <415>   DW_AT_type        : <0xd0>
    <419>   DW_AT_data_member_location: 4
 <2><41a>: Abbrev Number: 3 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x76d1f): DCRDR
    <41f>   DW_AT_decl_file   : 10
    <41f>   DW_AT_decl_line   : 1425
    <421>   DW_AT_decl_column : 18
    <421>   DW_AT_type        : <0xd0>
    <425>   DW_AT_data_member_location: 8
 <2><426>: Abbrev Number: 3 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0x4833e): DEMCR
    <42b>   DW_AT_decl_file   : 10
    <42b>   DW_AT_decl_line   : 1426
    <42d>   DW_AT_decl_column : 18
    <42d>   DW_AT_type        : <0xd0>
    <431>   DW_AT_data_member_location: 12
 <2><432>: Abbrev Number: 0
 <1><433>: Abbrev Number: 28 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0x3b048): CoreDebug_Type
    <438>   DW_AT_decl_file   : 10
    <438>   DW_AT_decl_line   : 1427
    <43a>   DW_AT_decl_column : 3
    <43a>   DW_AT_type        : <0x3fa>
 <1><43e>: Abbrev Number: 4 (DW_TAG_typedef)
    <43f>   DW_AT_name        : (indirect string, offset: 0x5d3f4): __compar_fn_t
    <443>   DW_AT_decl_file   : 11
    <444>   DW_AT_decl_line   : 57
    <445>   DW_AT_decl_column : 15
    <446>   DW_AT_type        : <0x44a>
 <1><44a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <44b>   DW_AT_byte_size   : 4
    <44b>   DW_AT_type        : <0x44f>
 <1><44f>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <450>   DW_AT_prototyped  : 1
    <450>   DW_AT_type        : <0x2a>
    <454>   DW_AT_sibling     : <0x463>
 <2><458>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <459>   DW_AT_type        : <0x463>
 <2><45d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <45e>   DW_AT_type        : <0x463>
 <2><462>: Abbrev Number: 0
 <1><463>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <464>   DW_AT_byte_size   : 4
    <464>   DW_AT_type        : <0x468>
 <1><468>: Abbrev Number: 40 (DW_TAG_const_type)
 <1><469>: Abbrev Number: 41 (DW_TAG_enumeration_type)
    <46a>   DW_AT_name        : (indirect string, offset: 0x348bb): taskType_e
    <46e>   DW_AT_encoding    : 7	(unsigned)
    <46f>   DW_AT_byte_size   : 1
    <470>   DW_AT_type        : <0x59>
    <474>   DW_AT_decl_file   : 1
    <475>   DW_AT_decl_line   : 38
    <476>   DW_AT_decl_column : 14
    <477>   DW_AT_sibling     : <0x488>
 <2><47b>: Abbrev Number: 14 (DW_TAG_enumerator)
    <47c>   DW_AT_name        : (indirect string, offset: 0x479f6): taskTypePeriodic
    <480>   DW_AT_const_value : 0
 <2><481>: Abbrev Number: 14 (DW_TAG_enumerator)
    <482>   DW_AT_name        : (indirect string, offset: 0x61a6): taskTypeSporadic
    <486>   DW_AT_const_value : 1
 <2><487>: Abbrev Number: 0
 <1><488>: Abbrev Number: 4 (DW_TAG_typedef)
    <489>   DW_AT_name        : (indirect string, offset: 0x348bb): taskType_e
    <48d>   DW_AT_decl_file   : 1
    <48e>   DW_AT_decl_line   : 40
    <48f>   DW_AT_decl_column : 2
    <490>   DW_AT_type        : <0x469>
 <1><494>: Abbrev Number: 12 (DW_TAG_variable)
    <495>   DW_AT_name        : (indirect string, offset: 0x5aacd): vTasksListInit
    <499>   DW_AT_decl_file   : 1
    <499>   DW_AT_decl_line   : 55
    <49a>   DW_AT_decl_column : 19
    <49b>   DW_AT_type        : <0xfd>
    <49f>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><4a5>: Abbrev Number: 12 (DW_TAG_variable)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x55f3c): xTasksList
    <4aa>   DW_AT_decl_file   : 1
    <4aa>   DW_AT_decl_line   : 56
    <4ab>   DW_AT_decl_column : 15
    <4ac>   DW_AT_type        : <0x230>
    <4b0>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><4b6>: Abbrev Number: 12 (DW_TAG_variable)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x65067): xListTasksNumber
    <4bb>   DW_AT_decl_file   : 1
    <4bb>   DW_AT_decl_line   : 57
    <4bc>   DW_AT_decl_column : 19
    <4bd>   DW_AT_type        : <0xfd>
    <4c1>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><4c7>: Abbrev Number: 18 (DW_TAG_structure_type)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x14d45): MSTextendedTCB
    <4cc>   DW_AT_byte_size   : 124
    <4cd>   DW_AT_decl_file   : 1
    <4ce>   DW_AT_decl_line   : 93
    <4cf>   DW_AT_decl_column : 16
    <4d0>   DW_AT_sibling     : <0x634>
 <2><4d4>: Abbrev Number: 2 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0x3d4f8): pxTaskTCBListItem
    <4d9>   DW_AT_decl_file   : 1
    <4da>   DW_AT_decl_line   : 96
    <4db>   DW_AT_decl_column : 13
    <4dc>   DW_AT_type        : <0x1d9>
    <4e0>   DW_AT_data_member_location: 0
 <2><4e1>: Abbrev Number: 2 (DW_TAG_member)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x3b2e3): pvJobCode
    <4e6>   DW_AT_decl_file   : 1
    <4e7>   DW_AT_decl_line   : 98
    <4e8>   DW_AT_decl_column : 17
    <4e9>   DW_AT_type        : <0xda>
    <4ed>   DW_AT_data_member_location: 20
 <2><4ee>: Abbrev Number: 2 (DW_TAG_member)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x41f42): pcName
    <4f3>   DW_AT_decl_file   : 1
    <4f4>   DW_AT_decl_line   : 99
    <4f5>   DW_AT_decl_column : 14
    <4f6>   DW_AT_type        : <0x141>
    <4fa>   DW_AT_data_member_location: 24
 <2><4fb>: Abbrev Number: 2 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x6b130): usStackDepth
    <500>   DW_AT_decl_file   : 1
    <501>   DW_AT_decl_line   : 100
    <502>   DW_AT_decl_column : 25
    <503>   DW_AT_type        : <0xa7>
    <507>   DW_AT_data_member_location: 28
 <2><508>: Abbrev Number: 2 (DW_TAG_member)
    <509>   DW_AT_name        : (indirect string, offset: 0x6b58): pvParameters
    <50d>   DW_AT_decl_file   : 1
    <50e>   DW_AT_decl_line   : 101
    <50f>   DW_AT_decl_column : 8
    <510>   DW_AT_type        : <0xf6>
    <514>   DW_AT_data_member_location: 32
 <2><515>: Abbrev Number: 2 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x2afe2): uxPriority
    <51a>   DW_AT_decl_file   : 1
    <51b>   DW_AT_decl_line   : 102
    <51c>   DW_AT_decl_column : 14
    <51d>   DW_AT_type        : <0x10e>
    <521>   DW_AT_data_member_location: 36
 <2><522>: Abbrev Number: 2 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x45bc9): pxCreatedTask
    <527>   DW_AT_decl_file   : 1
    <528>   DW_AT_decl_line   : 103
    <529>   DW_AT_decl_column : 16
    <52a>   DW_AT_type        : <0x634>
    <52e>   DW_AT_data_member_location: 40
 <2><52f>: Abbrev Number: 2 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x390f): taskType
    <534>   DW_AT_decl_file   : 1
    <535>   DW_AT_decl_line   : 104
    <536>   DW_AT_decl_column : 18
    <537>   DW_AT_type        : <0x469>
    <53b>   DW_AT_data_member_location: 44
 <2><53c>: Abbrev Number: 2 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x58276): xTaskPeriod
    <541>   DW_AT_decl_file   : 1
    <542>   DW_AT_decl_line   : 106
    <543>   DW_AT_decl_column : 13
    <544>   DW_AT_type        : <0x124>
    <548>   DW_AT_data_member_location: 48
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x6d3c3): xTaskDeadline
    <54e>   DW_AT_decl_file   : 1
    <54f>   DW_AT_decl_line   : 107
    <550>   DW_AT_decl_column : 13
    <551>   DW_AT_type        : <0x124>
    <555>   DW_AT_data_member_location: 52
 <2><556>: Abbrev Number: 2 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x3f644): xTaskPhase
    <55b>   DW_AT_decl_file   : 1
    <55c>   DW_AT_decl_line   : 108
    <55d>   DW_AT_decl_column : 13
    <55e>   DW_AT_type        : <0x124>
    <562>   DW_AT_data_member_location: 56
 <2><563>: Abbrev Number: 2 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x2721e): xTaskWCET
    <568>   DW_AT_decl_file   : 1
    <569>   DW_AT_decl_line   : 109
    <56a>   DW_AT_decl_column : 13
    <56b>   DW_AT_type        : <0x124>
    <56f>   DW_AT_data_member_location: 60
 <2><570>: Abbrev Number: 2 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0x3a8c4): xPrevReleaseTime
    <575>   DW_AT_decl_file   : 1
    <576>   DW_AT_decl_line   : 111
    <577>   DW_AT_decl_column : 13
    <578>   DW_AT_type        : <0x124>
    <57c>   DW_AT_data_member_location: 64
 <2><57d>: Abbrev Number: 2 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x48e2c): xPrevExecTime
    <582>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 112
    <584>   DW_AT_decl_column : 13
    <585>   DW_AT_type        : <0x124>
    <589>   DW_AT_data_member_location: 68
 <2><58a>: Abbrev Number: 2 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x64f36): xPrevAbsDeadline
    <58f>   DW_AT_decl_file   : 1
    <590>   DW_AT_decl_line   : 113
    <591>   DW_AT_decl_column : 13
    <592>   DW_AT_type        : <0x124>
    <596>   DW_AT_data_member_location: 72
 <2><597>: Abbrev Number: 2 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0xfb): xPrevStartTime
    <59c>   DW_AT_decl_file   : 1
    <59d>   DW_AT_decl_line   : 114
    <59e>   DW_AT_decl_column : 13
    <59f>   DW_AT_type        : <0x124>
    <5a3>   DW_AT_data_member_location: 76
 <2><5a4>: Abbrev Number: 2 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x5dfb3): xPrevFinishTime
    <5a9>   DW_AT_decl_file   : 1
    <5aa>   DW_AT_decl_line   : 115
    <5ab>   DW_AT_decl_column : 13
    <5ac>   DW_AT_type        : <0x124>
    <5b0>   DW_AT_data_member_location: 80
 <2><5b1>: Abbrev Number: 2 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x15767): uNumOfMissedDeadlines
    <5b6>   DW_AT_decl_file   : 1
    <5b7>   DW_AT_decl_line   : 116
    <5b8>   DW_AT_decl_column : 14
    <5b9>   DW_AT_type        : <0x10e>
    <5bd>   DW_AT_data_member_location: 84
 <2><5be>: Abbrev Number: 2 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x76f07): xNextIdealReleaseTime
    <5c3>   DW_AT_decl_file   : 1
    <5c4>   DW_AT_decl_line   : 117
    <5c5>   DW_AT_decl_column : 13
    <5c6>   DW_AT_type        : <0x124>
    <5ca>   DW_AT_data_member_location: 88
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x4feee): xTaskInitDone
    <5d0>   DW_AT_decl_file   : 1
    <5d1>   DW_AT_decl_line   : 121
    <5d2>   DW_AT_decl_column : 13
    <5d3>   DW_AT_type        : <0xfd>
    <5d7>   DW_AT_data_member_location: 92
 <2><5d8>: Abbrev Number: 2 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x2dc42): xTaskSpecificTimer
    <5dd>   DW_AT_decl_file   : 1
    <5de>   DW_AT_decl_line   : 126
    <5df>   DW_AT_decl_column : 16
    <5e0>   DW_AT_type        : <0x28b>
    <5e4>   DW_AT_data_member_location: 96
 <2><5e5>: Abbrev Number: 2 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x83119): xUsFromIdealRelease
    <5ea>   DW_AT_decl_file   : 1
    <5eb>   DW_AT_decl_line   : 132
    <5ec>   DW_AT_decl_column : 10
    <5ed>   DW_AT_type        : <0xb8>
    <5f1>   DW_AT_data_member_location: 100
 <2><5f2>: Abbrev Number: 2 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x2e4a3): xNumOfIterations
    <5f7>   DW_AT_decl_file   : 1
    <5f8>   DW_AT_decl_line   : 133
    <5f9>   DW_AT_decl_column : 11
    <5fa>   DW_AT_type        : <0xc4>
    <5fe>   DW_AT_data_member_location: 104
 <2><5ff>: Abbrev Number: 2 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x40f49): xUsAverageReleaseGap
    <604>   DW_AT_decl_file   : 1
    <605>   DW_AT_decl_line   : 134
    <606>   DW_AT_decl_column : 10
    <607>   DW_AT_type        : <0xb8>
    <60b>   DW_AT_data_member_location: 108
 <2><60c>: Abbrev Number: 2 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x7df37): xTaskInterarrivalTime
    <611>   DW_AT_decl_file   : 1
    <612>   DW_AT_decl_line   : 139
    <613>   DW_AT_decl_column : 13
    <614>   DW_AT_type        : <0x124>
    <618>   DW_AT_data_member_location: 112
 <2><619>: Abbrev Number: 2 (DW_TAG_member)
    <61a>   DW_AT_name        : (indirect string, offset: 0x437ea): xInterarrivalTimerRunning
    <61e>   DW_AT_decl_file   : 1
    <61f>   DW_AT_decl_line   : 140
    <620>   DW_AT_decl_column : 13
    <621>   DW_AT_type        : <0xfd>
    <625>   DW_AT_data_member_location: 116
 <2><626>: Abbrev Number: 2 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x3d138): xJobCalled
    <62b>   DW_AT_decl_file   : 1
    <62c>   DW_AT_decl_line   : 141
    <62d>   DW_AT_decl_column : 13
    <62e>   DW_AT_type        : <0xfd>
    <632>   DW_AT_data_member_location: 120
 <2><633>: Abbrev Number: 0
 <1><634>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <635>   DW_AT_byte_size   : 4
    <635>   DW_AT_type        : <0x23c>
 <1><639>: Abbrev Number: 8 (DW_TAG_const_type)
    <63a>   DW_AT_type        : <0x634>
 <1><63e>: Abbrev Number: 4 (DW_TAG_typedef)
    <63f>   DW_AT_name        : (indirect string, offset: 0x8b6bf): extTCB_t
    <643>   DW_AT_decl_file   : 1
    <644>   DW_AT_decl_line   : 143
    <645>   DW_AT_decl_column : 3
    <646>   DW_AT_type        : <0x4c7>
 <1><64a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <64b>   DW_AT_external    : 1
    <64b>   DW_AT_name        : (indirect string, offset: 0x5f85c): uxListRemove
    <64f>   DW_AT_decl_file   : 7
    <650>   DW_AT_decl_line   : 405
    <652>   DW_AT_decl_column : 13
    <653>   DW_AT_prototyped  : 1
    <653>   DW_AT_type        : <0x10e>
    <657>   DW_AT_declaration : 1
    <657>   DW_AT_sibling     : <0x661>
 <2><65b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <65c>   DW_AT_type        : <0x22b>
 <2><660>: Abbrev Number: 0
 <1><661>: Abbrev Number: 13 (DW_TAG_subprogram)
    <662>   DW_AT_external    : 1
    <662>   DW_AT_name        : (indirect string, offset: 0x44553): xTaskGenericNotify
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 1853
    <669>   DW_AT_decl_column : 12
    <66a>   DW_AT_prototyped  : 1
    <66a>   DW_AT_type        : <0xfd>
    <66e>   DW_AT_declaration : 1
    <66e>   DW_AT_sibling     : <0x687>
 <2><672>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <673>   DW_AT_type        : <0x23c>
 <2><677>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <678>   DW_AT_type        : <0xc4>
 <2><67c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <67d>   DW_AT_type        : <0x27f>
 <2><681>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <682>   DW_AT_type        : <0x687>
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <688>   DW_AT_byte_size   : 4
    <688>   DW_AT_type        : <0xc4>
 <1><68c>: Abbrev Number: 17 (DW_TAG_subprogram)
    <68d>   DW_AT_external    : 1
    <68d>   DW_AT_name        : (indirect string, offset: 0x547ee): vListInsertEnd
    <691>   DW_AT_decl_file   : 7
    <692>   DW_AT_decl_line   : 390
    <694>   DW_AT_decl_column : 6
    <695>   DW_AT_prototyped  : 1
    <695>   DW_AT_declaration : 1
    <695>   DW_AT_sibling     : <0x6a4>
 <2><699>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <69a>   DW_AT_type        : <0x6a9>
 <2><69e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <69f>   DW_AT_type        : <0x22b>
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6a5>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x230>
 <1><6a9>: Abbrev Number: 8 (DW_TAG_const_type)
    <6aa>   DW_AT_type        : <0x6a4>
 <1><6ae>: Abbrev Number: 17 (DW_TAG_subprogram)
    <6af>   DW_AT_external    : 1
    <6af>   DW_AT_name        : (indirect string, offset: 0x50d8d): vListInitialiseItem
    <6b3>   DW_AT_decl_file   : 7
    <6b4>   DW_AT_decl_line   : 356
    <6b6>   DW_AT_decl_column : 6
    <6b7>   DW_AT_prototyped  : 1
    <6b7>   DW_AT_declaration : 1
    <6b7>   DW_AT_sibling     : <0x6c1>
 <2><6bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <6bc>   DW_AT_type        : <0x22b>
 <2><6c0>: Abbrev Number: 0
 <1><6c1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <6c2>   DW_AT_external    : 1
    <6c2>   DW_AT_name        : (indirect string, offset: 0x5358f): vListInitialise
    <6c6>   DW_AT_decl_file   : 7
    <6c7>   DW_AT_decl_line   : 345
    <6c9>   DW_AT_decl_column : 6
    <6ca>   DW_AT_prototyped  : 1
    <6ca>   DW_AT_declaration : 1
    <6ca>   DW_AT_sibling     : <0x6d4>
 <2><6ce>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <6cf>   DW_AT_type        : <0x6a9>
 <2><6d3>: Abbrev Number: 0
 <1><6d4>: Abbrev Number: 42 (DW_TAG_subprogram)
    <6d5>   DW_AT_external    : 1
    <6d5>   DW_AT_name        : (indirect string, offset: 0x52f25): vTaskStartScheduler
    <6d9>   DW_AT_decl_file   : 8
    <6da>   DW_AT_decl_line   : 1180
    <6dc>   DW_AT_decl_column : 6
    <6dd>   DW_AT_prototyped  : 1
    <6dd>   DW_AT_declaration : 1
 <1><6dd>: Abbrev Number: 17 (DW_TAG_subprogram)
    <6de>   DW_AT_external    : 1
    <6de>   DW_AT_name        : (indirect string, offset: 0x7c4b3): vTaskPrioritySet
    <6e2>   DW_AT_decl_file   : 8
    <6e3>   DW_AT_decl_line   : 1018
    <6e5>   DW_AT_decl_column : 6
    <6e6>   DW_AT_prototyped  : 1
    <6e6>   DW_AT_declaration : 1
    <6e6>   DW_AT_sibling     : <0x6f5>
 <2><6ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <6eb>   DW_AT_type        : <0x23c>
 <2><6ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <6f0>   DW_AT_type        : <0x10e>
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 43 (DW_TAG_subprogram)
    <6f6>   DW_AT_external    : 1
    <6f6>   DW_AT_name        : (indirect string, offset: 0xd03c): qsort
    <6fa>   DW_AT_decl_file   : 11
    <6fb>   DW_AT_decl_line   : 143
    <6fc>   DW_AT_decl_column : 6
    <6fd>   DW_AT_prototyped  : 1
    <6fd>   DW_AT_declaration : 1
    <6fd>   DW_AT_sibling     : <0x716>
 <2><701>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <702>   DW_AT_type        : <0xf6>
 <2><706>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <707>   DW_AT_type        : <0x31>
 <2><70b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <70c>   DW_AT_type        : <0x31>
 <2><710>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <711>   DW_AT_type        : <0x43e>
 <2><715>: Abbrev Number: 0
 <1><716>: Abbrev Number: 29 (DW_TAG_subprogram)
    <717>   DW_AT_external    : 1
    <717>   DW_AT_name        : (indirect string, offset: 0x54440): vPortExitCritical
    <71b>   DW_AT_decl_file   : 2
    <71b>   DW_AT_decl_line   : 98
    <71c>   DW_AT_decl_column : 13
    <71c>   DW_AT_prototyped  : 1
    <71c>   DW_AT_declaration : 1
 <1><71c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <71d>   DW_AT_external    : 1
    <71d>   DW_AT_name        : (indirect string, offset: 0x87e79): vPortEnterCritical
    <721>   DW_AT_decl_file   : 2
    <721>   DW_AT_decl_line   : 97
    <722>   DW_AT_decl_column : 13
    <722>   DW_AT_prototyped  : 1
    <722>   DW_AT_declaration : 1
 <1><722>: Abbrev Number: 13 (DW_TAG_subprogram)
    <723>   DW_AT_external    : 1
    <723>   DW_AT_name        : (indirect string, offset: 0x36f95): xTaskNotifyWait
    <727>   DW_AT_decl_file   : 8
    <728>   DW_AT_decl_line   : 2021
    <72a>   DW_AT_decl_column : 12
    <72b>   DW_AT_prototyped  : 1
    <72b>   DW_AT_type        : <0xfd>
    <72f>   DW_AT_declaration : 1
    <72f>   DW_AT_sibling     : <0x748>
 <2><733>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <734>   DW_AT_type        : <0xc4>
 <2><738>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <739>   DW_AT_type        : <0xc4>
 <2><73d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <73e>   DW_AT_type        : <0x687>
 <2><742>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <743>   DW_AT_type        : <0x124>
 <2><747>: Abbrev Number: 0
 <1><748>: Abbrev Number: 13 (DW_TAG_subprogram)
    <749>   DW_AT_external    : 1
    <749>   DW_AT_name        : (indirect string, offset: 0x27fbb): pvTimerGetTimerID
    <74d>   DW_AT_decl_file   : 9
    <74e>   DW_AT_decl_line   : 386
    <750>   DW_AT_decl_column : 7
    <751>   DW_AT_prototyped  : 1
    <751>   DW_AT_type        : <0xf6>
    <755>   DW_AT_declaration : 1
    <755>   DW_AT_sibling     : <0x75f>
 <2><759>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <75a>   DW_AT_type        : <0x297>
 <2><75e>: Abbrev Number: 0
 <1><75f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <760>   DW_AT_external    : 1
    <760>   DW_AT_name        : (indirect string, offset: 0x6797b): pvTaskGetThreadLocalStoragePointer
    <764>   DW_AT_decl_file   : 8
    <765>   DW_AT_decl_line   : 1518
    <767>   DW_AT_decl_column : 8
    <768>   DW_AT_prototyped  : 1
    <768>   DW_AT_type        : <0xf6>
    <76c>   DW_AT_declaration : 1
    <76c>   DW_AT_sibling     : <0x77b>
 <2><770>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <771>   DW_AT_type        : <0x23c>
 <2><775>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <776>   DW_AT_type        : <0xfd>
 <2><77a>: Abbrev Number: 0
 <1><77b>: Abbrev Number: 30 (DW_TAG_subprogram)
    <77c>   DW_AT_external    : 1
    <77c>   DW_AT_name        : (indirect string, offset: 0x65a57): xTaskGetCurrentTaskHandle
    <780>   DW_AT_decl_file   : 8
    <780>   DW_AT_decl_line   : 2438
    <782>   DW_AT_decl_column : 14
    <783>   DW_AT_prototyped  : 1
    <783>   DW_AT_type        : <0x23c>
    <787>   DW_AT_declaration : 1
 <1><787>: Abbrev Number: 13 (DW_TAG_subprogram)
    <788>   DW_AT_external    : 1
    <788>   DW_AT_name        : (indirect string, offset: 0x8c1c4): ulTaskNotifyTake
    <78c>   DW_AT_decl_file   : 8
    <78d>   DW_AT_decl_line   : 2191
    <78f>   DW_AT_decl_column : 10
    <790>   DW_AT_prototyped  : 1
    <790>   DW_AT_type        : <0xc4>
    <794>   DW_AT_declaration : 1
    <794>   DW_AT_sibling     : <0x7a3>
 <2><798>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <799>   DW_AT_type        : <0xfd>
 <2><79d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <79e>   DW_AT_type        : <0x124>
 <2><7a2>: Abbrev Number: 0
 <1><7a3>: Abbrev Number: 31 (DW_TAG_subprogram)
    <7a4>   DW_AT_external    : 1
    <7a4>   DW_AT_name        : (indirect string, offset: 0x8eb98): pvPortMalloc
    <7a8>   DW_AT_decl_file   : 12
    <7a9>   DW_AT_decl_line   : 163
    <7aa>   DW_AT_decl_column : 7
    <7ab>   DW_AT_prototyped  : 1
    <7ab>   DW_AT_type        : <0xf6>
    <7af>   DW_AT_declaration : 1
    <7af>   DW_AT_sibling     : <0x7b9>
 <2><7b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7b4>   DW_AT_type        : <0x31>
 <2><7b8>: Abbrev Number: 0
 <1><7b9>: Abbrev Number: 17 (DW_TAG_subprogram)
    <7ba>   DW_AT_external    : 1
    <7ba>   DW_AT_name        : (indirect string, offset: 0x5adc5): vTaskSetThreadLocalStoragePointer
    <7be>   DW_AT_decl_file   : 8
    <7bf>   DW_AT_decl_line   : 1517
    <7c1>   DW_AT_decl_column : 7
    <7c2>   DW_AT_prototyped  : 1
    <7c2>   DW_AT_declaration : 1
    <7c2>   DW_AT_sibling     : <0x7d6>
 <2><7c6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7c7>   DW_AT_type        : <0x23c>
 <2><7cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7cc>   DW_AT_type        : <0xfd>
 <2><7d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7d1>   DW_AT_type        : <0xf6>
 <2><7d5>: Abbrev Number: 0
 <1><7d6>: Abbrev Number: 13 (DW_TAG_subprogram)
    <7d7>   DW_AT_external    : 1
    <7d7>   DW_AT_name        : (indirect string, offset: 0x7e8d8): xTimerGenericCommand
    <7db>   DW_AT_decl_file   : 9
    <7dc>   DW_AT_decl_line   : 1296
    <7de>   DW_AT_decl_column : 12
    <7df>   DW_AT_prototyped  : 1
    <7df>   DW_AT_type        : <0xfd>
    <7e3>   DW_AT_declaration : 1
    <7e3>   DW_AT_sibling     : <0x801>
 <2><7e7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x28b>
 <2><7ec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7ed>   DW_AT_type        : <0x109>
 <2><7f1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f2>   DW_AT_type        : <0x130>
 <2><7f6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7f7>   DW_AT_type        : <0x806>
 <2><7fb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7fc>   DW_AT_type        : <0x130>
 <2><800>: Abbrev Number: 0
 <1><801>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <802>   DW_AT_byte_size   : 4
    <802>   DW_AT_type        : <0xfd>
 <1><806>: Abbrev Number: 8 (DW_TAG_const_type)
    <807>   DW_AT_type        : <0x801>
 <1><80b>: Abbrev Number: 30 (DW_TAG_subprogram)
    <80c>   DW_AT_external    : 1
    <80c>   DW_AT_name        : (indirect string, offset: 0x46cd): xTaskGetTickCount
    <810>   DW_AT_decl_file   : 8
    <810>   DW_AT_decl_line   : 1356
    <812>   DW_AT_decl_column : 12
    <813>   DW_AT_prototyped  : 1
    <813>   DW_AT_type        : <0x124>
    <817>   DW_AT_declaration : 1
 <1><817>: Abbrev Number: 31 (DW_TAG_subprogram)
    <818>   DW_AT_external    : 1
    <818>   DW_AT_name        : (indirect string, offset: 0x89a78): xTimerCreate
    <81c>   DW_AT_decl_file   : 9
    <81d>   DW_AT_decl_line   : 228
    <81e>   DW_AT_decl_column : 16
    <81f>   DW_AT_prototyped  : 1
    <81f>   DW_AT_type        : <0x28b>
    <823>   DW_AT_declaration : 1
    <823>   DW_AT_sibling     : <0x841>
 <2><827>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <828>   DW_AT_type        : <0x146>
 <2><82c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <82d>   DW_AT_type        : <0x130>
 <2><831>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <832>   DW_AT_type        : <0x11f>
 <2><836>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <837>   DW_AT_type        : <0xf8>
 <2><83b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <83c>   DW_AT_type        : <0x2a6>
 <2><840>: Abbrev Number: 0
 <1><841>: Abbrev Number: 13 (DW_TAG_subprogram)
    <842>   DW_AT_external    : 1
    <842>   DW_AT_name        : (indirect string, offset: 0x6b83a): xTaskCreate
    <846>   DW_AT_decl_file   : 8
    <847>   DW_AT_decl_line   : 330
    <849>   DW_AT_decl_column : 13
    <84a>   DW_AT_prototyped  : 1
    <84a>   DW_AT_type        : <0xfd>
    <84e>   DW_AT_declaration : 1
    <84e>   DW_AT_sibling     : <0x871>
 <2><852>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <853>   DW_AT_type        : <0xda>
 <2><857>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <858>   DW_AT_type        : <0x146>
 <2><85c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <85d>   DW_AT_type        : <0xb3>
 <2><861>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <862>   DW_AT_type        : <0xf8>
 <2><866>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <867>   DW_AT_type        : <0x10e>
 <2><86b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <86c>   DW_AT_type        : <0x639>
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 19 (DW_TAG_subprogram)
    <872>   DW_AT_name        : (indirect string, offset: 0x5ac48): prvMSTDispatch
    <876>   DW_AT_decl_file   : 1
    <876>   DW_AT_decl_line   : 577
    <878>   DW_AT_decl_column : 13
    <878>   DW_AT_prototyped  : 1
    <878>   DW_AT_low_pc      : 0x8000d00
    <87c>   DW_AT_high_pc     : 0x1a0
    <880>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <882>   DW_AT_call_all_tail_calls: 1
    <882>   DW_AT_sibling     : <0x982>
 <2><886>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <887>   DW_AT_name        : (indirect string, offset: 0x30fbd): forTask
    <88b>   DW_AT_decl_file   : 1
    <88b>   DW_AT_decl_line   : 577
    <88d>   DW_AT_decl_column : 42
    <88e>   DW_AT_type        : <0x634>
    <892>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><895>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <896>   DW_AT_name        : (indirect string, offset: 0x207cc): xAsCallee
    <89a>   DW_AT_decl_file   : 1
    <89a>   DW_AT_decl_line   : 577
    <89c>   DW_AT_decl_column : 62
    <89d>   DW_AT_type        : <0xfd>
    <8a1>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><8a4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x8c7a3): xOfTaskType
    <8a9>   DW_AT_decl_file   : 1
    <8a9>   DW_AT_decl_line   : 578
    <8ab>   DW_AT_decl_column : 14
    <8ac>   DW_AT_type        : <0x488>
    <8b0>   DW_AT_location    : 2 byte block: 91 4f 	(DW_OP_fbreg: -49)
 <2><8b3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x89689): xFromUserRequest
    <8b8>   DW_AT_decl_file   : 1
    <8b8>   DW_AT_decl_line   : 578
    <8ba>   DW_AT_decl_column : 38
    <8bb>   DW_AT_type        : <0xfd>
    <8bf>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><8c2>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <8c3>   DW_AT_low_pc      : 0x8000d16
    <8c7>   DW_AT_high_pc     : 0xe6
    <8cb>   DW_AT_sibling     : <0x915>
 <3><8cf>: Abbrev Number: 5 (DW_TAG_variable)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x13f3b): xCurrExtTCB
    <8d4>   DW_AT_decl_file   : 1
    <8d4>   DW_AT_decl_line   : 586
    <8d6>   DW_AT_decl_column : 13
    <8d7>   DW_AT_type        : <0x982>
    <8db>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><8de>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <8df>   DW_AT_abstract_origin: <0xf13>
    <8e3>   DW_AT_low_pc      : 0x8000d86
    <8e7>   DW_AT_high_pc     : 0x14
    <8eb>   DW_AT_call_file   : 1
    <8eb>   DW_AT_call_line   : 607
    <8ed>   DW_AT_call_column : 7
    <8ee>   DW_AT_sibling     : <0x8fb>
 <4><8f2>: Abbrev Number: 10 (DW_TAG_variable)
    <8f3>   DW_AT_abstract_origin: <0xf1c>
    <8f7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><8fa>: Abbrev Number: 0
 <3><8fb>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <8fc>   DW_AT_abstract_origin: <0xf13>
    <900>   DW_AT_low_pc      : 0x8000de4
    <904>   DW_AT_high_pc     : 0x14
    <908>   DW_AT_call_file   : 1
    <908>   DW_AT_call_line   : 625
    <90a>   DW_AT_call_column : 4
 <4><90b>: Abbrev Number: 10 (DW_TAG_variable)
    <90c>   DW_AT_abstract_origin: <0xf1c>
    <910>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><913>: Abbrev Number: 0
 <3><914>: Abbrev Number: 0
 <2><915>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <916>   DW_AT_low_pc      : 0x8000dfc
    <91a>   DW_AT_high_pc     : 0x8c
 <3><91e>: Abbrev Number: 5 (DW_TAG_variable)
    <91f>   DW_AT_name        : (indirect string, offset: 0x13f3b): xCurrExtTCB
    <923>   DW_AT_decl_file   : 1
    <923>   DW_AT_decl_line   : 634
    <925>   DW_AT_decl_column : 15
    <926>   DW_AT_type        : <0x982>
    <92a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><92d>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <92e>   DW_AT_abstract_origin: <0xf13>
    <932>   DW_AT_low_pc      : 0x8000e10
    <936>   DW_AT_high_pc     : 0x14
    <93a>   DW_AT_call_file   : 1
    <93a>   DW_AT_call_line   : 637
    <93c>   DW_AT_call_column : 5
    <93d>   DW_AT_sibling     : <0x94a>
 <4><941>: Abbrev Number: 10 (DW_TAG_variable)
    <942>   DW_AT_abstract_origin: <0xf1c>
    <946>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><949>: Abbrev Number: 0
 <3><94a>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <94b>   DW_AT_abstract_origin: <0xf13>
    <94f>   DW_AT_low_pc      : 0x8000e54
    <953>   DW_AT_high_pc     : 0x14
    <957>   DW_AT_call_file   : 1
    <957>   DW_AT_call_line   : 645
    <959>   DW_AT_call_column : 13
    <95a>   DW_AT_sibling     : <0x967>
 <4><95e>: Abbrev Number: 10 (DW_TAG_variable)
    <95f>   DW_AT_abstract_origin: <0xf1c>
    <963>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><966>: Abbrev Number: 0
 <3><967>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <968>   DW_AT_abstract_origin: <0xf13>
    <96c>   DW_AT_low_pc      : 0x8000e6c
    <970>   DW_AT_high_pc     : 0x14
    <974>   DW_AT_call_file   : 1
    <974>   DW_AT_call_line   : 648
    <976>   DW_AT_call_column : 9
 <4><977>: Abbrev Number: 10 (DW_TAG_variable)
    <978>   DW_AT_abstract_origin: <0xf1c>
    <97c>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <4><97f>: Abbrev Number: 0
 <3><980>: Abbrev Number: 0
 <2><981>: Abbrev Number: 0
 <1><982>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <983>   DW_AT_byte_size   : 4
    <983>   DW_AT_type        : <0x63e>
 <1><987>: Abbrev Number: 44 (DW_TAG_subprogram)
    <988>   DW_AT_external    : 1
    <988>   DW_AT_name        : (indirect string, offset: 0x85cee): vMSTSchedulerStart
    <98c>   DW_AT_decl_file   : 1
    <98d>   DW_AT_decl_line   : 557
    <98f>   DW_AT_decl_column : 6
    <990>   DW_AT_prototyped  : 1
    <990>   DW_AT_low_pc      : 0x8000cf0
    <994>   DW_AT_high_pc     : 0x10
    <998>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <99a>   DW_AT_call_all_tail_calls: 1
 <1><99a>: Abbrev Number: 45 (DW_TAG_subprogram)
    <99b>   DW_AT_name        : (indirect string, offset: 0x20c75): prvComputeOrderedPriorities
    <99f>   DW_AT_decl_file   : 1
    <9a0>   DW_AT_decl_line   : 509
    <9a2>   DW_AT_decl_column : 19
    <9a3>   DW_AT_type        : <0xfd>
    <9a7>   DW_AT_low_pc      : 0x8000b80
    <9ab>   DW_AT_high_pc     : 0x170
    <9af>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9b1>   DW_AT_call_all_tail_calls: 1
    <9b1>   DW_AT_sibling     : <0xae5>
 <2><9b5>: Abbrev Number: 5 (DW_TAG_variable)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x35755): listArray
    <9ba>   DW_AT_decl_file   : 1
    <9ba>   DW_AT_decl_line   : 510
    <9bc>   DW_AT_decl_column : 12
    <9bd>   DW_AT_type        : <0xae5>
    <9c1>   DW_AT_location    : 3 byte block: 91 50 6 	(DW_OP_fbreg: -48; DW_OP_deref)
 <2><9c5>: Abbrev Number: 21 (DW_TAG_variable)
    <9c6>   DW_AT_name        : i
    <9c8>   DW_AT_decl_file   : 1
    <9c8>   DW_AT_decl_line   : 512
    <9ca>   DW_AT_decl_column : 6
    <9cb>   DW_AT_type        : <0x2a>
    <9cf>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><9d2>: Abbrev Number: 5 (DW_TAG_variable)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x735ce): xItm
    <9d7>   DW_AT_decl_file   : 1
    <9d7>   DW_AT_decl_line   : 519
    <9d9>   DW_AT_decl_column : 14
    <9da>   DW_AT_type        : <0x226>
    <9de>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9e1>: Abbrev Number: 5 (DW_TAG_variable)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x6dbfe): uxUsedPriority
    <9e6>   DW_AT_decl_file   : 1
    <9e6>   DW_AT_decl_line   : 530
    <9e8>   DW_AT_decl_column : 14
    <9e9>   DW_AT_type        : <0x10e>
    <9ed>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><9f0>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <9f1>   DW_AT_low_pc      : 0x8000be8
    <9f5>   DW_AT_high_pc     : 0x4
    <9f9>   DW_AT_sibling     : <0xa0c>
 <3><9fd>: Abbrev Number: 21 (DW_TAG_variable)
    <9fe>   DW_AT_name        : jj
    <a01>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 515
    <a03>   DW_AT_decl_column : 9
    <a04>   DW_AT_type        : <0x2a>
    <a08>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <3><a0b>: Abbrev Number: 0
 <2><a0c>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <a0d>   DW_AT_low_pc      : 0x8000c16
    <a11>   DW_AT_high_pc     : 0x4a
    <a15>   DW_AT_sibling     : <0xa5b>
 <3><a19>: Abbrev Number: 21 (DW_TAG_variable)
    <a1a>   DW_AT_name        : i
    <a1c>   DW_AT_decl_file   : 1
    <a1c>   DW_AT_decl_line   : 520
    <a1e>   DW_AT_decl_column : 11
    <a1f>   DW_AT_type        : <0x2a>
    <a23>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><a26>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <a27>   DW_AT_low_pc      : 0x8000c1c
    <a2b>   DW_AT_high_pc     : 0x34
 <4><a2f>: Abbrev Number: 5 (DW_TAG_variable)
    <a30>   DW_AT_name        : (indirect string, offset: 0x7e347): xTCB
    <a34>   DW_AT_decl_file   : 1
    <a34>   DW_AT_decl_line   : 521
    <a36>   DW_AT_decl_column : 16
    <a37>   DW_AT_type        : <0x982>
    <a3b>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <4><a3f>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <a40>   DW_AT_abstract_origin: <0xf13>
    <a44>   DW_AT_low_pc      : 0x8000c28
    <a48>   DW_AT_high_pc     : 0x14
    <a4c>   DW_AT_call_file   : 1
    <a4c>   DW_AT_call_line   : 523
    <a4e>   DW_AT_call_column : 6
 <5><a4f>: Abbrev Number: 10 (DW_TAG_variable)
    <a50>   DW_AT_abstract_origin: <0xf1c>
    <a54>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <5><a58>: Abbrev Number: 0
 <4><a59>: Abbrev Number: 0
 <3><a5a>: Abbrev Number: 0
 <2><a5b>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <a5c>   DW_AT_low_pc      : 0x8000c74
    <a60>   DW_AT_high_pc     : 0x62
    <a64>   DW_AT_sibling     : <0xaca>
 <3><a68>: Abbrev Number: 5 (DW_TAG_variable)
    <a69>   DW_AT_name        : (indirect string, offset: 0x6843): xCurrInx
    <a6d>   DW_AT_decl_file   : 1
    <a6d>   DW_AT_decl_line   : 535
    <a6f>   DW_AT_decl_column : 19
    <a70>   DW_AT_type        : <0x10e>
    <a74>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><a77>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <a78>   DW_AT_low_pc      : 0x8000c7a
    <a7c>   DW_AT_high_pc     : 0x4a
 <4><a80>: Abbrev Number: 5 (DW_TAG_variable)
    <a81>   DW_AT_name        : (indirect string, offset: 0x4b34b): xTCB_Reference
    <a85>   DW_AT_decl_file   : 1
    <a85>   DW_AT_decl_line   : 536
    <a87>   DW_AT_decl_column : 13
    <a88>   DW_AT_type        : <0x982>
    <a8c>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <4><a8f>: Abbrev Number: 5 (DW_TAG_variable)
    <a90>   DW_AT_name        : (indirect string, offset: 0x36acf): bNewPriority
    <a94>   DW_AT_decl_file   : 1
    <a94>   DW_AT_decl_line   : 537
    <a96>   DW_AT_decl_column : 15
    <a97>   DW_AT_type        : <0x10e>
    <a9b>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <4><a9e>: Abbrev Number: 21 (DW_TAG_variable)
    <a9f>   DW_AT_name        : tht
    <aa3>   DW_AT_decl_file   : 1
    <aa3>   DW_AT_decl_line   : 546
    <aa5>   DW_AT_decl_column : 14
    <aa6>   DW_AT_type        : <0x982>
    <aaa>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <4><aae>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <aaf>   DW_AT_abstract_origin: <0xf13>
    <ab3>   DW_AT_low_pc      : 0x8000c9a
    <ab7>   DW_AT_high_pc     : 0x14
    <abb>   DW_AT_call_file   : 1
    <abb>   DW_AT_call_line   : 545
    <abd>   DW_AT_call_column : 3
 <5><abe>: Abbrev Number: 10 (DW_TAG_variable)
    <abf>   DW_AT_abstract_origin: <0xf1c>
    <ac3>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <5><ac7>: Abbrev Number: 0
 <4><ac8>: Abbrev Number: 0
 <3><ac9>: Abbrev Number: 0
 <2><aca>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <acb>   DW_AT_abstract_origin: <0xf13>
    <acf>   DW_AT_low_pc      : 0x8000bf8
    <ad3>   DW_AT_high_pc     : 0x14
    <ad7>   DW_AT_call_file   : 1
    <ad7>   DW_AT_call_line   : 517
    <ad9>   DW_AT_call_column : 2
 <3><ada>: Abbrev Number: 10 (DW_TAG_variable)
    <adb>   DW_AT_abstract_origin: <0xf1c>
    <adf>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <3><ae3>: Abbrev Number: 0
 <2><ae4>: Abbrev Number: 0
 <1><ae5>: Abbrev Number: 26 (DW_TAG_array_type)
    <ae6>   DW_AT_type        : <0x982>
    <aea>   DW_AT_sibling     : <0xaf8>
 <2><aee>: Abbrev Number: 46 (DW_TAG_subrange_type)
    <aef>   DW_AT_type        : <0x3d>
    <af3>   DW_AT_upper_bound : 3 byte block: 91 54 6 	(DW_OP_fbreg: -44; DW_OP_deref)
 <2><af7>: Abbrev Number: 0
 <1><af8>: Abbrev Number: 47 (DW_TAG_subprogram)
    <af9>   DW_AT_name        : (indirect string, offset: 0x2d8ae): prv_compare
    <afd>   DW_AT_decl_file   : 1
    <afe>   DW_AT_decl_line   : 483
    <b00>   DW_AT_decl_column : 12
    <b01>   DW_AT_prototyped  : 1
    <b01>   DW_AT_type        : <0x2a>
    <b05>   DW_AT_low_pc      : 0x8000b3a
    <b09>   DW_AT_high_pc     : 0x46
    <b0d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b0f>   DW_AT_call_all_calls: 1
    <b0f>   DW_AT_sibling     : <0xb50>
 <2><b13>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b14>   DW_AT_name        : (indirect string, offset: 0x1e07e): arg1
    <b18>   DW_AT_decl_file   : 1
    <b18>   DW_AT_decl_line   : 483
    <b1a>   DW_AT_decl_column : 36
    <b1b>   DW_AT_type        : <0x463>
    <b1f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b22>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b23>   DW_AT_name        : (indirect string, offset: 0x1e083): arg2
    <b27>   DW_AT_decl_file   : 1
    <b27>   DW_AT_decl_line   : 483
    <b29>   DW_AT_decl_column : 54
    <b2a>   DW_AT_type        : <0x463>
    <b2e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b31>: Abbrev Number: 5 (DW_TAG_variable)
    <b32>   DW_AT_name        : (indirect string, offset: 0x8b32f): itm1
    <b36>   DW_AT_decl_file   : 1
    <b36>   DW_AT_decl_line   : 484
    <b38>   DW_AT_decl_column : 12
    <b39>   DW_AT_type        : <0x982>
    <b3d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b40>: Abbrev Number: 5 (DW_TAG_variable)
    <b41>   DW_AT_name        : (indirect string, offset: 0x8b334): itm2
    <b45>   DW_AT_decl_file   : 1
    <b45>   DW_AT_decl_line   : 485
    <b47>   DW_AT_decl_column : 12
    <b48>   DW_AT_type        : <0x982>
    <b4c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b4f>: Abbrev Number: 0
 <1><b50>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b51>   DW_AT_external    : 1
    <b51>   DW_AT_name        : (indirect string, offset: 0x839e1): vMSTSporadicTaskRun
    <b55>   DW_AT_decl_file   : 1
    <b55>   DW_AT_decl_line   : 466
    <b57>   DW_AT_decl_column : 12
    <b57>   DW_AT_prototyped  : 1
    <b57>   DW_AT_type        : <0xfd>
    <b5b>   DW_AT_low_pc      : 0x8000b04
    <b5f>   DW_AT_high_pc     : 0x36
    <b63>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b65>   DW_AT_call_all_tail_calls: 1
    <b65>   DW_AT_sibling     : <0xb88>
 <2><b69>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x76cd9): pxTaskToRunHandle
    <b6e>   DW_AT_decl_file   : 1
    <b6e>   DW_AT_decl_line   : 466
    <b70>   DW_AT_decl_column : 46
    <b71>   DW_AT_type        : <0x634>
    <b75>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b78>: Abbrev Number: 5 (DW_TAG_variable)
    <b79>   DW_AT_name        : (indirect string, offset: 0x13f3b): xCurrExtTCB
    <b7d>   DW_AT_decl_file   : 1
    <b7d>   DW_AT_decl_line   : 471
    <b7f>   DW_AT_decl_column : 12
    <b80>   DW_AT_type        : <0x982>
    <b84>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b87>: Abbrev Number: 0
 <1><b88>: Abbrev Number: 19 (DW_TAG_subprogram)
    <b89>   DW_AT_name        : (indirect string, offset: 0x857c): prvMSTSporadicGenericJob
    <b8d>   DW_AT_decl_file   : 1
    <b8d>   DW_AT_decl_line   : 402
    <b8f>   DW_AT_decl_column : 13
    <b8f>   DW_AT_prototyped  : 1
    <b8f>   DW_AT_low_pc      : 0x80009b4
    <b93>   DW_AT_high_pc     : 0x150
    <b97>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b99>   DW_AT_call_all_tail_calls: 1
    <b99>   DW_AT_sibling     : <0xc29>
 <2><b9d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x6b58): pvParameters
    <ba2>   DW_AT_decl_file   : 1
    <ba2>   DW_AT_decl_line   : 402
    <ba4>   DW_AT_decl_column : 44
    <ba5>   DW_AT_type        : <0xf6>
    <ba9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><bac>: Abbrev Number: 5 (DW_TAG_variable)
    <bad>   DW_AT_name        : (indirect string, offset: 0x56129): xCurrentHandle
    <bb1>   DW_AT_decl_file   : 1
    <bb1>   DW_AT_decl_line   : 404
    <bb3>   DW_AT_decl_column : 15
    <bb4>   DW_AT_type        : <0x23c>
    <bb8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bbb>: Abbrev Number: 5 (DW_TAG_variable)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x13f3b): xCurrExtTCB
    <bc0>   DW_AT_decl_file   : 1
    <bc0>   DW_AT_decl_line   : 405
    <bc2>   DW_AT_decl_column : 12
    <bc3>   DW_AT_type        : <0x982>
    <bc7>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bca>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <bcb>   DW_AT_low_pc      : 0x80009ea
    <bcf>   DW_AT_high_pc     : 0x10a
    <bd3>   DW_AT_sibling     : <0xc0f>
 <3><bd7>: Abbrev Number: 5 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x2cdfc): notificationGiver
    <bdc>   DW_AT_decl_file   : 1
    <bdc>   DW_AT_decl_line   : 412
    <bde>   DW_AT_decl_column : 12
    <bdf>   DW_AT_type        : <0xc4>
    <be3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><be6>: Abbrev Number: 5 (DW_TAG_variable)
    <be7>   DW_AT_name        : (indirect string, offset: 0x97cf0): xTimer
    <beb>   DW_AT_decl_file   : 1
    <beb>   DW_AT_decl_line   : 435
    <bed>   DW_AT_decl_column : 17
    <bee>   DW_AT_type        : <0x28b>
    <bf2>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><bf5>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <bf6>   DW_AT_abstract_origin: <0xf13>
    <bfa>   DW_AT_low_pc      : 0x8000a8a
    <bfe>   DW_AT_high_pc     : 0x14
    <c02>   DW_AT_call_file   : 1
    <c02>   DW_AT_call_line   : 441
    <c04>   DW_AT_call_column : 3
 <4><c05>: Abbrev Number: 10 (DW_TAG_variable)
    <c06>   DW_AT_abstract_origin: <0xf1c>
    <c0a>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <4><c0d>: Abbrev Number: 0
 <3><c0e>: Abbrev Number: 0
 <2><c0f>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <c10>   DW_AT_abstract_origin: <0xf13>
    <c14>   DW_AT_low_pc      : 0x80009d2
    <c18>   DW_AT_high_pc     : 0x14
    <c1c>   DW_AT_call_file   : 1
    <c1c>   DW_AT_call_line   : 407
    <c1e>   DW_AT_call_column : 2
 <3><c1f>: Abbrev Number: 10 (DW_TAG_variable)
    <c20>   DW_AT_abstract_origin: <0xf1c>
    <c24>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><c27>: Abbrev Number: 0
 <2><c28>: Abbrev Number: 0
 <1><c29>: Abbrev Number: 32 (DW_TAG_subprogram)
    <c2a>   DW_AT_external    : 1
    <c2a>   DW_AT_name        : (indirect string, offset: 0x9f97): vMSTSporadicTaskCreate
    <c2e>   DW_AT_decl_file   : 1
    <c2e>   DW_AT_decl_line   : 362
    <c30>   DW_AT_decl_column : 12
    <c30>   DW_AT_prototyped  : 1
    <c30>   DW_AT_type        : <0xfd>
    <c34>   DW_AT_low_pc      : 0x8000908
    <c38>   DW_AT_high_pc     : 0xac
    <c3c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c3e>   DW_AT_call_all_tail_calls: 1
    <c3e>   DW_AT_sibling     : <0xcdd>
 <2><c42>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c43>   DW_AT_name        : (indirect string, offset: 0x3b2e3): pvJobCode
    <c47>   DW_AT_decl_file   : 1
    <c47>   DW_AT_decl_line   : 362
    <c49>   DW_AT_decl_column : 50
    <c4a>   DW_AT_type        : <0xda>
    <c4e>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <2><c52>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c53>   DW_AT_name        : (indirect string, offset: 0x41f42): pcName
    <c57>   DW_AT_decl_file   : 1
    <c57>   DW_AT_decl_line   : 362
    <c59>   DW_AT_decl_column : 73
    <c5a>   DW_AT_type        : <0x141>
    <c5e>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <2><c62>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c63>   DW_AT_name        : (indirect string, offset: 0x6b130): usStackDepth
    <c67>   DW_AT_decl_file   : 1
    <c67>   DW_AT_decl_line   : 363
    <c69>   DW_AT_decl_column : 12
    <c6a>   DW_AT_type        : <0xa7>
    <c6e>   DW_AT_location    : 3 byte block: 91 ee 7e 	(DW_OP_fbreg: -146)
 <2><c72>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c73>   DW_AT_name        : (indirect string, offset: 0x6b58): pvParameters
    <c77>   DW_AT_decl_file   : 1
    <c77>   DW_AT_decl_line   : 363
    <c79>   DW_AT_decl_column : 32
    <c7a>   DW_AT_type        : <0xf6>
    <c7e>   DW_AT_location    : 3 byte block: 91 e8 7e 	(DW_OP_fbreg: -152)
 <2><c82>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c83>   DW_AT_name        : (indirect string, offset: 0x2afe2): uxPriority
    <c87>   DW_AT_decl_file   : 1
    <c87>   DW_AT_decl_line   : 363
    <c89>   DW_AT_decl_column : 58
    <c8a>   DW_AT_type        : <0x10e>
    <c8e>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><c91>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c92>   DW_AT_name        : (indirect string, offset: 0x45bc9): pxCreatedTask
    <c96>   DW_AT_decl_file   : 1
    <c96>   DW_AT_decl_line   : 364
    <c98>   DW_AT_decl_column : 17
    <c99>   DW_AT_type        : <0x634>
    <c9d>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><ca0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x7df37): xTaskInterarrivalTime
    <ca5>   DW_AT_decl_file   : 1
    <ca5>   DW_AT_decl_line   : 366
    <ca7>   DW_AT_decl_column : 14
    <ca8>   DW_AT_type        : <0x124>
    <cac>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><caf>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x6d3c3): xTaskDeadline
    <cb4>   DW_AT_decl_file   : 1
    <cb4>   DW_AT_decl_line   : 366
    <cb6>   DW_AT_decl_column : 48
    <cb7>   DW_AT_type        : <0x124>
    <cbb>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><cbe>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x2721e): xTaskWCET
    <cc3>   DW_AT_decl_file   : 1
    <cc3>   DW_AT_decl_line   : 367
    <cc5>   DW_AT_decl_column : 14
    <cc6>   DW_AT_type        : <0x124>
    <cca>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
 <2><ccd>: Abbrev Number: 5 (DW_TAG_variable)
    <cce>   DW_AT_name        : (indirect string, offset: 0x77743): xNewExtTCB
    <cd2>   DW_AT_decl_file   : 1
    <cd2>   DW_AT_decl_line   : 369
    <cd4>   DW_AT_decl_column : 12
    <cd5>   DW_AT_type        : <0x982>
    <cd9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cdc>: Abbrev Number: 0
 <1><cdd>: Abbrev Number: 19 (DW_TAG_subprogram)
    <cde>   DW_AT_name        : (indirect string, offset: 0x3b2a6): prvMSTSporadicTimerCallback
    <ce2>   DW_AT_decl_file   : 1
    <ce2>   DW_AT_decl_line   : 352
    <ce4>   DW_AT_decl_column : 13
    <ce4>   DW_AT_prototyped  : 1
    <ce4>   DW_AT_low_pc      : 0x80008e4
    <ce8>   DW_AT_high_pc     : 0x24
    <cec>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cee>   DW_AT_call_all_tail_calls: 1
    <cee>   DW_AT_sibling     : <0xd11>
 <2><cf2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x97cf0): xTimer
    <cf7>   DW_AT_decl_file   : 1
    <cf7>   DW_AT_decl_line   : 352
    <cf9>   DW_AT_decl_column : 55
    <cfa>   DW_AT_type        : <0x28b>
    <cfe>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d01>: Abbrev Number: 5 (DW_TAG_variable)
    <d02>   DW_AT_name        : (indirect string, offset: 0x7eba4): param
    <d06>   DW_AT_decl_file   : 1
    <d06>   DW_AT_decl_line   : 356
    <d08>   DW_AT_decl_column : 16
    <d09>   DW_AT_type        : <0x634>
    <d0d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d10>: Abbrev Number: 0
 <1><d11>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d12>   DW_AT_name        : (indirect string, offset: 0x46dca): prvMSTPeriodicTimerCallback
    <d16>   DW_AT_decl_file   : 1
    <d16>   DW_AT_decl_line   : 343
    <d18>   DW_AT_decl_column : 13
    <d18>   DW_AT_prototyped  : 1
    <d18>   DW_AT_low_pc      : 0x80008c0
    <d1c>   DW_AT_high_pc     : 0x24
    <d20>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d22>   DW_AT_call_all_tail_calls: 1
    <d22>   DW_AT_sibling     : <0xd45>
 <2><d26>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d27>   DW_AT_name        : (indirect string, offset: 0x97cf0): xTimer
    <d2b>   DW_AT_decl_file   : 1
    <d2b>   DW_AT_decl_line   : 343
    <d2d>   DW_AT_decl_column : 55
    <d2e>   DW_AT_type        : <0x28b>
    <d32>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d35>: Abbrev Number: 5 (DW_TAG_variable)
    <d36>   DW_AT_name        : (indirect string, offset: 0x7eba4): param
    <d3a>   DW_AT_decl_file   : 1
    <d3a>   DW_AT_decl_line   : 348
    <d3c>   DW_AT_decl_column : 16
    <d3d>   DW_AT_type        : <0x634>
    <d41>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d44>: Abbrev Number: 0
 <1><d45>: Abbrev Number: 48 (DW_TAG_subprogram)
    <d46>   DW_AT_name        : (indirect string, offset: 0xa478): prvMSTPeriodicGenericJob
    <d4a>   DW_AT_decl_file   : 1
    <d4b>   DW_AT_decl_line   : 230
    <d4c>   DW_AT_decl_column : 13
    <d4d>   DW_AT_prototyped  : 1
    <d4d>   DW_AT_low_pc      : 0x8000778
    <d51>   DW_AT_high_pc     : 0x148
    <d55>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d57>   DW_AT_call_all_tail_calls: 1
    <d57>   DW_AT_sibling     : <0xdbb>
 <2><d5b>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x6b58): pvParameters
    <d60>   DW_AT_decl_file   : 1
    <d60>   DW_AT_decl_line   : 230
    <d61>   DW_AT_decl_column : 44
    <d62>   DW_AT_type        : <0xf6>
    <d66>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d69>: Abbrev Number: 12 (DW_TAG_variable)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x56129): xCurrentHandle
    <d6e>   DW_AT_decl_file   : 1
    <d6e>   DW_AT_decl_line   : 240
    <d6f>   DW_AT_decl_column : 15
    <d70>   DW_AT_type        : <0x23c>
    <d74>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d77>: Abbrev Number: 12 (DW_TAG_variable)
    <d78>   DW_AT_name        : (indirect string, offset: 0x13f3b): xCurrExtTCB
    <d7c>   DW_AT_decl_file   : 1
    <d7c>   DW_AT_decl_line   : 241
    <d7d>   DW_AT_decl_column : 12
    <d7e>   DW_AT_type        : <0x982>
    <d82>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d85>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <d86>   DW_AT_low_pc      : 0x800080a
    <d8a>   DW_AT_high_pc     : 0xb0
    <d8e>   DW_AT_sibling     : <0xda2>
 <3><d92>: Abbrev Number: 5 (DW_TAG_variable)
    <d93>   DW_AT_name        : (indirect string, offset: 0x5796d): perfRelease
    <d97>   DW_AT_decl_file   : 1
    <d97>   DW_AT_decl_line   : 282
    <d99>   DW_AT_decl_column : 12
    <d9a>   DW_AT_type        : <0xc4>
    <d9e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><da1>: Abbrev Number: 0
 <2><da2>: Abbrev Number: 33 (DW_TAG_inlined_subroutine)
    <da3>   DW_AT_abstract_origin: <0xf13>
    <da7>   DW_AT_low_pc      : 0x80007a0
    <dab>   DW_AT_high_pc     : 0x14
    <daf>   DW_AT_call_file   : 1
    <daf>   DW_AT_call_line   : 246
    <db0>   DW_AT_call_column : 2
 <3><db1>: Abbrev Number: 10 (DW_TAG_variable)
    <db2>   DW_AT_abstract_origin: <0xf1c>
    <db6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><db9>: Abbrev Number: 0
 <2><dba>: Abbrev Number: 0
 <1><dbb>: Abbrev Number: 49 (DW_TAG_subprogram)
    <dbc>   DW_AT_external    : 1
    <dbc>   DW_AT_name        : (indirect string, offset: 0x2730a): vMSTPeriodicTaskCreate
    <dc0>   DW_AT_decl_file   : 1
    <dc1>   DW_AT_decl_line   : 169
    <dc2>   DW_AT_decl_column : 14
    <dc3>   DW_AT_prototyped  : 1
    <dc3>   DW_AT_type        : <0x23c>
    <dc7>   DW_AT_low_pc      : 0x80006d4
    <dcb>   DW_AT_high_pc     : 0xa2
    <dcf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd1>   DW_AT_call_all_tail_calls: 1
    <dd1>   DW_AT_sibling     : <0xe74>
 <2><dd5>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x3b2e3): pvJobCode
    <dda>   DW_AT_decl_file   : 1
    <dda>   DW_AT_decl_line   : 169
    <ddb>   DW_AT_decl_column : 52
    <ddc>   DW_AT_type        : <0xda>
    <de0>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <2><de4>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <de5>   DW_AT_name        : (indirect string, offset: 0x41f42): pcName
    <de9>   DW_AT_decl_file   : 1
    <de9>   DW_AT_decl_line   : 170
    <dea>   DW_AT_decl_column : 15
    <deb>   DW_AT_type        : <0x141>
    <def>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <2><df3>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <df4>   DW_AT_name        : (indirect string, offset: 0x6b130): usStackDepth
    <df8>   DW_AT_decl_file   : 1
    <df8>   DW_AT_decl_line   : 170
    <df9>   DW_AT_decl_column : 32
    <dfa>   DW_AT_type        : <0xa7>
    <dfe>   DW_AT_location    : 3 byte block: 91 ee 7e 	(DW_OP_fbreg: -146)
 <2><e02>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e03>   DW_AT_name        : (indirect string, offset: 0x6b58): pvParameters
    <e07>   DW_AT_decl_file   : 1
    <e07>   DW_AT_decl_line   : 170
    <e08>   DW_AT_decl_column : 52
    <e09>   DW_AT_type        : <0xf6>
    <e0d>   DW_AT_location    : 3 byte block: 91 e8 7e 	(DW_OP_fbreg: -152)
 <2><e11>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e12>   DW_AT_name        : (indirect string, offset: 0x2afe2): uxPriority
    <e16>   DW_AT_decl_file   : 1
    <e16>   DW_AT_decl_line   : 171
    <e17>   DW_AT_decl_column : 15
    <e18>   DW_AT_type        : <0x10e>
    <e1c>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><e1f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e20>   DW_AT_name        : (indirect string, offset: 0x45bc9): pxCreatedTask
    <e24>   DW_AT_decl_file   : 1
    <e24>   DW_AT_decl_line   : 171
    <e25>   DW_AT_decl_column : 41
    <e26>   DW_AT_type        : <0x634>
    <e2a>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><e2d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x58276): xTaskPeriod
    <e32>   DW_AT_decl_file   : 1
    <e32>   DW_AT_decl_line   : 173
    <e33>   DW_AT_decl_column : 14
    <e34>   DW_AT_type        : <0x124>
    <e38>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><e3b>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x6d3c3): xTaskDeadline
    <e40>   DW_AT_decl_file   : 1
    <e40>   DW_AT_decl_line   : 173
    <e41>   DW_AT_decl_column : 38
    <e42>   DW_AT_type        : <0x124>
    <e46>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
 <2><e49>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x3f644): xTaskPhase
    <e4e>   DW_AT_decl_file   : 1
    <e4e>   DW_AT_decl_line   : 173
    <e4f>   DW_AT_decl_column : 64
    <e50>   DW_AT_type        : <0x124>
    <e54>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
 <2><e57>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e58>   DW_AT_name        : (indirect string, offset: 0x2721e): xTaskWCET
    <e5c>   DW_AT_decl_file   : 1
    <e5c>   DW_AT_decl_line   : 174
    <e5d>   DW_AT_decl_column : 14
    <e5e>   DW_AT_type        : <0x124>
    <e62>   DW_AT_location    : 2 byte block: 91 14 	(DW_OP_fbreg: 20)
 <2><e65>: Abbrev Number: 12 (DW_TAG_variable)
    <e66>   DW_AT_name        : (indirect string, offset: 0x77743): xNewExtTCB
    <e6a>   DW_AT_decl_file   : 1
    <e6a>   DW_AT_decl_line   : 176
    <e6b>   DW_AT_decl_column : 12
    <e6c>   DW_AT_type        : <0x982>
    <e70>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e73>: Abbrev Number: 0
 <1><e74>: Abbrev Number: 50 (DW_TAG_subprogram)
    <e75>   DW_AT_name        : (indirect string, offset: 0x1ea2a): prvPeriodicTaskCreate
    <e79>   DW_AT_decl_file   : 1
    <e7a>   DW_AT_decl_line   : 145
    <e7b>   DW_AT_decl_column : 19
    <e7c>   DW_AT_prototyped  : 1
    <e7c>   DW_AT_type        : <0xfd>
    <e80>   DW_AT_low_pc      : 0x8000610
    <e84>   DW_AT_high_pc     : 0xc4
    <e88>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e8a>   DW_AT_call_all_tail_calls: 1
    <e8a>   DW_AT_sibling     : <0xecd>
 <2><e8e>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x84bfd): xFromTCB
    <e93>   DW_AT_decl_file   : 1
    <e93>   DW_AT_decl_line   : 145
    <e94>   DW_AT_decl_column : 51
    <e95>   DW_AT_type        : <0x982>
    <e99>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><e9c>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <e9d>   DW_AT_low_pc      : 0x8000640
    <ea1>   DW_AT_high_pc     : 0x78
 <3><ea5>: Abbrev Number: 12 (DW_TAG_variable)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x97cf0): xTimer
    <eaa>   DW_AT_decl_file   : 1
    <eaa>   DW_AT_decl_line   : 154
    <eab>   DW_AT_decl_column : 17
    <eac>   DW_AT_type        : <0x28b>
    <eb0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><eb3>: Abbrev Number: 33 (DW_TAG_inlined_subroutine)
    <eb4>   DW_AT_abstract_origin: <0xf13>
    <eb8>   DW_AT_low_pc      : 0x800068c
    <ebc>   DW_AT_high_pc     : 0x14
    <ec0>   DW_AT_call_file   : 1
    <ec0>   DW_AT_call_line   : 159
    <ec1>   DW_AT_call_column : 3
 <4><ec2>: Abbrev Number: 10 (DW_TAG_variable)
    <ec3>   DW_AT_abstract_origin: <0xf1c>
    <ec7>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><eca>: Abbrev Number: 0
 <3><ecb>: Abbrev Number: 0
 <2><ecc>: Abbrev Number: 0
 <1><ecd>: Abbrev Number: 51 (DW_TAG_subprogram)
    <ece>   DW_AT_name        : (indirect string, offset: 0x481b9): prvMSTGetUS
    <ed2>   DW_AT_decl_file   : 1
    <ed3>   DW_AT_decl_line   : 27
    <ed4>   DW_AT_decl_column : 17
    <ed5>   DW_AT_type        : <0xc4>
    <ed9>   DW_AT_low_pc      : 0x80005e4
    <edd>   DW_AT_high_pc     : 0x2c
    <ee1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ee3>   DW_AT_call_all_calls: 1
    <ee3>   DW_AT_sibling     : <0xef6>
 <2><ee7>: Abbrev Number: 12 (DW_TAG_variable)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x6ee8d): outUS
    <eec>   DW_AT_decl_file   : 1
    <eec>   DW_AT_decl_line   : 32
    <eed>   DW_AT_decl_column : 11
    <eee>   DW_AT_type        : <0xc4>
    <ef2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 52 (DW_TAG_subprogram)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x863f2): prvMSTSetupUSClock
    <efb>   DW_AT_decl_file   : 1
    <efc>   DW_AT_decl_line   : 14
    <efd>   DW_AT_decl_column : 14
    <efe>   DW_AT_type        : <0xf0c>
    <f02>   DW_AT_low_pc      : 0x80005ac
    <f06>   DW_AT_high_pc     : 0x38
    <f0a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f0c>   DW_AT_call_all_calls: 1
 <1><f0c>: Abbrev Number: 9 (DW_TAG_base_type)
    <f0d>   DW_AT_byte_size   : 4
    <f0e>   DW_AT_encoding    : 4	(float)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x79f2d): float
 <1><f13>: Abbrev Number: 53 (DW_TAG_subprogram)
    <f14>   DW_AT_name        : (indirect string, offset: 0x7530b): vPortRaiseBASEPRI
    <f18>   DW_AT_decl_file   : 2
    <f19>   DW_AT_decl_line   : 191
    <f1a>   DW_AT_decl_column : 30
    <f1b>   DW_AT_prototyped  : 1
    <f1b>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><f1c>: Abbrev Number: 54 (DW_TAG_variable)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x80e08): ulNewBASEPRI
    <f21>   DW_AT_decl_file   : 2
    <f22>   DW_AT_decl_line   : 193
    <f23>   DW_AT_decl_column : 10
    <f24>   DW_AT_type        : <0xc4>
 <2><f28>: Abbrev Number: 0
 <1><f29>: Abbrev Number: 0
  Compilation Unit @ offset 0xf2a:
   Length:        0x6a8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x393
   Pointer Size:  4
 <0><f36>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <f37>   DW_AT_producer    : (indirect string, offset: 0x8c03b): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f3b>   DW_AT_language    : 29	(C11)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x8f136): ../Core/Src/freertos.c
    <f40>   DW_AT_comp_dir    : (indirect string, offset: 0x5ddde): /Users/enricoalberti/Desktop/FILES/Embedded/FreeRTOS/MST4FreeRTOS/MST-FreeRTOS-Example/Debug
    <f44>   DW_AT_ranges      : 0x74
    <f48>   DW_AT_low_pc      : 0
    <f4c>   DW_AT_stmt_list   : 0xed1
    <f50>   DW_AT_macros      : 0x15942
 <1><f54>: Abbrev Number: 19 (DW_TAG_base_type)
    <f55>   DW_AT_byte_size   : 4
    <f56>   DW_AT_encoding    : 5	(signed)
    <f57>   DW_AT_name        : int
 <1><f5b>: Abbrev Number: 4 (DW_TAG_base_type)
    <f5c>   DW_AT_byte_size   : 4
    <f5d>   DW_AT_encoding    : 7	(unsigned)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xb320): unsigned int
 <1><f62>: Abbrev Number: 4 (DW_TAG_base_type)
    <f63>   DW_AT_byte_size   : 8
    <f64>   DW_AT_encoding    : 5	(signed)
    <f65>   DW_AT_name        : (indirect string, offset: 0x3f4bd): long long int
 <1><f69>: Abbrev Number: 4 (DW_TAG_base_type)
    <f6a>   DW_AT_byte_size   : 8
    <f6b>   DW_AT_encoding    : 4	(float)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x74a3e): long double
 <1><f70>: Abbrev Number: 4 (DW_TAG_base_type)
    <f71>   DW_AT_byte_size   : 1
    <f72>   DW_AT_encoding    : 6	(signed char)
    <f73>   DW_AT_name        : (indirect string, offset: 0x46130): signed char
 <1><f77>: Abbrev Number: 4 (DW_TAG_base_type)
    <f78>   DW_AT_byte_size   : 1
    <f79>   DW_AT_encoding    : 8	(unsigned char)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x1c1b5): unsigned char
 <1><f7e>: Abbrev Number: 4 (DW_TAG_base_type)
    <f7f>   DW_AT_byte_size   : 2
    <f80>   DW_AT_encoding    : 5	(signed)
    <f81>   DW_AT_name        : (indirect string, offset: 0x697c4): short int
 <1><f85>: Abbrev Number: 4 (DW_TAG_base_type)
    <f86>   DW_AT_byte_size   : 2
    <f87>   DW_AT_encoding    : 7	(unsigned)
    <f88>   DW_AT_name        : (indirect string, offset: 0x88593): short unsigned int
 <1><f8c>: Abbrev Number: 4 (DW_TAG_base_type)
    <f8d>   DW_AT_byte_size   : 4
    <f8e>   DW_AT_encoding    : 5	(signed)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xb87a): long int
 <1><f93>: Abbrev Number: 6 (DW_TAG_typedef)
    <f94>   DW_AT_name        : (indirect string, offset: 0x59469): __uint32_t
    <f98>   DW_AT_decl_file   : 2
    <f99>   DW_AT_decl_line   : 79
    <f9a>   DW_AT_decl_column : 25
    <f9b>   DW_AT_type        : <0xf9f>
 <1><f9f>: Abbrev Number: 4 (DW_TAG_base_type)
    <fa0>   DW_AT_byte_size   : 4
    <fa1>   DW_AT_encoding    : 7	(unsigned)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x2a9f4): long unsigned int
 <1><fa6>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <fa7>   DW_AT_type        : <0xf9f>
 <1><fab>: Abbrev Number: 4 (DW_TAG_base_type)
    <fac>   DW_AT_byte_size   : 8
    <fad>   DW_AT_encoding    : 7	(unsigned)
    <fae>   DW_AT_name        : (indirect string, offset: 0x1cc06): long long unsigned int
 <1><fb2>: Abbrev Number: 6 (DW_TAG_typedef)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x66775): uint32_t
    <fb7>   DW_AT_decl_file   : 3
    <fb8>   DW_AT_decl_line   : 48
    <fb9>   DW_AT_decl_column : 20
    <fba>   DW_AT_type        : <0xf93>
 <1><fbe>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <fbf>   DW_AT_type        : <0xfb2>
 <1><fc3>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <fc4>   DW_AT_byte_size   : 4
 <1><fc5>: Abbrev Number: 4 (DW_TAG_base_type)
    <fc6>   DW_AT_byte_size   : 1
    <fc7>   DW_AT_encoding    : 8	(unsigned char)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x2cc1e): char
 <1><fcc>: Abbrev Number: 11 (DW_TAG_structure_type)
    <fcd>   DW_AT_byte_size   : 24
    <fce>   DW_AT_decl_file   : 4
    <fcf>   DW_AT_decl_line   : 213
    <fd0>   DW_AT_decl_column : 9
    <fd0>   DW_AT_sibling     : <0x101c>
 <2><fd4>: Abbrev Number: 12 (DW_TAG_member)
    <fd5>   DW_AT_name        : CR
    <fd8>   DW_AT_decl_file   : 4
    <fd8>   DW_AT_decl_line   : 215
    <fd9>   DW_AT_decl_column : 17
    <fd9>   DW_AT_type        : <0xfbe>
    <fdd>   DW_AT_data_member_location: 0
 <2><fde>: Abbrev Number: 1 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x8ee3b): NDTR
    <fe3>   DW_AT_decl_file   : 4
    <fe4>   DW_AT_decl_line   : 216
    <fe5>   DW_AT_decl_column : 17
    <fe6>   DW_AT_type        : <0xfbe>
    <fea>   DW_AT_data_member_location: 4
 <2><feb>: Abbrev Number: 12 (DW_TAG_member)
    <fec>   DW_AT_name        : PAR
    <ff0>   DW_AT_decl_file   : 4
    <ff0>   DW_AT_decl_line   : 217
    <ff1>   DW_AT_decl_column : 17
    <ff1>   DW_AT_type        : <0xfbe>
    <ff5>   DW_AT_data_member_location: 8
 <2><ff6>: Abbrev Number: 1 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x8ee0d): M0AR
    <ffb>   DW_AT_decl_file   : 4
    <ffc>   DW_AT_decl_line   : 218
    <ffd>   DW_AT_decl_column : 17
    <ffe>   DW_AT_type        : <0xfbe>
    <1002>   DW_AT_data_member_location: 12
 <2><1003>: Abbrev Number: 1 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0x8ee9b): M1AR
    <1008>   DW_AT_decl_file   : 4
    <1009>   DW_AT_decl_line   : 219
    <100a>   DW_AT_decl_column : 17
    <100b>   DW_AT_type        : <0xfbe>
    <100f>   DW_AT_data_member_location: 16
 <2><1010>: Abbrev Number: 12 (DW_TAG_member)
    <1011>   DW_AT_name        : FCR
    <1015>   DW_AT_decl_file   : 4
    <1015>   DW_AT_decl_line   : 220
    <1016>   DW_AT_decl_column : 17
    <1016>   DW_AT_type        : <0xfbe>
    <101a>   DW_AT_data_member_location: 20
 <2><101b>: Abbrev Number: 0
 <1><101c>: Abbrev Number: 6 (DW_TAG_typedef)
    <101d>   DW_AT_name        : (indirect string, offset: 0x8f0b1): DMA_Stream_TypeDef
    <1021>   DW_AT_decl_file   : 4
    <1022>   DW_AT_decl_line   : 221
    <1023>   DW_AT_decl_column : 3
    <1024>   DW_AT_type        : <0xfcc>
 <1><1028>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1029>   DW_AT_byte_size   : 84
    <102a>   DW_AT_decl_file   : 4
    <102b>   DW_AT_decl_line   : 469
    <102d>   DW_AT_decl_column : 9
    <102d>   DW_AT_sibling     : <0x1142>
 <2><1031>: Abbrev Number: 5 (DW_TAG_member)
    <1032>   DW_AT_name        : CR1
    <1036>   DW_AT_decl_file   : 4
    <1036>   DW_AT_decl_line   : 471
    <1038>   DW_AT_decl_column : 17
    <1038>   DW_AT_type        : <0xfbe>
    <103c>   DW_AT_data_member_location: 0
 <2><103d>: Abbrev Number: 5 (DW_TAG_member)
    <103e>   DW_AT_name        : CR2
    <1042>   DW_AT_decl_file   : 4
    <1042>   DW_AT_decl_line   : 472
    <1044>   DW_AT_decl_column : 17
    <1044>   DW_AT_type        : <0xfbe>
    <1048>   DW_AT_data_member_location: 4
 <2><1049>: Abbrev Number: 3 (DW_TAG_member)
    <104a>   DW_AT_name        : (indirect string, offset: 0x2868c): SMCR
    <104e>   DW_AT_decl_file   : 4
    <104f>   DW_AT_decl_line   : 473
    <1051>   DW_AT_decl_column : 17
    <1052>   DW_AT_type        : <0xfbe>
    <1056>   DW_AT_data_member_location: 8
 <2><1057>: Abbrev Number: 3 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0x2ca37): DIER
    <105c>   DW_AT_decl_file   : 4
    <105d>   DW_AT_decl_line   : 474
    <105f>   DW_AT_decl_column : 17
    <1060>   DW_AT_type        : <0xfbe>
    <1064>   DW_AT_data_member_location: 12
 <2><1065>: Abbrev Number: 5 (DW_TAG_member)
    <1066>   DW_AT_name        : SR
    <1069>   DW_AT_decl_file   : 4
    <1069>   DW_AT_decl_line   : 475
    <106b>   DW_AT_decl_column : 17
    <106b>   DW_AT_type        : <0xfbe>
    <106f>   DW_AT_data_member_location: 16
 <2><1070>: Abbrev Number: 5 (DW_TAG_member)
    <1071>   DW_AT_name        : EGR
    <1075>   DW_AT_decl_file   : 4
    <1075>   DW_AT_decl_line   : 476
    <1077>   DW_AT_decl_column : 17
    <1077>   DW_AT_type        : <0xfbe>
    <107b>   DW_AT_data_member_location: 20
 <2><107c>: Abbrev Number: 3 (DW_TAG_member)
    <107d>   DW_AT_name        : (indirect string, offset: 0x81e54): CCMR1
    <1081>   DW_AT_decl_file   : 4
    <1082>   DW_AT_decl_line   : 477
    <1084>   DW_AT_decl_column : 17
    <1085>   DW_AT_type        : <0xfbe>
    <1089>   DW_AT_data_member_location: 24
 <2><108a>: Abbrev Number: 3 (DW_TAG_member)
    <108b>   DW_AT_name        : (indirect string, offset: 0x36dd1): CCMR2
    <108f>   DW_AT_decl_file   : 4
    <1090>   DW_AT_decl_line   : 478
    <1092>   DW_AT_decl_column : 17
    <1093>   DW_AT_type        : <0xfbe>
    <1097>   DW_AT_data_member_location: 28
 <2><1098>: Abbrev Number: 3 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0x1d0c1): CCER
    <109d>   DW_AT_decl_file   : 4
    <109e>   DW_AT_decl_line   : 479
    <10a0>   DW_AT_decl_column : 17
    <10a1>   DW_AT_type        : <0xfbe>
    <10a5>   DW_AT_data_member_location: 32
 <2><10a6>: Abbrev Number: 5 (DW_TAG_member)
    <10a7>   DW_AT_name        : CNT
    <10ab>   DW_AT_decl_file   : 4
    <10ab>   DW_AT_decl_line   : 480
    <10ad>   DW_AT_decl_column : 17
    <10ad>   DW_AT_type        : <0xfbe>
    <10b1>   DW_AT_data_member_location: 36
 <2><10b2>: Abbrev Number: 5 (DW_TAG_member)
    <10b3>   DW_AT_name        : PSC
    <10b7>   DW_AT_decl_file   : 4
    <10b7>   DW_AT_decl_line   : 481
    <10b9>   DW_AT_decl_column : 17
    <10b9>   DW_AT_type        : <0xfbe>
    <10bd>   DW_AT_data_member_location: 40
 <2><10be>: Abbrev Number: 5 (DW_TAG_member)
    <10bf>   DW_AT_name        : ARR
    <10c3>   DW_AT_decl_file   : 4
    <10c3>   DW_AT_decl_line   : 482
    <10c5>   DW_AT_decl_column : 17
    <10c5>   DW_AT_type        : <0xfbe>
    <10c9>   DW_AT_data_member_location: 44
 <2><10ca>: Abbrev Number: 5 (DW_TAG_member)
    <10cb>   DW_AT_name        : RCR
    <10cf>   DW_AT_decl_file   : 4
    <10cf>   DW_AT_decl_line   : 483
    <10d1>   DW_AT_decl_column : 17
    <10d1>   DW_AT_type        : <0xfbe>
    <10d5>   DW_AT_data_member_location: 48
 <2><10d6>: Abbrev Number: 3 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x103e3): CCR1
    <10db>   DW_AT_decl_file   : 4
    <10dc>   DW_AT_decl_line   : 484
    <10de>   DW_AT_decl_column : 17
    <10df>   DW_AT_type        : <0xfbe>
    <10e3>   DW_AT_data_member_location: 52
 <2><10e4>: Abbrev Number: 3 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x39c22): CCR2
    <10e9>   DW_AT_decl_file   : 4
    <10ea>   DW_AT_decl_line   : 485
    <10ec>   DW_AT_decl_column : 17
    <10ed>   DW_AT_type        : <0xfbe>
    <10f1>   DW_AT_data_member_location: 56
 <2><10f2>: Abbrev Number: 3 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x6c4ec): CCR3
    <10f7>   DW_AT_decl_file   : 4
    <10f8>   DW_AT_decl_line   : 486
    <10fa>   DW_AT_decl_column : 17
    <10fb>   DW_AT_type        : <0xfbe>
